sources_org/shell.org
;-*- mode: Org; fill-column: 110;-*-
* tty - teletype or terminal
** keys

-  https://ss64.com/bash/syntax-keyboard.html
- $ info readline
- https://git.savannah.gnu.org/cgit/readline.git/tree/doc/rluserman.info
- man termios
It's basically a device (implemented in software nowadays)
*** Caret notation
- caret (^)

Often a control character can be typed on a keyboard by holding down the Ctrl and typing the character shown
 after the caret.

Caret notation dont support Shift key. ^K - key should be uppercase
