shell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 12:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4b69ead">1. tty - teletype or terminal</a>
<ul>
<li><a href="#orgb40fce9">1.1. keys</a>
<ul>
<li><a href="#orgbb0fc98">1.1.1. Caret notation</a></li>
<li><a href="#orga36041b">1.1.2. my collected</a></li>
<li><a href="#orgadecc97">1.1.3. special Bash keys</a></li>
<li><a href="#orgb4c1c8f">1.1.4. History:</a></li>
<li><a href="#orgc9f1b30">1.1.5. Process control:</a></li>
<li><a href="#orga6bd60b">1.1.6. Moving the cursor:</a></li>
<li><a href="#org12b6ad3">1.1.7. Editing:</a></li>
</ul>
</li>
<li><a href="#org189fbfc">1.2. how it works</a></li>
<li><a href="#org0fbdf5d">1.3. terminal related commands:</a></li>
<li><a href="#org582fd60">1.4. escape codes</a></li>
<li><a href="#org07b94e1">1.5. <span class="todo TODO">TODO</span> POSIX terminal interface</a></li>
<li><a href="#org6c3949b">1.6. pseudo-teletypes (PTS)</a></li>
<li><a href="#org22a5f53">1.7. history links</a></li>
<li><a href="#orgb408955">1.8. tty scroll</a>
<ul>
<li><a href="#org5c88f61">1.8.1. screen</a></li>
</ul>
</li>
<li><a href="#orge169bb7">1.9. clipboard</a></li>
<li><a href="#org0e6eb5d">1.10. keymaps, dvorak</a></li>
<li><a href="#org0f2030a">1.11. ASCII</a></li>
</ul>
</li>
<li><a href="#orgeaf2832">2. shell</a>
<ul>
<li><a href="#org370be30">2.1. variables</a></li>
<li><a href="#orgda09c95">2.2. Enveronmental Variables</a></li>
<li><a href="#org9ce1c98">2.3. Wildcard</a>
<ul>
<li><a href="#orgfa2999b">2.3.1. Standard Wildcards (globbing patterns)</a></li>
<li><a href="#org6e9fa16">2.3.2. advanced</a></li>
<li><a href="#org2ed49ce">2.3.3. classes</a></li>
<li><a href="#orga6e2dcf">2.3.4. links</a></li>
</ul>
</li>
<li><a href="#org3d73a76">2.4. {} Curly Braces</a></li>
<li><a href="#org7d01593">2.5. {} Brace Expansion</a></li>
<li><a href="#orgdbd9cf9">2.6. Extended globs</a></li>
<li><a href="#org34d6bf0">2.7. stdin(0), stdout(1), and stderr(2), pipes</a>
<ul>
<li><a href="#orgeba692f">2.7.1. pipeline</a></li>
<li><a href="#orgfd5b230">2.7.2. redirection</a></li>
<li><a href="#org2632e7f">2.7.3. close file descriptors/streams</a></li>
<li><a href="#orgc2bb308">2.7.4. "2&gt;&amp;1 &gt;file" vs "&gt; file 2&gt;&amp;1"</a></li>
<li><a href="#org1e6174f">2.7.5. stderr to pipe</a></li>
<li><a href="#orge95c2b6">2.7.6. redirect stdout to file and to stdout</a></li>
<li><a href="#org85309c4">2.7.7. named pipe</a></li>
<li><a href="#org9ef57d3">2.7.8. not all output?</a></li>
</ul>
</li>
<li><a href="#orge5a16ac">2.8. String processing</a>
<ul>
<li><a href="#org6328fff">2.8.1. multiline string - HereDoc</a></li>
<li><a href="#org3da81fe">2.8.2. sort</a></li>
<li><a href="#org79c9a92">2.8.3. cut - get column</a></li>
<li><a href="#orgd05a1e4">2.8.4. sed</a></li>
<li><a href="#orga704e08">2.8.5. grep</a></li>
<li><a href="#orgf160d7f">2.8.6. python</a></li>
<li><a href="#org95cf77c">2.8.7. perl</a></li>
<li><a href="#org3962a66">2.8.8. awk</a></li>
<li><a href="#orge0b9052">2.8.9. uniq</a></li>
<li><a href="#org4b01b7d">2.8.10. strip remove leading and trailing white spaces</a></li>
<li><a href="#org16fc79a">2.8.11. tail</a></li>
</ul>
</li>
<li><a href="#org31f8664">2.9. Process Control</a></li>
<li><a href="#orge81fc41">2.10. Programming</a>
<ul>
<li><a href="#org0674648">2.10.1. shebang</a></li>
<li><a href="#org074db0d">2.10.2. pros and cons</a></li>
<li><a href="#org5a635dd">2.10.3. Hello World.sh, scriptinga</a></li>
<li><a href="#org614bcb5">2.10.4. arguments</a></li>
<li><a href="#org0b793ad">2.10.5. array</a></li>
<li><a href="#org6e99b52">2.10.6. comparision Posix</a></li>
<li><a href="#orgdb29a13">2.10.7. numbers comparision</a></li>
<li><a href="#org05e3829">2.10.8. strings comparision</a></li>
<li><a href="#org374d016">2.10.9. if</a></li>
<li><a href="#orgdcb9d85">2.10.10. loop</a></li>
<li><a href="#org3311fa8">2.10.11. file comparision</a></li>
<li><a href="#orga34f5b1">2.10.12. functions</a></li>
<li><a href="#orgbe61c7f">2.10.13. debug </a></li>
<li><a href="#org4846fde">2.10.14. exit status</a></li>
<li><a href="#org7701081">2.10.15. generate random</a></li>
<li><a href="#orgd56fa26">2.10.16. documentation</a></li>
<li><a href="#orgd3004ca">2.10.17. best practices</a></li>
<li><a href="#orgcf9c587">2.10.18. export</a></li>
<li><a href="#orga9d1d1e">2.10.19. null command</a></li>
<li><a href="#org9fc9537">2.10.20. multiline comment</a></li>
<li><a href="#org36f75d3">2.10.21. read</a></li>
<li><a href="#orgd5b03b3">2.10.22. Templates</a></li>
<li><a href="#org3121e14">2.10.23. links</a></li>
</ul>
</li>
<li><a href="#org402c539">2.11. set builtin </a>
<ul>
<li><a href="#orgeb0c27f">2.11.1. usage</a></li>
<li><a href="#org49e37b0">2.11.2. traps</a></li>
</ul>
</li>
<li><a href="#org0e44ab1">2.12. ls</a>
<ul>
<li><a href="#orgc40482e">2.12.1. get direcotories</a></li>
<li><a href="#org8ffadd1">2.12.2. Linux File Timestamps</a></li>
</ul>
</li>
<li><a href="#orgdac21fb">2.13. pushd/popd and dirs</a></li>
<li><a href="#org657c10a">2.14. sh script</a></li>
<li><a href="#org224f39d">2.15. source &amp; ./ &amp; exec</a></li>
<li><a href="#orgb789acf">2.16. ariphmetic</a></li>
<li><a href="#orgda4ca81">2.17. execute command</a></li>
<li><a href="#orgf495c4e">2.18. xargs</a></li>
<li><a href="#orgdefccb7">2.19. history save with time</a></li>
<li><a href="#orgc1d6388">2.20. id -u user</a></li>
<li><a href="#org686a4bb">2.21. diff</a></li>
<li><a href="#orgdd83a06">2.22. date</a></li>
<li><a href="#org0911f8e">2.23. ps </a>
<ul>
<li><a href="#orgb13eb93">2.23.1. Column	Description</a></li>
<li><a href="#orga00db97">2.23.2. stat code with description</a></li>
</ul>
</li>
<li><a href="#orgf56289e">2.24. top </a>
<ul>
<li><a href="#orgbb89ca5">2.24.1. view description</a></li>
</ul>
</li>
<li><a href="#org17ea2a7">2.25. pgrep</a></li>
<li><a href="#org972fb99">2.26. vmstat</a></li>
<li><a href="#orgf573286">2.27. pmap</a></li>
<li><a href="#org78bddcb">2.28. find</a>
<ul>
<li><a href="#org9ffe2c2">2.28.1. find [options] [starting-point&#x2026;] [ex‐pression]</a></li>
<li><a href="#org8c2d212">2.28.2. links</a></li>
</ul>
</li>
<li><a href="#orgc9ff91d">2.29. dd</a>
<ul>
<li><a href="#org1ad68c0">2.29.1. usecases</a></li>
<li><a href="#orgcd1afcc">2.29.2. bs</a></li>
<li><a href="#org5699861">2.29.3. cteate disk</a></li>
</ul>
</li>
<li><a href="#org7228bd5">2.30. access control to files</a></li>
<li><a href="#org8b22236">2.31. for external storages</a></li>
<li><a href="#orgb93638b">2.32. filesystem block size</a></li>
<li><a href="#org0f496f3">2.33. tar</a></li>
<li><a href="#orgf53b46f">2.34. compression</a>
<ul>
<li><a href="#orgb7f786b">2.34.1. tar.7z</a></li>
<li><a href="#orgb0e0cb6">2.34.2. zip</a></li>
<li><a href="#org21e7aa4">2.34.3. links</a></li>
</ul>
</li>
<li><a href="#orgc857e9c">2.35. curl</a>
<ul>
<li><a href="#orga0b8295">2.35.1. SOCKS5 proxy</a></li>
<li><a href="#orgc77829c">2.35.2. mimic browser request:</a></li>
<li><a href="#org2fb931e">2.35.3. POST GET</a></li>
<li><a href="#org913f084">2.35.4. POST paramters</a></li>
<li><a href="#org5a9c930">2.35.5. FTP</a></li>
</ul>
</li>
<li><a href="#orga5209f2">2.36. du - file space usage</a></li>
<li><a href="#org6d8355a">2.37. man, info, help</a>
<ul>
<li><a href="#orgdb2b7d4">2.37.1. history</a></li>
<li><a href="#org4f25a95">2.37.2. man</a></li>
<li><a href="#orga7b0b58">2.37.3. info </a></li>
</ul>
</li>
<li><a href="#orgcbedb7a">2.38. less</a></li>
<li><a href="#org12684f7">2.39. date</a></li>
<li><a href="#org19269f4">2.40. tee</a>
<ul>
<li><a href="#orgb0c0d90">2.40.1. freeze problem</a></li>
</ul>
</li>
<li><a href="#org419d03b">2.41. time</a></li>
<li><a href="#orgbf8d280">2.42. lsfd</a></li>
<li><a href="#orgbbc4a31">2.43. fuser</a></li>
<li><a href="#orgc996d92">2.44. administration commands</a>
<ul>
<li><a href="#org5821b7f">2.44.1. memory</a></li>
</ul>
</li>
<li><a href="#orgb9afc3f">2.45. USECASES</a></li>
<li><a href="#org899765d">2.46. USECASE: save output of command to cash</a></li>
<li><a href="#org41209ab">2.47. USECASE: case - set environment varibles per directory after cd command</a></li>
<li><a href="#org752bdb1">2.48. USECASE: find N last modified files in current directory and subdirs</a></li>
<li><a href="#orgeeee35a">2.49. links</a></li>
</ul>
</li>
<li><a href="#org4739f7c">3. Bash new features</a>
<ul>
<li><a href="#orgc540f97">3.1. links</a></li>
</ul>
</li>
<li><a href="#orge5e9080">4. tmux</a>
<ul>
<li><a href="#org2685fd6">4.1. status</a></li>
<li><a href="#org57a54e5">4.2. terms</a></li>
<li><a href="#orgf6907d7">4.3. keys</a></li>
<li><a href="#org4d8bc03">4.4. commands</a></li>
<li><a href="#org95c848f">4.5. xorg start and terminal unused</a></li>
<li><a href="#org8bcc2a3">4.6. xorg system clipboard - How to copy to clipboard?</a></li>
<li><a href="#org5279b3a">4.7. kill deattached sessions</a></li>
<li><a href="#org93f5491">4.8. option</a></li>
<li><a href="#org9b42904">4.9. rebind keys</a></li>
</ul>
</li>
<li><a href="#org5481568">5. SSH</a>
<ul>
<li><a href="#orgcad8fc4">5.1. config files</a></li>
<li><a href="#orgf404acc">5.2. permissions</a></li>
<li><a href="#orgbb73a63">5.3. authentication types</a></li>
<li><a href="#org0cc8441">5.4. usage</a></li>
<li><a href="#org68c03f4">5.5. commands</a></li>
<li><a href="#org6a655b2">5.6. 1) ssh server - password</a></li>
<li><a href="#org161d7c7">5.7. 2) ssh server - generate key - public key and private key</a></li>
<li><a href="#orgca2a192">5.8. 3) sftp server</a></li>
<li><a href="#orgcbfeb30">5.9. 4) X11 Forwarding</a></li>
<li><a href="#org5c4bb06">5.10. 5) sshfs - client</a></li>
<li><a href="#orga4fef71">5.11. <span class="todo TODO">TODO</span> Internet over socks</a></li>
<li><a href="#orga29a232">5.12. DNS over socks</a></li>
<li><a href="#orgcf2300e">5.13. ssh-agent</a></li>
<li><a href="#org462cadf">5.14. agent forwarding problem</a></li>
<li><a href="#orge2641e5">5.15. ssh-copy-id</a></li>
<li><a href="#orge0849ae">5.16. inside of ssh</a></li>
<li><a href="#orgf2d000e">5.17. old</a></li>
<li><a href="#orgc9cec63">5.18. githib ~/.ssh/config</a></li>
<li><a href="#orgf1b4503">5.19. key type</a></li>
<li><a href="#orga1ad062">5.20. security</a></li>
<li><a href="#org274104f">5.21. Port Forwarding/Tunneling</a>
<ul>
<li><a href="#org0571d16">5.21.1. Local</a></li>
<li><a href="#org205db21">5.21.2. Remote</a></li>
<li><a href="#orge08efeb">5.21.3. Dynamic</a></li>
<li><a href="#orgea14aeb">5.21.4. examples</a></li>
</ul>
</li>
<li><a href="#org72429c7">5.22. Reverse SSH Tunnel</a></li>
<li><a href="#org6c9ad97">5.23. USE CASES</a></li>
<li><a href="#org76c2e4f">5.24. rsync</a>
<ul>
<li><a href="#orgdca80ba">5.24.1. troubleshooting</a></li>
</ul>
</li>
<li><a href="#org364dfdd">5.25. user with limited permissions</a></li>
<li><a href="#org9b6452c">5.26. links</a></li>
<li><a href="#org57dd1f7">5.27. ssh over socks5</a></li>
<li><a href="#orge0e5780">5.28. problems</a></li>
<li><a href="#org1408c25">5.29. ssh as a tor hidden service </a></li>
<li><a href="#orgad1f13a">5.30. ssh systemd service</a></li>
<li><a href="#orgbfa3163">5.31. rsync over ssh</a></li>
<li><a href="#org5671998">5.32. timeouts</a></li>
</ul>
</li>
<li><a href="#org0ae2905">6. Text User Interface (TUI)</a></li>
<li><a href="#org1889ee8">7. jq - JSON parser</a>
<ul>
<li><a href="#org0405d1d">7.1. output format</a></li>
<li><a href="#orgae7a53e">7.2. access</a></li>
<li><a href="#orgb326a4f">7.3. merge</a></li>
<li><a href="#orga966f41">7.4. building</a></li>
</ul>
</li>
<li><a href="#orgd0f7aae">8. fish</a></li>
<li><a href="#orgc3cf0d9">9. print JSON</a></li>
</ul>
</div>
</div>
<p>
;-<b>- mode: Org; fill-column: 110;-</b>-
</p>
<div id="outline-container-org4b69ead" class="outline-2">
<h2 id="org4b69ead"><span class="section-number-2">1.</span> tty - teletype or terminal</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb40fce9" class="outline-3">
<h3 id="orgb40fce9"><span class="section-number-3">1.1.</span> keys</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://ss64.com/bash/syntax-keyboard.html">https://ss64.com/bash/syntax-keyboard.html</a></li>
<li>$ info readline</li>
<li><a href="https://git.savannah.gnu.org/cgit/readline.git/tree/doc/rluserman.info">https://git.savannah.gnu.org/cgit/readline.git/tree/doc/rluserman.info</a></li>
<li>man termios</li>
</ul>
<p>
It's basically a device (implemented in software nowadays)
</p>
</div>
<div id="outline-container-orgbb0fc98" class="outline-4">
<h4 id="orgbb0fc98"><span class="section-number-4">1.1.1.</span> Caret notation</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>caret (^)</li>
</ul>

<p>
Often a control character can be typed on a keyboard by holding down the Ctrl and typing the character shown
 after the caret.
</p>

<p>
Caret notation dont support Shift key. ^K - key should be uppercase
</p>
</div>
</div>
