shell.html
<div id="outline-container-orga36041b" class="outline-4">
<h4 id="orga36041b"><span class="section-number-4">1.1.2.</span> my collected</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-text">Ctrl+-          undo

Ctrl+[          Escape
Ctrl+I          Tab
Ctrl+M          Enter

Autocompletion:
Alt+/           autocompletion for path
Alt-*           list all completion for command/path

Ctrl+J          Newline
Ctrl+v          tells the terminal to not interpret the following character, so Ctrl+v Ctrl-I will display a tab character,
similarly Ctrl+v ENTER will display the escape sequence for the Enter key: ^M

Ctrl + C        SIGINT, Break command
Ctrl + Z        in background, commands: jobs, fg, bg
Ctrl + D        SIGTSTP, logout
Ctrl + \        SIGQUIT

Ctrl + XX       toggle cursor from current position to begining and back
Alt+U/L to UPPER/LOWER case word
Alt+C           upper first letter of word

Ctrl/Alt + D:   Delete one char/to end of word starting at the cursor

Ctrl + u/k      erase line to begining/end of line
Ctrl + w        cut word before cursor
Alt + k cut word before cursor
Alt + b         cut word after cursor
Ctrl+y          yank

Alt + c capitalize word after cursor


Ctrl+S  Stops all output on-screen (XOFF).
Ctrl+Q  Turns all output stopped on-screen back on (XON). Also, closes an application window.

Alt+SysRq+r Unraw       Take control of keyboard back from X.   4
Alt+SysRq+e Terminate   Send SIGTERM to all processes, allowing them to terminate gracefully.   64
Alt+SysRq+i Kill        Send SIGKILL to all processes, forcing them to terminate immediately.
Alt+SysRq+s Sync        Flush data to disk.     16      -
Alt+SysRq+u Unmount     Unmount and remount all filesystems read-only.  32      -
Alt+SysRq+b Reboot      Reboot  128
Alt+SysRq+k SAK
Alt+SysRq+f OOM kill
Alt+SysRq+j Thaw

X
Ctrl+Alt+F1, F2, F3, ...        Switch to n-th virtual console  If it does not work, try Ctrl+Alt+Fn+F&#8230;.
Shift+Insert    Paste text from the PRIMARY buffer

M-O     in console activates when some key is pressed and holded for some time
</pre>
</div>
<ul class="org-ul">
<li><a href="https://ss64.com/bash/syntax-keyboard.html">https://ss64.com/bash/syntax-keyboard.html</a></li>
<li><a href="https://catern.com/posts/terminal_quirks.html">https://catern.com/posts/terminal_quirks.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgadecc97" class="outline-4">
<h4 id="orgadecc97"><span class="section-number-4">1.1.3.</span> special Bash keys</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<a href="https://git.savannah.gnu.org/cgit/bash.git/tree/bashline.c?id=3ba697465bc74fab513a26dea700cc82e9f4724e#n957">https://git.savannah.gnu.org/cgit/bash.git/tree/bashline.c?id=3ba697465bc74fab513a26dea700cc82e9f4724e#n957</a>
<a href="https://www.gnu.org/savannah-checkouts/gnu/bash/manual/bash.html">https://www.gnu.org/savannah-checkouts/gnu/bash/manual/bash.html</a>
C-x ~ - bash<sub>possible</sub><sub>username</sub><sub>completions</sub>
C-x @ - bash<sub>complete</sub><sub>hostname</sub>
C-x C-$ - bash<sub>complete</sub><sub>variable</sub>
C-x C-! - bash<sub>complete</sub><sub>command</sub>
C-x / - bash<sub>complete</sub><sub>filename</sub>
C-x C-e - Bash attempts to invoke $FCEDIT, $EDITOR, and emacs as the editor, in that order.
C-x C-v - Bash version
C-x C-r - re-reads this init file, thus incorporating any changes that you might have made to it.
</p>

<p>
Alt+number - repeat next key
</p>

<p>
C-_ or C-x C-u  Undo the last editing command. You can undo all the way back to an empty line.
</p>
</div>
</div>
<div id="outline-container-orgb4c1c8f" class="outline-4">
<h4 id="orgb4c1c8f"><span class="section-number-4">1.1.4.</span> History:</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-text">  Ctrl + r   Recall the last command including the specified character(s).
             searches the command history as you type. Ctrl + Shift + r - reverse reverse-i-search
             Equivalent to : vim ~/.bash_history.
  Ctrl + n/p  Next/Previous command in history (i.e. walk back through the command history).

  Ctrl + s   Go back to the next most recent command.
             (beware to not execute it from a terminal because this will also launch its XOFF).
  Ctrl + o   Execute the command found via Ctrl+r or Ctrl+s
  Ctrl + g   Escape from history searching mode
        !!   Repeat last command
       !n    Repeat from the last command: args n e.g. !:2 for the second argumant.
       !n:m  Repeat from the last command: args from n to m. e.g. !:2-3 for the second and third.
       !n:$  Repeat from the last command: args n to the last argument.
       !n:p  Print last command starting with n
     !string Print the last command beginning with string.
       !:q   Quote the last command with proper Bash escaping applied.
              Tip: enter a line of Bash starting with a # comment, then run !:q on the next line to escape it.
        !$   Last argument of previous command.
   ALT + .   Last argument of previous command.
        !*   All arguments of previous command.
^abc&#173;^&#173;def   Run previous command, replacing abc with def
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9f1b30" class="outline-4">
<h4 id="orgc9f1b30"><span class="section-number-4">1.1.5.</span> Process control:</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">
<pre class="src src-text">
 Ctrl + C   Interrupt/Kill whatever you are running (SIGINT).
 Ctrl + l   Clear the screen.
 Ctrl + s   Stop output to the screen (for long running verbose commands).
            Then use PgUp/PgDn for navigation.
 Ctrl + q   Allow output to the screen (if previously stopped using command above).
 Ctrl + D   Send an EOF marker, unless disabled by an option, this will close the current shell (EXIT).
 Ctrl + Z   Send the signal SIGTSTP to the current task, which suspends it.
            To return to it later enter fg 'process name' (foreground).
</pre>
</div>
</div>
</div>
<div id="outline-container-orga6bd60b" class="outline-4">
<h4 id="orga6bd60b"><span class="section-number-4">1.1.6.</span> Moving the cursor:</h4>
<div class="outline-text-4" id="text-1-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Ctrl + a</td>
<td class="org-left">Go to the beginning of the line (Home)</td>
</tr>

<tr>
<td class="org-left">Ctrl + e</td>
<td class="org-left">Go to the End of the line (End)</td>
</tr>

<tr>
<td class="org-left">Ctrl + p</td>
<td class="org-left">Previous command (Up arrow)</td>
</tr>

<tr>
<td class="org-left">Ctrl + n</td>
<td class="org-left">Next command (Down arrow)</td>
</tr>

<tr>
<td class="org-left">Alt + b</td>
<td class="org-left">Back (left) one word</td>
</tr>

<tr>
<td class="org-left">Alt + f</td>
<td class="org-left">Forward (right) one word</td>
</tr>

<tr>
<td class="org-left">Ctrl + f</td>
<td class="org-left">Forward one character</td>
</tr>

<tr>
<td class="org-left">Ctrl + b</td>
<td class="org-left">Backward one character</td>
</tr>

<tr>
<td class="org-left">Ctrl + xx</td>
<td class="org-left">Toggle between the start of line and current cursor position</td>
</tr>
</tbody>
</table>
</div>
</div>
