sources_org/shell.org
*** Editing:
| Ctrl + L   | Clear the Screen, similar to the clear command                                    |
| Alt + Del  | Delete the Word before the cursor.                                                |
|            |                                                                                   |
| Alt + d    | Delete the Word after the cursor.                                                 |
| Ctrl + d   | Delete character under the cursor                                                 |
| Ctrl + h   | Delete character before the cursor (Backspace)                                    |
|            |                                                                                   |
| Ctrl + w   | Cut the Word before the cursor to the clipboard.                                  |
| Ctrl + k/u | Cut the Line after/before the cursor to the clipboard.                            |
|            |                                                                                   |
| Alt + t    | Swap current word with previous                                                   |
| Ctrl + t   | Swap the last two characters before the cursor (typo).                            |
| Esc  + t   | Swap the last two words before the cursor.                                        |
|            |                                                                                   |
| ctrl + y   | Paste the last thing to be cut (yank)                                             |
| Alt + u    | UPPER capitalize every character from the cursor to the end of the current word.  |
| Alt + l    | Lower the case of every character from the cursor to the end of the current word. |
| Alt + c    | Capitalize the character under the cursor and move to the end of the word.        |
| Alt + r    | Cancel the changes and put back the line as it was in the history (revert).       |
| ctrl + _   | Undo                                                                              |
** how it works
https://unix.stackexchange.com/questions/4126/what-is-the-exact-difference-between-a-terminal-a-shell-a-tty-and-a-con
https://dev.to/napicella/linux-terminals-tty-pty-and-shell-192e
https://www.oreilly.com/library/view/linux-device-drivers/0596005903/ch18.html
https://en.wikipedia.org/wiki/POSIX_terminal_interface
https://habr.com/ru/post/460257/
https://medium.com/securitythread/linux-terminal-subsystem-d000475c8dd
www.embeddedlinux.org.cn/essentiallinuxdevicedrivers/final/ch06lev1sec4.html

tty - teletypewriter https://en.wikipedia.org/wiki/Teleprinter

- terminal - became a computer program in the kernel which would send characters directly to the TTY
  driver, read from it and print to the screen.
  - is a character-oriented device, comprising streams of characters received from and sent to the
    device,  dev/tty - device which implements a number of additional commands (ioctls) beyond read and write.
  - consist of:
    - character device interface ( open, read, write, close …)
    - Line discipline
    - driver - keyboard IO, display
  - may be: kernel program or pseudo terminal or serial device (old)
  - communicate with the terminal through terminal character device file
- terminal emulator - the kernel program emulate the physical terminal device. it listens for events
  coming from the keyboard and sends it down to the driver
- pseudo-terminal (pty) - provided by terminal emulators - it's not a kernel program but one that
  runs in the user land.
- System console - interface more
  1. physical device consisting of a keyboard and a screen
  2. text entry and display device for system administration messages
- Virtual console/virtual terminal - Ctrl+Alt+F1234
  - On each virtual terminal, a getty process is run, which in turn runs /bin/login to authenticate a user.
  - supported at the Linux kernel level
  - are emulated text terminals, using the keyboard and monitor of a personal computer or workstation
- terminal monitor program spawns (sets TERM env - Specifies the terminal type.)
  - may be:
    - getty TERM=linux
    - SSH server ( to the same terminal type as the SSH client)
    - software terminal emulator, using a pseudoterminal ( sets the TERM environment variable to
      specify the type of terminal that it is emulating)
      - GNU Screen program sets /screen/ as the terminal type.
- shell - user space app
- escape code - . Certain sequences of bytes, most starting with an ASCII escape character and a
  bracket character, are embedded into text to control cursor location, color, font styling, and
  other options on video text terminals and terminal emulators.
  - man console_codes - Linux console escape and control sequences


Terminal emulator(get keys and draw gui) -> PTY master -> tty driver(with line discipline) -> pty slave -> bash

По умолчанию TTY устройство работает в каноничном режиме с включенным эхо (echoing). Эхо — это
отображение введенных вами символов на экране.

GNU Readline - library that provides in-line editing and history capabilities - supports both Emacs and vi
 editing modes

 terminfo - used by TERM enveronmental variable. which strings to send for clear screen, move cursor, etc.
 - database: /usr/share/terminfo/*/* - /etc/terminfo/*/*
 - default = /etc/terminfo/l/linux

agetty - opens a tty port
** terminal related commands:
- who
- w
- last
- tty
- ps
- stty - change terminal settings, prints baud rate, line discipline, and deviations from stty  sane
  - stty -a  - get all
  - stty icanon -echo - disable echo
  - stty raw echo
  - stty <control-character> <string>
  - stty erase 0
- reset - reset terminal after cat binary file
- infocmp  - compare or print out terminfo descriptions
** escape codes
The escape codes received from the terminal signify things such as function key, arrow key, and
other special keystrokes (home key, end key, help key, PgUp key, PgDn key, insert key, delete key,
and so forth)
** TODO POSIX terminal interface
** pseudo-teletypes (PTS)
The multiplexor is the master, and the PTS are the slaves. The multiplexor is addressed by the
kernel through the device file located at /dev/ptmx.

** history links
https://www.computernetworkingnotes.com/linux-tutorials/linux-virtual-console-and-terminal-explained.html
https://www.howtogeek.com/428174/what-is-a-tty-on-linux-and-how-to-use-the-tty-command/
** tty scroll
- tmux
