shell.html

<div id="outline-container-org12b6ad3" class="outline-4">
<h4 id="org12b6ad3"><span class="section-number-4">1.1.7.</span> Editing:</h4>
<div class="outline-text-4" id="text-1-1-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Ctrl + L</td>
<td class="org-left">Clear the Screen, similar to the clear command</td>
</tr>

<tr>
<td class="org-left">Alt + Del</td>
<td class="org-left">Delete the Word before the cursor.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Alt + d</td>
<td class="org-left">Delete the Word after the cursor.</td>
</tr>

<tr>
<td class="org-left">Ctrl + d</td>
<td class="org-left">Delete character under the cursor</td>
</tr>

<tr>
<td class="org-left">Ctrl + h</td>
<td class="org-left">Delete character before the cursor (Backspace)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Ctrl + w</td>
<td class="org-left">Cut the Word before the cursor to the clipboard.</td>
</tr>

<tr>
<td class="org-left">Ctrl + k/u</td>
<td class="org-left">Cut the Line after/before the cursor to the clipboard.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Alt + t</td>
<td class="org-left">Swap current word with previous</td>
</tr>

<tr>
<td class="org-left">Ctrl + t</td>
<td class="org-left">Swap the last two characters before the cursor (typo).</td>
</tr>

<tr>
<td class="org-left">Esc  + t</td>
<td class="org-left">Swap the last two words before the cursor.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ctrl + y</td>
<td class="org-left">Paste the last thing to be cut (yank)</td>
</tr>

<tr>
<td class="org-left">Alt + u</td>
<td class="org-left">UPPER capitalize every character from the cursor to the end of the current word.</td>
</tr>

<tr>
<td class="org-left">Alt + l</td>
<td class="org-left">Lower the case of every character from the cursor to the end of the current word.</td>
</tr>

<tr>
<td class="org-left">Alt + c</td>
<td class="org-left">Capitalize the character under the cursor and move to the end of the word.</td>
</tr>

<tr>
<td class="org-left">Alt + r</td>
<td class="org-left">Cancel the changes and put back the line as it was in the history (revert).</td>
</tr>

<tr>
<td class="org-left">ctrl + _</td>
<td class="org-left">Undo</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org189fbfc" class="outline-3">
<h3 id="org189fbfc"><span class="section-number-3">1.2.</span> how it works</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://unix.stackexchange.com/questions/4126/what-is-the-exact-difference-between-a-terminal-a-shell-a-tty-and-a-con">https://unix.stackexchange.com/questions/4126/what-is-the-exact-difference-between-a-terminal-a-shell-a-tty-and-a-con</a>
<a href="https://dev.to/napicella/linux-terminals-tty-pty-and-shell-192e">https://dev.to/napicella/linux-terminals-tty-pty-and-shell-192e</a>
<a href="https://www.oreilly.com/library/view/linux-device-drivers/0596005903/ch18.html">https://www.oreilly.com/library/view/linux-device-drivers/0596005903/ch18.html</a>
<a href="https://en.wikipedia.org/wiki/POSIX_terminal_interface">https://en.wikipedia.org/wiki/POSIX_terminal_interface</a>
<a href="https://habr.com/ru/post/460257/">https://habr.com/ru/post/460257/</a>
<a href="https://medium.com/securitythread/linux-terminal-subsystem-d000475c8dd">https://medium.com/securitythread/linux-terminal-subsystem-d000475c8dd</a>
www.embeddedlinux.org.cn/essentiallinuxdevicedrivers/final/ch06lev1sec4.html
</p>

<p>
tty - teletypewriter <a href="https://en.wikipedia.org/wiki/Teleprinter">https://en.wikipedia.org/wiki/Teleprinter</a>
</p>

<ul class="org-ul">
<li>terminal - became a computer program in the kernel which would send characters directly to the TTY
driver, read from it and print to the screen.
<ul class="org-ul">
<li>is a character-oriented device, comprising streams of characters received from and sent to the
device,  dev/tty - device which implements a number of additional commands (ioctls) beyond read and write.</li>
<li>consist of:
<ul class="org-ul">
<li>character device interface ( open, read, write, close …)</li>
<li>Line discipline</li>
<li>driver - keyboard IO, display</li>
</ul></li>
<li>may be: kernel program or pseudo terminal or serial device (old)</li>
<li>communicate with the terminal through terminal character device file</li>
</ul></li>
<li>terminal emulator - the kernel program emulate the physical terminal device. it listens for events
coming from the keyboard and sends it down to the driver</li>
<li>pseudo-terminal (pty) - provided by terminal emulators - it's not a kernel program but one that
runs in the user land.</li>
<li>System console - interface more
<ol class="org-ol">
<li>physical device consisting of a keyboard and a screen</li>
<li>text entry and display device for system administration messages</li>
</ol></li>
<li>Virtual console/virtual terminal - Ctrl+Alt+F1234
<ul class="org-ul">
<li>On each virtual terminal, a getty process is run, which in turn runs /bin/login to authenticate a user.</li>
<li>supported at the Linux kernel level</li>
<li>are emulated text terminals, using the keyboard and monitor of a personal computer or workstation</li>
</ul></li>
<li>terminal monitor program spawns (sets TERM env - Specifies the terminal type.)
<ul class="org-ul">
<li>may be:
<ul class="org-ul">
<li>getty TERM=linux</li>
<li>SSH server ( to the same terminal type as the SSH client)</li>
<li>software terminal emulator, using a pseudoterminal ( sets the TERM environment variable to
specify the type of terminal that it is emulating)
<ul class="org-ul">
<li>GNU Screen program sets <i>screen</i> as the terminal type.</li>
</ul></li>
</ul></li>
</ul></li>
<li>shell - user space app</li>
<li>escape code - . Certain sequences of bytes, most starting with an ASCII escape character and a
bracket character, are embedded into text to control cursor location, color, font styling, and
other options on video text terminals and terminal emulators.
<ul class="org-ul">
<li>man console<sub>codes</sub> - Linux console escape and control sequences</li>
</ul></li>
</ul>


<p>
Terminal emulator(get keys and draw gui) -&gt; PTY master -&gt; tty driver(with line discipline) -&gt; pty slave -&gt; bash
</p>

<p>
По умолчанию TTY устройство работает в каноничном режиме с включенным эхо (echoing). Эхо — это
отображение введенных вами символов на экране.
</p>

<p>
GNU Readline - library that provides in-line editing and history capabilities - supports both Emacs and vi
 editing modes
</p>

<p>
terminfo - used by TERM enveronmental variable. which strings to send for clear screen, move cursor, etc.
</p>
<ul class="org-ul">
<li>database: /usr/share/terminfo/*/* - /etc/terminfo/*/*</li>
<li>default = /etc/terminfo/l/linux</li>
</ul>

<p>
agetty - opens a tty port
</p>
</div>
</div>
<div id="outline-container-org0fbdf5d" class="outline-3">
<h3 id="org0fbdf5d"><span class="section-number-3">1.3.</span> terminal related commands:</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>who</li>
<li>w</li>
<li>last</li>
<li>tty</li>
<li>ps</li>
<li>stty - change terminal settings, prints baud rate, line discipline, and deviations from stty  sane
<ul class="org-ul">
<li>stty -a  - get all</li>
<li>stty icanon -echo - disable echo</li>
<li>stty raw echo</li>
<li>stty &lt;control-character&gt; &lt;string&gt;</li>
<li>stty erase 0</li>
</ul></li>
<li>reset - reset terminal after cat binary file</li>
<li>infocmp  - compare or print out terminfo descriptions</li>
</ul>
</div>
</div>
<div id="outline-container-org582fd60" class="outline-3">
<h3 id="org582fd60"><span class="section-number-3">1.4.</span> escape codes</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The escape codes received from the terminal signify things such as function key, arrow key, and
other special keystrokes (home key, end key, help key, PgUp key, PgDn key, insert key, delete key,
and so forth)
</p>
</div>
</div>
<div id="outline-container-org07b94e1" class="outline-3">
<h3 id="org07b94e1"><span class="section-number-3">1.5.</span> <span class="todo TODO">TODO</span> POSIX terminal interface</h3>
</div>
<div id="outline-container-org6c3949b" class="outline-3">
<h3 id="org6c3949b"><span class="section-number-3">1.6.</span> pseudo-teletypes (PTS)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The multiplexor is the master, and the PTS are the slaves. The multiplexor is addressed by the
kernel through the device file located at /dev/ptmx.
</p>
</div>
</div>

<div id="outline-container-org22a5f53" class="outline-3">
<h3 id="org22a5f53"><span class="section-number-3">1.7.</span> history links</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="https://www.computernetworkingnotes.com/linux-tutorials/linux-virtual-console-and-terminal-explained.html">https://www.computernetworkingnotes.com/linux-tutorials/linux-virtual-console-and-terminal-explained.html</a>
<a href="https://www.howtogeek.com/428174/what-is-a-tty-on-linux-and-how-to-use-the-tty-command/">https://www.howtogeek.com/428174/what-is-a-tty-on-linux-and-how-to-use-the-tty-command/</a>
</p>
</div>
</div>
