sources_org/shell.org
*** screen
Ctrl-A, Esc - now Page Up, Page down
Esc - exit

without:
 - Ctrl+z - background
 - $ fg - front

Scroll:
Ctrl-A, Esc - now Page Up, Page down

 - screen - start
 - Ctrl+a+c create new
 - Ctrl+a+" list

 - Ctrl+a+d deattach
 - Ctrl+a+b next window
 - Ctrl+a   to last used
 - Ctrl+a+0 switch to 0 screen
 - Shift+a - Set title for window.

Copy/paste
- Ctrl-A, Esc
- Enter, Enter
- Ctrl-A, ] - paste

** clipboard
1. emerge x11-misc/xsel
   - bind '"\C-p": "\C-e\C-u xsel <<"EOF"\n\C-y\nEOF\n\C-y"'
2. emerge x11-misc/xclip
   - cat a | xclip -sel clip

**** configure
tmux show-options -g | grep status

** keymaps, dvorak
ubuntu: apt install console-keymaps
- loadkeys /usr/share/keymaps/i386/dvorak/dvorak.kmap.gz
** ASCII
#+begin_src text
0 ^@ 	\0 	Null
1 ^A 		Start of Heading
2 ^B 		Start of Text
3 ^C 		End of Text
4 ^D 		End of Transmission
5 ^E 		Enquiry
6 ^F 		Acknowledgement
7 ^G 	\a 	Bell
8 ^H 	\b 	Backspace[e][f]
9 ^I 	\t 	Horizontal Tab[g]
10 ^J	\n 	Line Feed
11 ^K 	\v 	Vertical Tab
12 ^L	\f 	Form Feed
13 ^M	\r 	Carriage Return[h]
14 ^N		Shift Out
15 ^O		Shift In
16 ^P 		Data Link Escape
17 ^Q		Device Control 1 (often XON)
18 ^R		Device Control 2
19 ^S		Device Control 3 (often XOFF)
20 ^T		Device Control 4
21 ^U 		Negative Acknowledgement
22 ^V 		Synchronous Idle
23 ^W 		End of Transmission Block
24 ^X 		Cancel
25 ^Y 		End of Medium
26 ^Z 		Substitute
27 ^[ 	\e[i] 	Escape[j]
28 ^\ 		File Separator
29 ^] 		Group Separator
30 ^^ 		Record Separator
31 ^_ 		Unit Separator

32 space
33 !	Exclamation mark
34 "	Double quotes (or speech marks)
35 #	Number sign
36 $	Dollar
37 %	Per cent sign
38 &	Ampersand
39 '	Single quote
40 (	Open parenthesis (or open bracket)
41 )	Close parenthesis (or close bracket)
42 *	Asterisk
43 +	Plus
44 ,	Comma
45 -	Hyphen-minus
46 .	Period, dot or full stop
47 /	Slash or divide
48 0
49 1
50 2
51 3
52 4
53 5
54 6
55 7
56 8
57 9
58 :	Colon
59 ;	Semicolon
60 <	Less than (or open angled bracket)
61 =	Equals
62 >	Greater than (or close angled bracket)
63 ?	Question mark
64 @, `, @	At sign
65 A
66 B
67 C
68 D
69 E
70 F
71 G
72 H
73 I
74 J
75 K
76 L
77 M
78 N
79 O
80 P
81 Q
82 R
83 S
84 T
85 U
86 V
87 W
88 X
89 Y
90 Z
91 [	Opening bracket
92 \, ~, \	Backslash
93 ]	Closing bracket
94 ↑, ^	Caret - circumflex
95 ←, _	Underscore
96 @, `	Grave accent
97 a
98 b
99 c
100 d
101 e
102 f
103 g
104 h
105 i
106 j
107 k
108 l
109 m
110 n
111 o
112 p
113 q
114 r
115 s
116 t
117 u
118 v
119 w
120 x
121 y
122 z
123 {	Opening brace
124 ACK, ¬, |	Vertical bar
125 }	Closing brace
126 ESC, |, ~	Equivalency sign - tilde
127 DEL	Delete
#+end_src

sessions:
- tmux new-session -d top
- tmux ; C-b ( - switch to background session with top
- C-b ) ; C-d - deattach from background session
* shell
You may indent or not indent however you like
** variables
${ varname } is general syntax for $variable
- $_ At shell startup, set to the pathname used to invoke the shell or shell script being executed
- $1 - first parameter
- $#: How many command line parameters were passed to the script.
- $?: The exit status of the last process to run.
- $$: The Process ID (PID) of the current script.
- $* is a single string that consists of all of the positional parameters, separated by the first character in the environment variable IFS
- $@: All the command line parameters passed to the script. Cat be set: $set -- 1 2 3
- $USER: The username of the user executing the script.
- $HOSTNAME: The hostname of the computer running the script.
- $SECONDS: The number of seconds the script has been running for.
- $RANDOM: Returns a random number.
- $LINENO: Returns the current line number of the script.
- IFS (internal field separator), which is a space, TAB, and NEWLINE by default.
- env | less # environment variables


my=Dave
my="Dave Green"
file_count=$(ls $folder_to_count | wc -l) # miltiline

export mt_var # to save variables to outside of the script

multiline variable (heredoc):
#+begin_src sh
method1="This is line no.1\nThis is line no.3\nThis is line no.3"
echo -e $method1


read -r -d '' MULTI_LINE_VAR << EOM
Print line 1.
Print line 2.
Print line 3
EOM
#+end_src
** Enveronmental Variables
- ( set -o posix ; set ) | less
- env
- printenv - same as env
** Wildcard
*** Standard Wildcards (globbing patterns)
globbing for pathnames

used by nearly any command
- man 7 glob
- ^$ - begin and end
- . - any single character
- \ - escaping
- [] - character in range
*** advanced
move all except one:
- shopt -s extglob
- mv !(fileOne) ~/path/newFolder

: ls hello.???

: ls [a-p0-5]*.* # dot means dot

[!...] or [^...] which matches any character except the ones in the set.

brace expansion {}
- it actually generates all the permutations of the pattern you specify and then performs wildcard expansion on the results.
- echo d{a,e,i,u,o}g => dag deg dig dug dog
- echo d{a..z}g =>  dag dbg dcg ddg deg dfg dgg dhg dig djg dkg dlg dmg dng dog dpg dqg drg dsg dtg dug dvg dwg dxg dyg dzg
- echo {cat,dog} => cat dog
- echo {cat,d*} => cat dawg dg dig dog doug dug
- echo {j{p,pe}g,png} => jpg jpeg png
- echo .{mp{3..4},m4{a,b,p,v}} => .mp3 .mp4 .m4a .m4b .m4p .m4v
