shell.html
<div id="outline-container-orgb408955" class="outline-3">
<h3 id="orgb408955"><span class="section-number-3">1.8.</span> tty scroll</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>tmux</li>
</ul>
</div>
<div id="outline-container-org5c88f61" class="outline-4">
<h4 id="org5c88f61"><span class="section-number-4">1.8.1.</span> screen</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
Ctrl-A, Esc - now Page Up, Page down
Esc - exit
</p>

<p>
without:
</p>
<ul class="org-ul">
<li>Ctrl+z - background</li>
<li>$ fg - front</li>
</ul>

<p>
Scroll:
Ctrl-A, Esc - now Page Up, Page down
</p>

<ul class="org-ul">
<li>screen - start</li>
<li>Ctrl+a+c create new</li>
<li>Ctrl+a+" list</li>

<li>Ctrl+a+d deattach</li>
<li>Ctrl+a+b next window</li>
<li>Ctrl+a   to last used</li>
<li>Ctrl+a+0 switch to 0 screen</li>
<li>Shift+a - Set title for window.</li>
</ul>

<p>
Copy/paste
</p>
<ul class="org-ul">
<li>Ctrl-A, Esc</li>
<li>Enter, Enter</li>
<li>Ctrl-A, ] - paste</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge169bb7" class="outline-3">
<h3 id="orge169bb7"><span class="section-number-3">1.9.</span> clipboard</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>emerge x11-misc/xsel
<ul class="org-ul">
<li>bind '"\C-p": "\C-e\C-u xsel &lt;&lt;"EOF"\n\C-y\nEOF\n\C-y"'</li>
</ul></li>
<li>emerge x11-misc/xclip
<ul class="org-ul">
<li>cat a | xclip -sel clip</li>
</ul></li>
</ol>
</div>

<ol class="org-ol">
<li><a id="org400d788"></a>configure<br />
<div class="outline-text-5" id="text-1-9-0-1">
<p>
tmux show-options -g | grep status
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0e6eb5d" class="outline-3">
<h3 id="org0e6eb5d"><span class="section-number-3">1.10.</span> keymaps, dvorak</h3>
<div class="outline-text-3" id="text-1-10">
<p>
ubuntu: apt install console-keymaps
</p>
<ul class="org-ul">
<li>loadkeys /usr/share/keymaps/i386/dvorak/dvorak.kmap.gz</li>
</ul>
</div>
</div>
<div id="outline-container-org0f2030a" class="outline-3">
<h3 id="org0f2030a"><span class="section-number-3">1.11.</span> ASCII</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-text">0 ^@    \0      Null
1 ^A            Start of Heading
2 ^B            Start of Text
3 ^C            End of Text
4 ^D            End of Transmission
5 ^E            Enquiry
6 ^F            Acknowledgement
7 ^G    \a      Bell
8 ^H    \b      Backspace[e][f]
9 ^I    \t      Horizontal Tab[g]
10 ^J   \n      Line Feed
11 ^K   \v      Vertical Tab
12 ^L   \f      Form Feed
13 ^M   \r      Carriage Return[h]
14 ^N           Shift Out
15 ^O           Shift In
16 ^P           Data Link Escape
17 ^Q           Device Control 1 (often XON)
18 ^R           Device Control 2
19 ^S           Device Control 3 (often XOFF)
20 ^T           Device Control 4
21 ^U           Negative Acknowledgement
22 ^V           Synchronous Idle
23 ^W           End of Transmission Block
24 ^X           Cancel
25 ^Y           End of Medium
26 ^Z           Substitute
27 ^[   \e[i]   Escape[j]
28 ^\           File Separator
29 ^]           Group Separator
30 ^^           Record Separator
31 ^_           Unit Separator

32 space
33 !    Exclamation mark
34 "    Double quotes (or speech marks)
35 #    Number sign
36 $    Dollar
37 %    Per cent sign
38 &amp;    Ampersand
39 '    Single quote
40 (    Open parenthesis (or open bracket)
41 )    Close parenthesis (or close bracket)
42 *    Asterisk
43 +    Plus
44 ,    Comma
45 -    Hyphen-minus
46 .    Period, dot or full stop
47 /    Slash or divide
48 0
49 1
50 2
51 3
52 4
53 5
54 6
55 7
56 8
57 9
58 :    Colon
59 ;    Semicolon
60 &lt;    Less than (or open angled bracket)
61 =    Equals
62 &gt;    Greater than (or close angled bracket)
63 ?    Question mark
64 @, `, @      At sign
65 A
66 B
67 C
68 D
69 E
70 F
71 G
72 H
73 I
74 J
75 K
76 L
77 M
78 N
79 O
80 P
81 Q
82 R
83 S
84 T
85 U
86 V
87 W
88 X
89 Y
90 Z
91 [    Opening bracket
92 \, ~, \      Backslash
93 ]    Closing bracket
94 &#8593;, ^ Caret - circumflex
95 &#8592;, _ Underscore
96 @, ` Grave accent
97 a
98 b
99 c
100 d
101 e
102 f
103 g
104 h
105 i
106 j
107 k
108 l
109 m
110 n
111 o
112 p
113 q
114 r
115 s
116 t
117 u
118 v
119 w
120 x
121 y
122 z
123 {   Opening brace
124 ACK, &#172;, |   Vertical bar
125 }   Closing brace
126 ESC, |, ~   Equivalency sign - tilde
127 DEL Delete
</pre>
</div>

<p>
sessions:
</p>
<ul class="org-ul">
<li>tmux new-session -d top</li>
<li>tmux ; C-b ( - switch to background session with top</li>
<li>C-b ) ; C-d - deattach from background session</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgeaf2832" class="outline-2">
<h2 id="orgeaf2832"><span class="section-number-2">2.</span> shell</h2>
<div class="outline-text-2" id="text-2">
<p>
You may indent or not indent however you like
</p>
</div>
<div id="outline-container-org370be30" class="outline-3">
<h3 id="org370be30"><span class="section-number-3">2.1.</span> variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
${ varname } is general syntax for $variable
</p>
<ul class="org-ul">
<li>$_ At shell startup, set to the pathname used to invoke the shell or shell script being executed</li>
<li>$1 - first parameter</li>
<li>$#: How many command line parameters were passed to the script.</li>
<li>$?: The exit status of the last process to run.</li>
<li>$$: The Process ID (PID) of the current script.</li>
<li>$* is a single string that consists of all of the positional parameters, separated by the first character in the environment variable IFS</li>
<li>$@: All the command line parameters passed to the script. Cat be set: $set &#x2013; 1 2 3</li>
<li>$USER: The username of the user executing the script.</li>
<li>$HOSTNAME: The hostname of the computer running the script.</li>
<li>$SECONDS: The number of seconds the script has been running for.</li>
<li>$RANDOM: Returns a random number.</li>
<li>$LINENO: Returns the current line number of the script.</li>
<li>IFS (internal field separator), which is a space, TAB, and NEWLINE by default.</li>
<li>env | less # environment variables</li>
</ul>


<p>
my=Dave
my="Dave Green"
file<sub>count</sub>=$(ls $folder<sub>to</sub><sub>count</sub> | wc -l) # miltiline
</p>

<p>
export mt<sub>var</sub> # to save variables to outside of the script
</p>

<p>
multiline variable (heredoc):
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682;">method1</span>=<span style="color: #95e454;">"This is line no.1\nThis is line no.3\nThis is line no.3"</span>
<span style="color: #e5786d;">echo</span> -e $<span style="color: #cae682;">method1</span>


<span style="color: #e5786d;">read</span> -r -d <span style="color: #95e454;">''</span> MULTI_LINE_VAR &lt;&lt; EOM
<span style="color: #ffff00; font-weight: bold;">Print line 1.</span>
<span style="color: #ffff00; font-weight: bold;">Print line 2.</span>
<span style="color: #ffff00; font-weight: bold;">Print line 3</span>
<span style="color: #ffff00; font-weight: bold;">EOM</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgda09c95" class="outline-3">
<h3 id="orgda09c95"><span class="section-number-3">2.2.</span> Enveronmental Variables</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>( set -o posix ; set ) | less</li>
<li>env</li>
<li>printenv - same as env</li>
</ul>
</div>
</div>
<div id="outline-container-org9ce1c98" class="outline-3">
<h3 id="org9ce1c98"><span class="section-number-3">2.3.</span> Wildcard</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgfa2999b" class="outline-4">
<h4 id="orgfa2999b"><span class="section-number-4">2.3.1.</span> Standard Wildcards (globbing patterns)</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
globbing for pathnames
</p>

<p>
used by nearly any command
</p>
<ul class="org-ul">
<li>man 7 glob</li>
<li>^$ - begin and end</li>
<li>. - any single character</li>
<li>\ - escaping</li>
<li>[] - character in range</li>
</ul>
</div>
</div>
<div id="outline-container-org6e9fa16" class="outline-4">
<h4 id="org6e9fa16"><span class="section-number-4">2.3.2.</span> advanced</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
move all except one:
</p>
<ul class="org-ul">
<li>shopt -s extglob</li>
<li>mv !(fileOne) ~/path/newFolder</li>
</ul>

<pre class="example">
ls hello.???
</pre>


<pre class="example">
ls [a-p0-5]*.* # dot means dot
</pre>


<p>
[!&#x2026;] or [^&#x2026;] which matches any character except the ones in the set.
</p>

<p>
brace expansion {}
</p>
<ul class="org-ul">
<li>it actually generates all the permutations of the pattern you specify and then performs wildcard expansion on the results.</li>
<li>echo d{a,e,i,u,o}g =&gt; dag deg dig dug dog</li>
<li>echo d{a..z}g =&gt;  dag dbg dcg ddg deg dfg dgg dhg dig djg dkg dlg dmg dng dog dpg dqg drg dsg dtg dug dvg dwg dxg dyg dzg</li>
<li>echo {cat,dog} =&gt; cat dog</li>
<li>echo {cat,d*} =&gt; cat dawg dg dig dog doug dug</li>
<li>echo {j{p,pe}g,png} =&gt; jpg jpeg png</li>
<li>echo .{mp{3..4},m4{a,b,p,v}} =&gt; .mp3 .mp4 .m4a .m4b .m4p .m4v</li>
</ul>
</div>
</div>
