sources_org/shell.org
*** classes
- [:alpha:] 	It is used to match with any uppercase and lowercase letter and equivalent to [a-zA-Z].
- [:digit:] 	It is used to match with any digits and is equivalent to [0-9].
- [:alnum:] 	It is used to match any alphabet and digit. It is equivalent to [a-zA-Z].
- [:upper:] 	It is used to match with uppercase latter only and equivalent to [A-Z]
- [:lower:] 	It is used to match with uppercase latter only and equivalent to [a-z]
- [:blank:] 	It is used to match with space and tab.
- [:print:] 	It is used to match with printable characters.
- [:cntrl:] 	It is used to match with non-printable characters.
- [:space:] 	It is used to match with while-space.
- [:xdigit:] 	It is used to match with hexadecimal digits.
- [:ascii:] 	It is used to match with ASCII characters.
- [:word:] 	It is used to alphanumeric characters including underscore(_).
*** links
- linux wildcard https://tldp.org/LDP/GNU-Linux-Tools-Summary/html/x11655.htm
