shell.html
<div id="outline-container-org2ed49ce" class="outline-4">
<h4 id="org2ed49ce"><span class="section-number-4">2.3.3.</span> classes</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>[:alpha:] 	It is used to match with any uppercase and lowercase letter and equivalent to [a-zA-Z].</li>
<li>[:digit:] 	It is used to match with any digits and is equivalent to [0-9].</li>
<li>[:alnum:] 	It is used to match any alphabet and digit. It is equivalent to [a-zA-Z].</li>
<li>[:upper:] 	It is used to match with uppercase latter only and equivalent to [A-Z]</li>
<li>[:lower:] 	It is used to match with uppercase latter only and equivalent to [a-z]</li>
<li>[:blank:] 	It is used to match with space and tab.</li>
<li>[:print:] 	It is used to match with printable characters.</li>
<li>[:cntrl:] 	It is used to match with non-printable characters.</li>
<li>[:space:] 	It is used to match with while-space.</li>
<li>[:xdigit:] 	It is used to match with hexadecimal digits.</li>
<li>[:ascii:] 	It is used to match with ASCII characters.</li>
<li>[:word:] 	It is used to alphanumeric characters including underscore(_).</li>
</ul>
</div>
</div>
<div id="outline-container-orga6e2dcf" class="outline-4">
<h4 id="orga6e2dcf"><span class="section-number-4">2.3.4.</span> links</h4>
<div class="outline-text-4" id="text-2-3-4">
<ul class="org-ul">
<li>linux wildcard <a href="https://tldp.org/LDP/GNU-Linux-Tools-Summary/html/x11655.htm">https://tldp.org/LDP/GNU-Linux-Tools-Summary/html/x11655.htm</a></li>
</ul>
</div>
</div>
</div>
