shell.html
<div id="outline-container-org3d73a76" class="outline-3">
<h3 id="org3d73a76"><span class="section-number-3">2.4.</span> {} Curly Braces</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682;">a</span>=<span style="color: #95e454;">"asdasdvvv22"</span>
<span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">a</span>//vvv}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">$ echo {0..10}
0 1 2 3 4 5 6 7 8 9 10
<span style="color: #e5786d;">echo</span> a{d,c,b}e
ade ace abe
<span style="color: #e5786d;">echo</span> {a..z}{a..z}
aa ab ac ad ae af ag ah ai aj ak al am an ao ap aq ar as at au av aw ax ...
<span style="color: #cae682;">month</span>=(<span style="color: #95e454;">"Jan"</span> <span style="color: #95e454;">"Feb"</span> <span style="color: #95e454;">"Mar"</span> <span style="color: #95e454;">"Apr"</span>)
<span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">month</span>[3]}
Apr
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">{ ... } to group the output from several commands into one big blob</span>
{ <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"I found all these PNGs:"</span>; find . -iname <span style="color: #95e454;">"*.png"</span>; <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"Within this bunch of files:"</span>; ls; } &gt; PNGs.txt

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Parameter Expansion:</span>
<span style="color: #cae682;">parameter</span>=22 &amp;&amp; <span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">0</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">parent command paramters</span>
bash
<span style="color: #cae682;">parameter</span>=22 &amp;&amp; <span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">parameter</span>
22
<span style="color: #cae682;">parameter</span>=22 &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">parameter</span>}
22
<span style="color: #cae682;">parameter</span>=abcd &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">parameter</span>:1} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">get [1:] ${parameter:offset:length}</span>
bcd
<span style="color: #cae682;">a</span>=213 &amp;&amp; <span style="color: #cae682;">p</span>=a &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">!</span>p} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">indirection</span>
213
<span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">!</span>#} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">"#" stores the number of arguments !#=0</span>
<span style="color: #cae682;">array</span>=(2 1 3) &amp;&amp; ${<span style="color: #cae682;">array</span>[@]} == ${<span style="color: #cae682;">array</span>[*]} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">all elements</span>
bash
<span style="color: #cae682;">p</span>=abc &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>^} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">The ^ operator modifies the first character to uppercase, the , operator to lowercase</span>
Abc
<span style="color: #cae682;">p</span>=abc &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>^^} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">uppercase</span>
ABC
<span style="color: #cae682;">p</span>=ABC &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>~} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">change case of first letter</span>
aBC
<span style="color: #cae682;">p</span>=ABC &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>~} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">change case - lowercase or uppercase</span>
abc
<span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">BASH</span>*}  <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">${!PREFIX*} or ${!PREFIX@}  variable names beginning with the string PREFIX</span>
BASH BASH_ARGC BASH_ARGV BASH_COMMAND BASH_LINENO BASH_SOURCE BASH_SUBSHELL BASH_VERSINFO BASH_VERSION

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Substring removal:</span>
<span style="color: #cae682;">a</span>=<span style="color: #95e454;">"Hello World!"</span> &amp;&amp; <span style="color: #e5786d;">echo</span> Goodbye${<span style="color: #cae682;">a</span>#Hello} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">a chunk from the beginning of a variable</span>
Goodbye World!
<span style="color: #cae682;">a</span>=<span style="color: #95e454;">"Too longgg"</span> &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">a</span>%gg} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">chops off the last two gg and prints &#8220;Too long&#8220;.</span>
Too long
<span style="color: #cae682;">p</span>=123 &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>%??} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">remove 23</span>
1
<span style="color: #fa8072;">#  </span><span style="color: #99968b; font-style: italic;">"#" will try to remove the shortest text matching the pattern, while "##" tries to do it with the longest text matching.</span>
<span style="color: #cae682;">MYSTRING</span>=<span style="color: #95e454;">"Be liberal in what you accept, and conservative in what you send"</span> &amp;&amp;  <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">MYSTRING</span>#*in}
what you accept, and conservative<span style="color: #8ac6f2; font-weight: bold;"> in</span> what you send
<span style="color: #cae682;">MYSTRING</span>=<span style="color: #95e454;">"Be liberal in what you accept, and conservative in what you send"</span> &amp;&amp;  <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">MYSTRING</span>##*in}
what you send

    Get name without extension
        ${<span style="color: #cae682;">FILENAME</span>%.*}
        &#8658; bash_hackers.txt
    Get extension
        ${<span style="color: #cae682;">FILENAME</span>##*.}
        &#8658; bash_hackers.txt
    Get directory name
        ${<span style="color: #cae682;">PATHNAME</span>%/*}
        &#8658; /home/bash/bash_hackers.txt
    Get filename
        ${<span style="color: #cae682;">PATHNAME</span>##*/}
        &#8658; /home/bash/bash_hackers.txt

    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"${array[@]%is}"</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Simple example, removing a trailing is from all array elements (on expansion):</span>
        &#8658; Th a text
        (it was: This is a text)

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Search and replace</span>
${<span style="color: #cae682;">PARAMETER</span>/PATTERN/STRING} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">first occurrence</span>
${<span style="color: #cae682;">PARAMETER</span>//PATTERN/STRING} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">all occurrence</span>
${<span style="color: #cae682;">PARAMETER</span>/PATTERN} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">remove</span>
${<span style="color: #cae682;">PARAMETER</span>//PATTERN} <span style="color: #fa8072;">#</span><span style="color: #99968b; font-style: italic;">same</span>

<span style="color: #cae682;">p</span>=abc &amp;&amp; <span style="color: #e5786d;">echo</span> ${#<span style="color: #cae682;">p</span>} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">length</span>
3

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Use a default value</span>
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>:-aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">if unset or empty</span>
aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">v</span>:-aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">if unset</span>
aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>:=aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">p=aaa now</span>
aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>=aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">p=aaa now dont print</span>
<span style="color: #95e454;">""</span>
<span style="color: #cae682;">p</span>=123 &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>:+aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">is set and not empty. but ignore p value</span>
aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>:+aaa}
<span style="color: #95e454;">""</span>
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>+aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">is set (empy or not). but ignore p value</span>
aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>:?aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">if not set or empty</span>
bash: p: aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>:?aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">if not set or empty</span>
bash: p: aaa
<span style="color: #cae682;">p</span>= &amp;&amp; <span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">p</span>?aaa} <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">if not set</span>
<span style="color: #95e454;">""</span>
</pre>
</div>

<p>
Split string:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682;">var</span>=/home/bash/bash_hackers.txt
<span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">var</span>%_*}
<span style="color: #e5786d;">echo</span> ${<span style="color: #cae682;">var</span>##*_}
</pre>
</div>
</div>
</div>
