sources_org/shell.org
** {} Brace Expansion
- ls *{txt,log} list all files ending with txt or log in the current directory
- cp ~/projects/adders/verilog/{half_,full_}adder.v . copy half_adder.v and full_adder.v to current directory
- mv story.txt{,.bkp} rename story.txt as story.txt.bkp
- cp story.txt{,.bkp} to create bkp file as well retain original
- mv story.txt{.bkp,} rename story.txt.bkp as story.txt
- mv story{,_old}.txt rename story.txt as story_old.txt
- touch file{1..4}.txt same as touch file1.txt file2.txt file3.txt file4.txt
- touch file_{x..z}.txt same as touch file_x.txt file_y.txt file_z.txt
- rm file{1..4}.txt same as rm file1.txt file2.txt file3.txt file4.txt
- echo story.txt{,.bkp} displays the expanded version 'story.txt story.txt.bkp' , useful to dry run before executing actual command

** Extended globs
- ?(pattern-list) Matches zero or one occurrence of the given patterns
- *(pattern-list) Matches zero or more occurrences of the given patterns
- +(pattern-list) Matches one or more occurrences of the given patterns
- @(pattern-list) Matches one of the given patterns
- !(pattern-list) Matches anything except one of the given patterns

sheck if enabled:
: $ shopt extglob
: extglob            on

ex.
: $ ls !(*.txt)
: main.c  math.h  power.log

** stdin(0), stdout(1), and stderr(2), pipes
standard streams == file descriptors

Commands has:
- 0 <- terminal
- 1 -> terminal
- 2 -> terminal
*** pipeline
- '|&' equal to '2>&1 |' std out+err to std input
-  | - pipe stdout only
- command >(command1) >(command2g) - pipe to two and more processes
- command 2> >(command) >c - pipe
- (command1 ; command2 ; command3) | command4
*** redirection
 - redirect stdout to a file	ls > a.txt
 - redirect stderr to a file	2> a.txt
 - redirect stdout to a stderr	ls 1>&2 >&2
 - redirect stderr to a stdout	ls 2>&1
 - redirect stderr and stdout to a file	ls &> /dev/null
 - redirect stderr and stdout to stdout &>&1
 - redirect stderr and stdout to stderr &>&2

>&2 means copy file descriptor 2 to 1 both will refer to the 2

more:
- command 3> file # open new file descriptor
- command < file # standard input from file

- tee a b c - redirection to multiple files (>a >b >c - not working)
*** close file descriptors/streams
- >&- 2>&- 3>&- # close 1,2,3
- <&- # close 0
*** "2>&1 >file" vs "> file 2>&1"
2>& - do nothing becouse 0,1,2 -> points to terminal

command >file 2>&1 (or just &>)
- stdout = file
- stderr = file

command 2>&1 >file   - redirects only stdout to file
- stderr is redirected to stdout
  - stderr = stdout_target
- stdout = file
*** stderr to pipe
command 2>&1 >/dev/null | grep 'something'
1) First copy stderr to stdout - all stderr
2) redirect stdout to /dev/null
3) pipe stdout

*** redirect stdout to file and to stdout
: command | tee >(tee) > file
*** named pipe
the FIFO file must be opened on both ends
- mkfifo pipe0 # create file
- mkfifo -m 644 pipe0
- echo "input message" > pipe0
- cat pipe0
*** not all output?
script -c 'python -i <<< "print \"test\""'
** String processing
get length
: ${#my_string}

- echo '$(echo "upg")' = > $(echo "upg")
- echo "$(echo "upg")" = > upg
  - The special parameters * and @ have special meaning when in double quotes in special cases
- a="as\nasd $BASH $(echo wtf)(new line)"
- a='as\nasd $BASH $(echo wtf)(new line)'
  - echo $a => as\nasd $BASH $(echo wtf)
  - echo "$a" => as\nasd $BASH $(echo wtf)(new line)
  - echo -e $a => as(new line)asd $BASH $(echo wtf)
  - echo -e "$a" => as(new line)asd $BASH $(echo wtf)(new line)
  - printf '%q\n' "$a" => $'as\\nasd $BASH $(echo wtf)\n'
general
- cat
- sed
- grep
- awk - excellent slicer and more
- perl/python

special
- sort
- head/tail
- cut
- xargs - convert several lines to one line
- uniq
- cmp/diff
- tr		replace characters
- nl		number lines of files
- paste	merge lines of files
- rev		reverse lines characterwise
- fold		wrap each input line to fit in specified width (-s break at spaces, -w 80)
- shuf		get random lines
- for item in list; do command $item done
- expand and unexpand: convert between tabs and spaces
- cut 		print part of each line of file separated by TAB or delimiter
- paste and join: read two files into one
- fmt, pr, fold, column, nl : text formatting
