shell.html

<div id="outline-container-org7d01593" class="outline-3">
<h3 id="org7d01593"><span class="section-number-3">2.5.</span> {} Brace Expansion</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>ls *{txt,log} list all files ending with txt or log in the current directory</li>
<li>cp ~/projects/adders/verilog/{half<sub>,full</sub>_}adder.v . copy half<sub>adder.v</sub> and full<sub>adder.v</sub> to current directory</li>
<li>mv story.txt{,.bkp} rename story.txt as story.txt.bkp</li>
<li>cp story.txt{,.bkp} to create bkp file as well retain original</li>
<li>mv story.txt{.bkp,} rename story.txt.bkp as story.txt</li>
<li>mv story{,<sub>old</sub>}.txt rename story.txt as story<sub>old.txt</sub></li>
<li>touch file{1..4}.txt same as touch file1.txt file2.txt file3.txt file4.txt</li>
<li>touch file<sub>x..z</sub>.txt same as touch file<sub>x.txt</sub> file<sub>y.txt</sub> file<sub>z.txt</sub></li>
<li>rm file{1..4}.txt same as rm file1.txt file2.txt file3.txt file4.txt</li>
<li>echo story.txt{,.bkp} displays the expanded version 'story.txt story.txt.bkp' , useful to dry run before executing actual command</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbd9cf9" class="outline-3">
<h3 id="orgdbd9cf9"><span class="section-number-3">2.6.</span> Extended globs</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>?(pattern-list) Matches zero or one occurrence of the given patterns</li>
<li>*(pattern-list) Matches zero or more occurrences of the given patterns</li>
<li>+(pattern-list) Matches one or more occurrences of the given patterns</li>
<li>@(pattern-list) Matches one of the given patterns</li>
<li>!(pattern-list) Matches anything except one of the given patterns</li>
</ul>

<p>
sheck if enabled:
</p>
<pre class="example">
$ shopt extglob
extglob            on
</pre>


<p>
ex.
</p>
<pre class="example">
$ ls !(*.txt)
main.c  math.h  power.log
</pre>
</div>
</div>

<div id="outline-container-org34d6bf0" class="outline-3">
<h3 id="org34d6bf0"><span class="section-number-3">2.7.</span> stdin(0), stdout(1), and stderr(2), pipes</h3>
<div class="outline-text-3" id="text-2-7">
<p>
standard streams == file descriptors
</p>

<p>
Commands has:
</p>
<ul class="org-ul">
<li>0 &lt;- terminal</li>
<li>1 -&gt; terminal</li>
<li>2 -&gt; terminal</li>
</ul>
</div>
<div id="outline-container-orgeba692f" class="outline-4">
<h4 id="orgeba692f"><span class="section-number-4">2.7.1.</span> pipeline</h4>
<div class="outline-text-4" id="text-2-7-1">
<ul class="org-ul">
<li>'|&amp;' equal to '2&gt;&amp;1 |' std out+err to std input</li>
<li>| - pipe stdout only</li>
<li>command &gt;(command1) &gt;(command2g) - pipe to two and more processes</li>
<li>command 2&gt; &gt;(command) &gt;c - pipe</li>
<li>(command1 ; command2 ; command3) | command4</li>
</ul>
</div>
</div>
<div id="outline-container-orgfd5b230" class="outline-4">
<h4 id="orgfd5b230"><span class="section-number-4">2.7.2.</span> redirection</h4>
<div class="outline-text-4" id="text-2-7-2">
<ul class="org-ul">
<li>redirect stdout to a file	ls &gt; a.txt</li>
<li>redirect stderr to a file	2&gt; a.txt</li>
<li>redirect stdout to a stderr	ls 1&gt;&amp;2 &gt;&amp;2</li>
<li>redirect stderr to a stdout	ls 2&gt;&amp;1</li>
<li>redirect stderr and stdout to a file	ls &amp;&gt; /dev/null</li>
<li>redirect stderr and stdout to stdout &amp;&gt;&amp;1</li>
<li>redirect stderr and stdout to stderr &amp;&gt;&amp;2</li>
</ul>

<p>
&gt;&amp;2 means copy file descriptor 2 to 1 both will refer to the 2
</p>

<p>
more:
</p>
<ul class="org-ul">
<li>command 3&gt; file # open new file descriptor</li>
<li>command &lt; file # standard input from file</li>

<li>tee a b c - redirection to multiple files (&gt;a &gt;b &gt;c - not working)</li>
</ul>
</div>
</div>
<div id="outline-container-org2632e7f" class="outline-4">
<h4 id="org2632e7f"><span class="section-number-4">2.7.3.</span> close file descriptors/streams</h4>
<div class="outline-text-4" id="text-2-7-3">
<ul class="org-ul">
<li>&gt;&amp;- 2&gt;&amp;- 3&gt;&amp;- # close 1,2,3</li>
<li>&lt;&amp;- # close 0</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2bb308" class="outline-4">
<h4 id="orgc2bb308"><span class="section-number-4">2.7.4.</span> "2&gt;&amp;1 &gt;file" vs "&gt; file 2&gt;&amp;1"</h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
2&gt;&amp; - do nothing becouse 0,1,2 -&gt; points to terminal
</p>

<p>
command &gt;file 2&gt;&amp;1 (or just &amp;&gt;)
</p>
<ul class="org-ul">
<li>stdout = file</li>
<li>stderr = file</li>
</ul>

<p>
command 2&gt;&amp;1 &gt;file   - redirects only stdout to file
</p>
<ul class="org-ul">
<li>stderr is redirected to stdout
<ul class="org-ul">
<li>stderr = stdout<sub>target</sub></li>
</ul></li>
<li>stdout = file</li>
</ul>
</div>
</div>
<div id="outline-container-org1e6174f" class="outline-4">
<h4 id="org1e6174f"><span class="section-number-4">2.7.5.</span> stderr to pipe</h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
command 2&gt;&amp;1 &gt;/dev/null | grep 'something'
</p>
<ol class="org-ol">
<li>First copy stderr to stdout - all stderr</li>
<li>redirect stdout to /dev/null</li>
<li>pipe stdout</li>
</ol>
</div>
</div>

<div id="outline-container-orge95c2b6" class="outline-4">
<h4 id="orge95c2b6"><span class="section-number-4">2.7.6.</span> redirect stdout to file and to stdout</h4>
<div class="outline-text-4" id="text-2-7-6">
<pre class="example">
command | tee &gt;(tee) &gt; file
</pre>
</div>
</div>
<div id="outline-container-org85309c4" class="outline-4">
<h4 id="org85309c4"><span class="section-number-4">2.7.7.</span> named pipe</h4>
<div class="outline-text-4" id="text-2-7-7">
<p>
the FIFO file must be opened on both ends
</p>
<ul class="org-ul">
<li>mkfifo pipe0 # create file</li>
<li>mkfifo -m 644 pipe0</li>
<li>echo "input message" &gt; pipe0</li>
<li>cat pipe0</li>
</ul>
</div>
</div>
<div id="outline-container-org9ef57d3" class="outline-4">
<h4 id="org9ef57d3"><span class="section-number-4">2.7.8.</span> not all output?</h4>
<div class="outline-text-4" id="text-2-7-8">
<p>
script -c 'python -i &lt;&lt;&lt; "print \"test\""'
</p>
</div>
</div>
</div>
<div id="outline-container-orge5a16ac" class="outline-3">
<h3 id="orge5a16ac"><span class="section-number-3">2.8.</span> String processing</h3>
<div class="outline-text-3" id="text-2-8">
<p>
get length
</p>
<pre class="example">
${#my_string}
</pre>


<ul class="org-ul">
<li>echo '$(echo "upg")' = &gt; $(echo "upg")</li>
<li>echo "$(echo "upg")" = &gt; upg
<ul class="org-ul">
<li>The special parameters * and @ have special meaning when in double quotes in special cases</li>
</ul></li>
<li>a="as\nasd $BASH $(echo wtf)(new line)"</li>
<li>a='as\nasd $BASH $(echo wtf)(new line)'
<ul class="org-ul">
<li>echo $a =&gt; as\nasd $BASH $(echo wtf)</li>
<li>echo "$a" =&gt; as\nasd $BASH $(echo wtf)(new line)</li>
<li>echo -e $a =&gt; as(new line)asd $BASH $(echo wtf)</li>
<li>echo -e "$a" =&gt; as(new line)asd $BASH $(echo wtf)(new line)</li>
<li>printf '%q\n' "$a" =&gt; $'as\\nasd $BASH $(echo wtf)\n'</li>
</ul></li>
</ul>
<p>
general
</p>
<ul class="org-ul">
<li>cat</li>
<li>sed</li>
<li>grep</li>
<li>awk - excellent slicer and more</li>
<li>perl/python</li>
</ul>

<p>
special
</p>
<ul class="org-ul">
<li>sort</li>
<li>head/tail</li>
<li>cut</li>
<li>xargs - convert several lines to one line</li>
<li>uniq</li>
<li>cmp/diff</li>
<li>tr		replace characters</li>
<li>nl		number lines of files</li>
<li>paste	merge lines of files</li>
<li>rev		reverse lines characterwise</li>
<li>fold		wrap each input line to fit in specified width (-s break at spaces, -w 80)</li>
<li>shuf		get random lines</li>
<li>for item in list; do command $item done</li>
<li>expand and unexpand: convert between tabs and spaces</li>
<li>cut 		print part of each line of file separated by TAB or delimiter</li>
<li>paste and join: read two files into one</li>
<li>fmt, pr, fold, column, nl : text formatting</li>
</ul>
</div>
