sources_org/shell.org
*** multiline string - HereDoc
short for "Here Document," is a type of redirection

: [n]<<[-]word
:        here-document
: delimiter

END, EOT, and EOF are common for world

If any part of word is quoted:
- the delimiter is the result of quote removal on word
- the lines in the here-document are not expanded, otherwise lines are subjected to parameter expansion,
 command substitution, and arithmetic expansion, the character sequence \newline is ignored, and ‘\’ must be
 used to quote the characters ‘\’, ‘$’, and ‘`’.

‘<<-’ - all leading tab characters are stripped from input lines and the line containing delimiter.

quoting:
#+begin_src shell :results output :exports both
cat << EOF
$(echo Hello)
EOF

cat << 'EOF'
$(echo Hello)
EOF

cat << "EOF"
$(echo Hello)
EOF

cat << \EOF
$(echo Hello)
EOF
#+end_src

#+RESULTS:
: Hello
: $(echo Hello)
: $(echo Hello)
: $(echo Hello)

declare variable:
#+begin_src shell :results output :exports both
a=$(cat <<EOF
s
s
EOF
)
echo -e "$a"
#+end_src

#+RESULTS:
: s
: s


as=$(echo -e "s\ns")

echo $a  # s s
echo "$a"  # s\ns

cat - внешняя программа которой нет в bash
#+name: good way to set variable with multiline text
#+begin_src sh
set +e
read -rd '' EMACS_EVAL <<EOF
(progn
 (org-babel-tangle-file "./index.org"))
EOF
set -e
#+end_src

piping:
#+begin_src bash :results output :exports both
cat << 'EOF' | base64 -d
SGVsbG8KV29ybGQK
EOF
#+end_src

#+RESULTS:
: Hello
: World

Write to a file. The way to create script at remote server.
#+begin_src sh
cat <<EOF > print.sh
#!/bin/bash
echo \$PWD
echo $PWD
EOF
#+end_src

function - stores the information provided by the HereDoc into variables.
#+begin_src bash :results output :exports both
readLines(){
        read greeting
        read name
}

readLines << EOF
Hello
$USER
EOF

echo $greeting
echo $name
#+end_src

#+RESULTS:
: Hello
: u

executing multiple commands on a remote machine:
#+begin_src sh
ssh username@host << EOF
echo hello! # this commands will be executed on remote machine
echo do your work!
EOF

sftp username@host << EOF
put test.sh # run multiple SFTP commands automatically
EOF
#+end_src

**** links
- https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Documents
- https://phoenixnap.com/kb/bash-heredoc
*** sort
sort by column:
: sort -t, -nk3 user.csv
- -t, - defines your delimiter as ,. (default delimeter - tab ? )
- -n - gives you numerical sort. Added since you added it in your attempt. If your user field is text only
  then you dont need it.
- -k3 - defines the field (key). user is the third field.

sort -k 2,2 -k 1,1 Hogwarts # sort by second and by first column
***** -s, --stable stabilize sort by disabling last-resort comparison
#+begin_src shell :results output :exports both
a=$(cat <<EOF
1   4
1   2
1   3
1   1
3   3
2   1
2   2
EOF
)
echo "$a" | sort -nk1 -s
echo
echo "$a" | sort -nk1
#+end_src

#+RESULTS:
#+begin_example
1   4
1   2
1   3
1   1
2   1
2   2
3   3

1   1
1   2
1   3
1   4
2   1
2   2
3   3
#+end_example
*** cut - get column
cut -d "delimiter" -f (field number) file.txt
- --complement
- --output-delimiter=”delimiter”

cut -c [(k)-(n)/(k),(n)/(n)] filename
- k denotes the starting position of the character
- n denotes the ending position of the character in each line
- if k and n are separated by “-” otherwise they are only the position of character in each line from the file
  taken as an input.

: ps -aux | tr -s ' ' | cut -d ' ' -f 2
*** sed
Default only change the first occurrence of the word on a line.

get line:
: echo -e "as\nasd" | sed -n '2p' => asd

split file by first occured character and number lines:
: sed -z -e 's/\//\\:\\:\n\//' -e 's/*/\\:\\:\n\*/' | sed -e '0,/^[^\/*]/ s/^[^\/*]/\\:\\:\n/' | nl
*** grep
- filter lines by pattern -
- case insensitive grep -i "FILe"

- -o only matching
- -v invert match or NOT
- -i case insensitive
- -A num Print num lines of trailing context after each match. See also the -B and -C options.
- -B num Print num lines of leading context before each match. See also the -A and -C options.
- -C[num] Print num lines of leading and trailing context surrounding each match. The default is 2 and is
 equivalent to -A 2 -B 2. Note: no whitespace may be given between the option and its argument.
- -m N - stop reading file after N matching lines

OR
- dmesg | grep -i -E 'xx:xx.x|wlan|iwl|80211'
- dmesg | grep -i -e 'xx:xx.x' -e wlan -e iwl -e 80211
- grep -Ev "(127|192)"

first match
- ip a | grep -o -m 1 wlan.

search in files:
- grep -Rin patern
  - n - line number, R - recursive

extract http links
- cat a.html | grep -o 'href=\"/.media[^\"]*/dl/[0-9]*[^\"]*' | grep -o "/.*" | sed 's#^#http://site.onion#' | xatrs torsocks wget --user-agent="Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1)"
*** python
split paragraphs:
- cat aa | python -c "import sys; print(sys.stdin.read().split('123'))"
  - ['asasd\n\n\n asdasd\n\n','asd\nas']
