shell.html
<div id="outline-container-org6328fff" class="outline-4">
<h4 id="org6328fff"><span class="section-number-4">2.8.1.</span> multiline string - HereDoc</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
short for "Here Document," is a type of redirection
</p>

<pre class="example">
[n]&lt;&lt;[-]word
       here-document
delimiter
</pre>


<p>
END, EOT, and EOF are common for world
</p>

<p>
If any part of word is quoted:
</p>
<ul class="org-ul">
<li>the delimiter is the result of quote removal on word</li>
<li>the lines in the here-document are not expanded, otherwise lines are subjected to parameter expansion,
command substitution, and arithmetic expansion, the character sequence \newline is ignored, and ‘\’ must be
used to quote the characters ‘\’, ‘$’, and ‘`’.</li>
</ul>

<p>
‘&lt;&lt;-’ - all leading tab characters are stripped from input lines and the line containing delimiter.
</p>

<p>
quoting:
</p>
<div class="org-src-container">
<pre class="src src-shell">cat &lt;&lt; EOF
<span style="color: #ffff00; font-weight: bold;">$(</span><span style="color: #fa8072;">echo Hello</span><span style="color: #ffff00; font-weight: bold;">)</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>

cat &lt;&lt; <span style="color: #95e454;">'EOF'</span>
<span style="color: #ffff00; font-weight: bold;">$(</span><span style="color: #fa8072;">echo Hello</span><span style="color: #ffff00; font-weight: bold;">)</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>

cat &lt;&lt; <span style="color: #95e454;">"EOF"</span>
<span style="color: #ffff00; font-weight: bold;">$(</span><span style="color: #fa8072;">echo Hello</span><span style="color: #ffff00; font-weight: bold;">)</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>

cat &lt;&lt; \EOF
<span style="color: #ffff00; font-weight: bold;">$(</span><span style="color: #fa8072;">echo Hello</span><span style="color: #ffff00; font-weight: bold;">)</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
</pre>
</div>

<pre class="example">
Hello
$(echo Hello)
$(echo Hello)
$(echo Hello)
</pre>


<p>
declare variable:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #cae682;">a</span>=$(<span style="color: #fa8072;">cat &lt;&lt;EOF</span>
<span style="color: #ffff00; font-weight: bold;">s</span>
<span style="color: #ffff00; font-weight: bold;">s</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
)
<span style="color: #e5786d;">echo</span> -e <span style="color: #95e454;">"$a"</span>
</pre>
</div>

<pre class="example">
s
s
</pre>



<p>
as=$(echo -e "s\ns")
</p>

<p>
echo $a  # s s
echo "$a"  # s\ns
</p>

<p>
cat - внешняя программа которой нет в bash
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org79e291f"><span style="color: #e5786d;">set</span> +e
<span style="color: #e5786d;">read</span> -rd <span style="color: #95e454;">''</span> EMACS_EVAL &lt;&lt;EOF
<span style="color: #ffff00; font-weight: bold;">(progn</span>
<span style="color: #ffff00; font-weight: bold;"> (org-babel-tangle-file "./index.org"))</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
<span style="color: #e5786d;">set</span> -e
</pre>
</div>

<p>
piping:
</p>
<div class="org-src-container">
<pre class="src src-bash">cat &lt;&lt; <span style="color: #95e454;">'EOF'</span> | base64 -d
<span style="color: #ffff00; font-weight: bold;">SGVsbG8KV29ybGQK</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
</pre>
</div>

<pre class="example">
Hello
World
</pre>


<p>
Write to a file. The way to create script at remote server.
</p>
<div class="org-src-container">
<pre class="src src-sh">cat &lt;&lt;EOF &gt; print.sh
<span style="color: #ffff00; font-weight: bold;">#!/bin/bash</span>
<span style="color: #ffff00; font-weight: bold;">echo \$PWD</span>
<span style="color: #ffff00; font-weight: bold;">echo $PWD</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
</pre>
</div>

<p>
function - stores the information provided by the HereDoc into variables.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682; font-weight: bold;">readLines</span>(){
        <span style="color: #e5786d;">read</span> greeting
        <span style="color: #e5786d;">read</span> name
}

readLines &lt;&lt; EOF
<span style="color: #ffff00; font-weight: bold;">Hello</span>
<span style="color: #ffff00; font-weight: bold;">$USER</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>

<span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">greeting</span>
<span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">name</span>
</pre>
</div>

<pre class="example">
Hello
u
</pre>


<p>
executing multiple commands on a remote machine:
</p>
<div class="org-src-container">
<pre class="src src-sh">ssh username@host &lt;&lt; EOF
<span style="color: #ffff00; font-weight: bold;">echo hello! # this commands will be executed on remote machine</span>
<span style="color: #ffff00; font-weight: bold;">echo do your work!</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>

sftp username@host &lt;&lt; EOF
<span style="color: #ffff00; font-weight: bold;">put test.sh # run multiple SFTP commands automatically</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org4cdb26e"></a>links<br />
<div class="outline-text-5" id="text-2-8-1-1">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Documents">https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Documents</a></li>
<li><a href="https://phoenixnap.com/kb/bash-heredoc">https://phoenixnap.com/kb/bash-heredoc</a></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org3da81fe" class="outline-4">
<h4 id="org3da81fe"><span class="section-number-4">2.8.2.</span> sort</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
sort by column:
</p>
<pre class="example">
sort -t, -nk3 user.csv
</pre>

<ul class="org-ul">
<li>-t, - defines your delimiter as ,. (default delimeter - tab ? )</li>
<li>-n - gives you numerical sort. Added since you added it in your attempt. If your user field is text only
then you dont need it.</li>
<li>-k3 - defines the field (key). user is the third field.</li>
</ul>

<p>
sort -k 2,2 -k 1,1 Hogwarts # sort by second and by first column
</p>
</div>
<ol class="org-ol">
<li><a id="org8ec41e6"></a>-s, &#x2013;stable stabilize sort by disabling last-resort comparison<br />
<div class="outline-text-6" id="text-2-8-2-0-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #cae682;">a</span>=$(<span style="color: #fa8072;">cat &lt;&lt;EOF</span>
<span style="color: #ffff00; font-weight: bold;">1   4</span>
<span style="color: #ffff00; font-weight: bold;">1   2</span>
<span style="color: #ffff00; font-weight: bold;">1   3</span>
<span style="color: #ffff00; font-weight: bold;">1   1</span>
<span style="color: #ffff00; font-weight: bold;">3   3</span>
<span style="color: #ffff00; font-weight: bold;">2   1</span>
<span style="color: #ffff00; font-weight: bold;">2   2</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
)
<span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$a"</span> | sort -nk1 -s
<span style="color: #e5786d;">echo</span>
<span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$a"</span> | sort -nk1
</pre>
</div>

<pre class="example" id="orga5366af">
1   4
1   2
1   3
1   1
2   1
2   2
3   3

1   1
1   2
1   3
1   4
2   1
2   2
3   3
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-org79c9a92" class="outline-4">
<h4 id="org79c9a92"><span class="section-number-4">2.8.3.</span> cut - get column</h4>
<div class="outline-text-4" id="text-2-8-3">
<p>
cut -d "delimiter" -f (field number) file.txt
</p>
<ul class="org-ul">
<li>&#x2013;complement</li>
<li>&#x2013;output-delimiter=”delimiter”</li>
</ul>

<p>
cut -c [(k)-(n)/(k),(n)/(n)] filename
</p>
<ul class="org-ul">
<li>k denotes the starting position of the character</li>
<li>n denotes the ending position of the character in each line</li>
<li>if k and n are separated by “-” otherwise they are only the position of character in each line from the file
taken as an input.</li>
</ul>

<pre class="example">
ps -aux | tr -s ' ' | cut -d ' ' -f 2
</pre>
</div>
</div>
<div id="outline-container-orgd05a1e4" class="outline-4">
<h4 id="orgd05a1e4"><span class="section-number-4">2.8.4.</span> sed</h4>
<div class="outline-text-4" id="text-2-8-4">
<p>
Default only change the first occurrence of the word on a line.
</p>

<p>
get line:
</p>
<pre class="example">
echo -e "as\nasd" | sed -n '2p' =&gt; asd
</pre>


<p>
split file by first occured character and number lines:
</p>
<pre class="example">
sed -z -e 's/\//\\:\\:\n\//' -e 's/*/\\:\\:\n\*/' | sed -e '0,/^[^\/*]/ s/^[^\/*]/\\:\\:\n/' | nl
</pre>
</div>
</div>
<div id="outline-container-orga704e08" class="outline-4">
<h4 id="orga704e08"><span class="section-number-4">2.8.5.</span> grep</h4>
<div class="outline-text-4" id="text-2-8-5">
<ul class="org-ul">
<li>filter lines by pattern -</li>
<li>case insensitive grep -i "FILe"</li>

<li>-o only matching</li>
<li>-v invert match or NOT</li>
<li>-i case insensitive</li>
<li>-A num Print num lines of trailing context after each match. See also the -B and -C options.</li>
<li>-B num Print num lines of leading context before each match. See also the -A and -C options.</li>
<li>-C[num] Print num lines of leading and trailing context surrounding each match. The default is 2 and is
equivalent to -A 2 -B 2. Note: no whitespace may be given between the option and its argument.</li>
<li>-m N - stop reading file after N matching lines</li>
</ul>

<p>
OR
</p>
<ul class="org-ul">
<li>dmesg | grep -i -E 'xx:xx.x|wlan|iwl|80211'</li>
<li>dmesg | grep -i -e 'xx:xx.x' -e wlan -e iwl -e 80211</li>
<li>grep -Ev "(127|192)"</li>
</ul>

<p>
first match
</p>
<ul class="org-ul">
<li>ip a | grep -o -m 1 wlan.</li>
</ul>

<p>
search in files:
</p>
<ul class="org-ul">
<li>grep -Rin patern
<ul class="org-ul">
<li>n - line number, R - recursive</li>
</ul></li>
</ul>

<p>
extract http links
</p>
<ul class="org-ul">
<li>cat a.html | grep -o 'href=\"<i>.media[^\"]*/dl</i>[0-9]*[^\"]*' | grep -o "/.*" | sed 's#^#<a href="http://site.onion">http://site.onion</a>#' | xatrs torsocks wget &#x2013;user-agent="Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1)"</li>
</ul>
</div>
</div>
<div id="outline-container-orgf160d7f" class="outline-4">
<h4 id="orgf160d7f"><span class="section-number-4">2.8.6.</span> python</h4>
<div class="outline-text-4" id="text-2-8-6">
<p>
split paragraphs:
</p>
<ul class="org-ul">
<li>cat aa | python -c "import sys; print(sys.stdin.read().split('123'))"
<ul class="org-ul">
<li>['asasd\n\n\n asdasd\n\n','asd\nas']</li>
</ul></li>
</ul>
</div>
</div>
