sources_org/shell.org
*** perl
split paragraphs:
-
bad try:
- echo "aavbb" | perl -e '@a=<>; print( (split(/v/, join "", @a))[0] )' => "aa"
*** awk
- echo -e "a\navbb" | awk -v RS='v' 'NR==1' - get a\na
- ps ux | awk '{if($8=="Z") print}' - get column 8 if == "Z"
- ps | awk '{print $2}' - get column 2
*** uniq
MUST BE USED AFTER *sort*
- -s n - skip n first characters
- -w n - sort by n first characters
- --group - separate duplicates
- -c - count unique
*** strip remove leading and trailing white spaces
: vv="  asd  "
: v=$(echo $vv)
: echo $v
*** tail
skip first line of output:
: route -n | tail -n +2

search sentence or word in files with extension:
: grep -r -i --include=\*.txt 'searchterm' ./
 - -r: recursively
 - -i: ignore-case
 - --include: all *.txt: text files (escape with \ just in case you have a directory with asterisks in the filenames)
 - 'searchterm': What to search
 - ./: Start at current directory.


add prefix to every string
#+begin_src sh
echo -e "a23d\nasdasd" | sed 's/^/worker: /'
#+end_src

#+RESULTS:
| worker: | a23d   |
| worker: | asdasd |

** Process Control
- top [[top]]
- ps [[ps]]
- kill/killall/pkill
- free
- pgrep
- fg - background child processes
- jobs
  - -l list
  - -p process numbers

background
- nohup command & - even after exiting the shell - ignore HUP (hangup) signal and therefore does not stop when the user logs out.
- timeout 15 command &
- ( sleep 1000 & ) - deattached from bash

Which process block file/folder?
- ls -l /proc/*/fd/* | grep ~/Downloads
- lsof/lsfd -l ~/Downloads
-
- fuser Downloads


$! - get pid of last started background child proces

run two processes in parallel in background :
: (python3 lsp-bridge/lsp_bridge.py & ) ; nohup python3 .local/bin/pylsp -v --tcp &

** Programming
*** shebang
: #!/usr/bin/env bash
: #!/usr/bin/env sh
On most but not all systems, I recommend using:
: #!/bin/bash
: #!/bin/sh
*** pros and cons
pros:
- Simple, easily understood
- Quick to write
- Doesn't take up much disk space
- Reasonable chance of working on multiple operating systems without modification, if you know what you're doing

cons:
- Slow execution (typically)
- No sane or robust access to floating point math, complex data structures, database query results, etc. (depending on language)
- Shebang line must be edited for each target system

*** Hello World.sh, scriptinga
#+begin_src sh
#!/bin/sh
#or
#!/usr/bin/env bash
set -u # Report Non-Existent Variables
set -e # It terminates the execution when the error occurs. (does not work with piped commands. use Set -eo pipefail)
set -o pipefail # exit execution if one of the commands in the pipe fails.
# set -x # write to standard error a trace for each  command
# set -n # do not execute only check syntax

declare -r -i PORT_NUMBER=8080 # integer, read only
declare -a my_array=( apple orange ) # indexed array

# Processes a file.
# $1 - the name of the input file
# $2 - the name of the output file
main(){
    local -r input_file="$1";  shift
    local -r output_file="$1"; shift
}

main "${@}"
#+end_src
*** arguments
- $@ - all
- $0 - script name
- $1-...  - argumensts

easy to swap in future:
#+begin_src sh
main(){
    local -r input_file="$1";  shift
    local -r output_file="$1"; shift
}
#+end_src
**** check if executes with source or with exec
#+begin_src sh
if [ -n "$(echo $0 | grep a.sh)" ] ; then
    echo exec
else
    echo source
fi
#+end_src
*** array
- array=(item1 item2 item3)
- echo ${array[*]} # echo item1 item2 item3
- set -- item1 item2 item3
- echo "$3" # Arrays indices start from 1
- set -- "$@" 4 # add item
- shift 2 # Remove first 2 items
- for item in "$@"; do echo "$item"; done # loop
- “${99}” - “$98” is not working

Associative Arrays / Hash Maps
- hm="$(hm_create)"
- hm_put "$hm" mykey myvalue
- hm_get "$hm" mykey
-

length:
- echo ${#array[@]}

Splice an Array:
- ${arrayname[@]:start:end}


from start point to end:
- v=${#a[@]}
- echo ${a[@]:1:$v}
