shell.html
<div id="outline-container-org95cf77c" class="outline-4">
<h4 id="org95cf77c"><span class="section-number-4">2.8.7.</span> perl</h4>
<div class="outline-text-4" id="text-2-8-7">
<p>
split paragraphs:
</p>
<ul class="org-ul">
<li></li>
</ul>
<p>
bad try:
</p>
<ul class="org-ul">
<li>echo "aavbb" | perl -e '@a=&lt;&gt;; print( (split(<i>v</i>, join "", @a))[0] )' =&gt; "aa"</li>
</ul>
</div>
</div>
<div id="outline-container-org3962a66" class="outline-4">
<h4 id="org3962a66"><span class="section-number-4">2.8.8.</span> awk</h4>
<div class="outline-text-4" id="text-2-8-8">
<ul class="org-ul">
<li>echo -e "a\navbb" | awk -v RS='v' 'NR==1' - get a\na</li>
<li>ps ux | awk '{if($8=="Z") print}' - get column 8 if == "Z"</li>
<li>ps | awk '{print $2}' - get column 2</li>
</ul>
</div>
</div>
<div id="outline-container-orge0b9052" class="outline-4">
<h4 id="orge0b9052"><span class="section-number-4">2.8.9.</span> uniq</h4>
<div class="outline-text-4" id="text-2-8-9">
<p>
MUST BE USED AFTER <b>sort</b>
</p>
<ul class="org-ul">
<li>-s n - skip n first characters</li>
<li>-w n - sort by n first characters</li>
<li>&#x2013;group - separate duplicates</li>
<li>-c - count unique</li>
</ul>
</div>
</div>
<div id="outline-container-org4b01b7d" class="outline-4">
<h4 id="org4b01b7d"><span class="section-number-4">2.8.10.</span> strip remove leading and trailing white spaces</h4>
<div class="outline-text-4" id="text-2-8-10">
<pre class="example">
vv="  asd  "
v=$(echo $vv)
echo $v
</pre>
</div>
</div>
<div id="outline-container-org16fc79a" class="outline-4">
<h4 id="org16fc79a"><span class="section-number-4">2.8.11.</span> tail</h4>
<div class="outline-text-4" id="text-2-8-11">
<p>
skip first line of output:
</p>
<pre class="example">
route -n | tail -n +2
</pre>


<p>
search sentence or word in files with extension:
</p>
<pre class="example">
grep -r -i --include=\*.txt 'searchterm' ./
</pre>

<ul class="org-ul">
<li>-r: recursively</li>
<li>-i: ignore-case</li>
<li>&#x2013;include: all *.txt: text files (escape with \ just in case you have a directory with asterisks in the filenames)</li>
<li>'searchterm': What to search</li>
<li>./: Start at current directory.</li>
</ul>


<p>
add prefix to every string
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #e5786d;">echo</span> -e <span style="color: #95e454;">"a23d\nasdasd"</span> | sed <span style="color: #95e454;">'s/^/worker: /'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org31f8664" class="outline-3">
<h3 id="org31f8664"><span class="section-number-3">2.9.</span> Process Control</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>top <a href="#orgddc6097">2.24</a></li>
<li>ps <a href="#org35a0895">2.23</a></li>
<li>kill/killall/pkill</li>
<li>free</li>
<li>pgrep</li>
<li>fg - background child processes</li>
<li>jobs
<ul class="org-ul">
<li>-l list</li>
<li>-p process numbers</li>
</ul></li>
</ul>

<p>
background
</p>
<ul class="org-ul">
<li>nohup command &amp; - even after exiting the shell - ignore HUP (hangup) signal and therefore does not stop when the user logs out.</li>
<li>timeout 15 command &amp;</li>
<li>( sleep 1000 &amp; ) - deattached from bash</li>
</ul>

<p>
Which process block file/folder?
</p>
<ul class="org-ul">
<li>ls -l /proc/*/fd/* | grep ~/Downloads</li>
<li>lsof/lsfd -l ~/Downloads</li>
<li></li>

<li>fuser Downloads</li>
</ul>


<p>
$! - get pid of last started background child proces
</p>

<p>
run two processes in parallel in background :
</p>
<pre class="example">
(python3 lsp-bridge/lsp_bridge.py &amp; ) ; nohup python3 .local/bin/pylsp -v --tcp &amp;
</pre>
</div>
</div>

<div id="outline-container-orge81fc41" class="outline-3">
<h3 id="orge81fc41"><span class="section-number-3">2.10.</span> Programming</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-org0674648" class="outline-4">
<h4 id="org0674648"><span class="section-number-4">2.10.1.</span> shebang</h4>
<div class="outline-text-4" id="text-2-10-1">
<pre class="example">
#!/usr/bin/env bash
#!/usr/bin/env sh
</pre>

<p>
On most but not all systems, I recommend using:
</p>
<pre class="example">
#!/bin/bash
#!/bin/sh
</pre>
</div>
</div>
<div id="outline-container-org074db0d" class="outline-4">
<h4 id="org074db0d"><span class="section-number-4">2.10.2.</span> pros and cons</h4>
<div class="outline-text-4" id="text-2-10-2">
<p>
pros:
</p>
<ul class="org-ul">
<li>Simple, easily understood</li>
<li>Quick to write</li>
<li>Doesn't take up much disk space</li>
<li>Reasonable chance of working on multiple operating systems without modification, if you know what you're doing</li>
</ul>

<p>
cons:
</p>
<ul class="org-ul">
<li>Slow execution (typically)</li>
<li>No sane or robust access to floating point math, complex data structures, database query results, etc. (depending on language)</li>
<li>Shebang line must be edited for each target system</li>
</ul>
</div>
</div>

<div id="outline-container-org5a635dd" class="outline-4">
<h4 id="org5a635dd"><span class="section-number-4">2.10.3.</span> Hello World.sh, scriptinga</h4>
<div class="outline-text-4" id="text-2-10-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #fa8072;">#</span><span style="color: #99968b; font-style: italic;">!/bin/</span><span style="color: #8ac6f2; font-weight: bold;">sh</span>
<span style="color: #fa8072;">#</span><span style="color: #99968b; font-style: italic;">or</span>
<span style="color: #fa8072;">#</span><span style="color: #99968b; font-style: italic;">!/usr/bin/env bash</span>
<span style="color: #e5786d;">set</span> -u <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Report Non-Existent Variables</span>
<span style="color: #e5786d;">set</span> -e <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">It terminates the execution when the error occurs. (does not work with piped commands. use Set -eo pipefail)</span>
<span style="color: #e5786d;">set</span> -o pipefail <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">exit execution if one of the commands in the pipe fails.</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">set -x # write to standard error a trace for each  command</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">set -n # do not execute only check syntax</span>

<span style="color: #e5786d;">declare</span> -r -i <span style="color: #cae682;">PORT_NUMBER</span>=8080 <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">integer, read only</span>
<span style="color: #e5786d;">declare</span> -a <span style="color: #cae682;">my_array</span>=( apple orange ) <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">indexed array</span>

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Processes a file.</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">$1 - the name of the input file</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">$2 - the name of the output file</span>
<span style="color: #cae682; font-weight: bold;">main</span>(){
    <span style="color: #e5786d;">local</span> -r <span style="color: #cae682;">input_file</span>=<span style="color: #95e454;">"$1"</span>;  <span style="color: #e5786d;">shift</span>
    <span style="color: #e5786d;">local</span> -r <span style="color: #cae682;">output_file</span>=<span style="color: #95e454;">"$1"</span>; <span style="color: #e5786d;">shift</span>
}

main <span style="color: #95e454;">"${@}"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org614bcb5" class="outline-4">
<h4 id="org614bcb5"><span class="section-number-4">2.10.4.</span> arguments</h4>
<div class="outline-text-4" id="text-2-10-4">
<ul class="org-ul">
<li>$@ - all</li>
<li>$0 - script name</li>
<li>$1-&#x2026;  - argumensts</li>
</ul>

<p>
easy to swap in future:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682; font-weight: bold;">main</span>(){
    <span style="color: #e5786d;">local</span> -r <span style="color: #cae682;">input_file</span>=<span style="color: #95e454;">"$1"</span>;  <span style="color: #e5786d;">shift</span>
    <span style="color: #e5786d;">local</span> -r <span style="color: #cae682;">output_file</span>=<span style="color: #95e454;">"$1"</span>; <span style="color: #e5786d;">shift</span>
}
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org737691b"></a>check if executes with source or with exec<br />
<div class="outline-text-5" id="text-2-10-4-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8ac6f2; font-weight: bold;">if</span> [ -n <span style="color: #95e454;">"$(</span><span style="color: #fa8072;">echo $0 | grep a.sh</span><span style="color: #95e454;">)"</span> ] ; <span style="color: #8ac6f2; font-weight: bold;">then</span>
    <span style="color: #e5786d;">echo</span> exec
<span style="color: #8ac6f2; font-weight: bold;">else</span>
    <span style="color: #e5786d;">echo</span> source
<span style="color: #8ac6f2; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0b793ad" class="outline-4">
<h4 id="org0b793ad"><span class="section-number-4">2.10.5.</span> array</h4>
<div class="outline-text-4" id="text-2-10-5">
<ul class="org-ul">
<li>array=(item1 item2 item3)</li>
<li>echo ${array[*]} # echo item1 item2 item3</li>
<li>set &#x2013; item1 item2 item3</li>
<li>echo "$3" # Arrays indices start from 1</li>
<li>set &#x2013; "$@" 4 # add item</li>
<li>shift 2 # Remove first 2 items</li>
<li>for item in "$@"; do echo "$item"; done # loop</li>
<li>“${99}” - “$98” is not working</li>
</ul>

<p>
Associative Arrays / Hash Maps
</p>
<ul class="org-ul">
<li>hm="$(hm<sub>create</sub>)"</li>
<li>hm<sub>put</sub> "$hm" mykey myvalue</li>
<li>hm<sub>get</sub> "$hm" mykey</li>
<li></li>
</ul>

<p>
length:
</p>
<ul class="org-ul">
<li>echo ${#array[@]}</li>
</ul>

<p>
Splice an Array:
</p>
<ul class="org-ul">
<li>${arrayname[@]:start:end}</li>
</ul>


<p>
from start point to end:
</p>
<ul class="org-ul">
<li>v=${#a[@]}</li>
<li>echo ${a[@]:1:$v}</li>
</ul>
</div>
</div>
