sources_org/shell.org
*** comparision Posix
1) ! EXPRESSION 	The EXPRESSION is false.
2) -n STRING	 	The length of STRING is greater than zero.
3) -z STRING 		The lengh of STRING is zero (ie it is empty).
4) STRING1 = STRING2 	STRING1 is equal to STRING2
5) STRING1 != STRING2 	STRING1 is not equal to STRING2
6) INTEGER1 -eq INTEGER2 	INTEGER1 is numerically equal to INTEGER2
7) INTEGER1 -gt INTEGER2 	INTEGER1 is numerically greater than INTEGER2
8) INTEGER1 -lt INTEGER2 	INTEGER1 is numerically less than INTEGER2
9) -d FILE 		FILE exists and is a directory.
10) -e FILE 		FILE exists.
11) -r FILE 		FILE exists and the read permission is granted.
12) -s FILE 		FILE exists and it's size is greater than zero (ie. it is not empty).
13) -w FILE 		FILE exists and the write permission is granted.
14) -x FILE 		FILE exists and the execute permission is granted.

Boolean Operations
- && - is and
- || - is or

-a means AND and -o means OR
*** numbers comparision
must be checked agains tested not empty values
- = and != is safe for empty values
 "$n" = 1 - must be in ""

- num1 -eq num2                  check if 1st  number is equal to 2nd number
- num1 -ge num2                  checks if 1st  number  is greater than or equal to 2nd number
- num1 -gt num2                  checks if 1st  number is greater than 2nd number
- num1 -le num2                   checks if 1st number is less than or equal to 2nd number
- num1 -lt num2                   checks if 1st  number  is less than 2nd number
- num1 -ne num2                  checks if 1st  number  is not equal to 2nd number
*** strings comparision
variables must be in ""
- var1 = var2     checks if var1 is the same as string var2
- var1 != var2    checks if var1 is not the same as var2
- var1 < var2     checks if var1 is less than var2
- var1 > var2     checks if var1 is greater than var2
- -n var1             checks if var1 has a length greater than zero
- -z var1             checks if var1 has a length of zero

Substring:
#+begin_src bash :eval no :exports code :results none
if [[ $full_string =~ "$substring" ]]; then
    echo "Found '$substr' in $full_string"
else
    echo "'$substr' not found in $full_string"
fi

if echo "$full_string" | grep -q "$substring"; then
  echo "Found '$substring' in $full_string"
else
  echo "'$substring' not found in $full_string"
fi
#+end_src

*** if
- [] is just a reference to the command *test*
- (( )) - ariphmetic

statements:
- *if* [ $c == 5 ]
- *then* echo ok
- *elif* [ <some test> ]
- *then* something
- *else* something
- *fi*

: if [ "5" == 6 ] ;then echo ok;else echo bad;fi

: test $c = 5;echo $?

: ERROR: if[ or [$c or 5] or 5 ];
**** double square brackets
- Single [] are posix shell compliant condition tests. Portable.
- Double [[]] are an extension to the standard [] and are supported by bash and other shells (e.g. zsh, ksh)
  For example: || instead of -o and regex matching with =~
- [ is POSIX
- [[ is a Bash extension inspired from Korn shell

Use [] whenever you want your script to be portable across shells. Use [[]] if you want conditional
expressions not supported by [] and don't need to be portable.
