shell.html
<div id="outline-container-org6e99b52" class="outline-4">
<h4 id="org6e99b52"><span class="section-number-4">2.10.6.</span> comparision Posix</h4>
<div class="outline-text-4" id="text-2-10-6">
<ol class="org-ol">
<li>! EXPRESSION 	The EXPRESSION is false.</li>
<li>-n STRING	 	The length of STRING is greater than zero.</li>
<li>-z STRING 		The lengh of STRING is zero (ie it is empty).</li>
<li>STRING1 = STRING2 	STRING1 is equal to STRING2</li>
<li>STRING1 != STRING2 	STRING1 is not equal to STRING2</li>
<li>INTEGER1 -eq INTEGER2 	INTEGER1 is numerically equal to INTEGER2</li>
<li>INTEGER1 -gt INTEGER2 	INTEGER1 is numerically greater than INTEGER2</li>
<li>INTEGER1 -lt INTEGER2 	INTEGER1 is numerically less than INTEGER2</li>
<li>-d FILE 		FILE exists and is a directory.</li>
<li>-e FILE 		FILE exists.</li>
<li>-r FILE 		FILE exists and the read permission is granted.</li>
<li>-s FILE 		FILE exists and it's size is greater than zero (ie. it is not empty).</li>
<li>-w FILE 		FILE exists and the write permission is granted.</li>
<li>-x FILE 		FILE exists and the execute permission is granted.</li>
</ol>

<p>
Boolean Operations
</p>
<ul class="org-ul">
<li>&amp;&amp; - is and</li>
<li>|| - is or</li>
</ul>

<p>
-a means AND and -o means OR
</p>
</div>
</div>
<div id="outline-container-orgdb29a13" class="outline-4">
<h4 id="orgdb29a13"><span class="section-number-4">2.10.7.</span> numbers comparision</h4>
<div class="outline-text-4" id="text-2-10-7">
<p>
must be checked agains tested not empty values
</p>
<ul class="org-ul">
<li>= and != is safe for empty values
"$n" = 1 - must be in ""</li>

<li>num1 -eq num2                  check if 1st  number is equal to 2nd number</li>
<li>num1 -ge num2                  checks if 1st  number  is greater than or equal to 2nd number</li>
<li>num1 -gt num2                  checks if 1st  number is greater than 2nd number</li>
<li>num1 -le num2                   checks if 1st number is less than or equal to 2nd number</li>
<li>num1 -lt num2                   checks if 1st  number  is less than 2nd number</li>
<li>num1 -ne num2                  checks if 1st  number  is not equal to 2nd number</li>
</ul>
</div>
</div>
<div id="outline-container-org05e3829" class="outline-4">
<h4 id="org05e3829"><span class="section-number-4">2.10.8.</span> strings comparision</h4>
<div class="outline-text-4" id="text-2-10-8">
<p>
variables must be in ""
</p>
<ul class="org-ul">
<li>var1 = var2     checks if var1 is the same as string var2</li>
<li>var1 != var2    checks if var1 is not the same as var2</li>
<li>var1 &lt; var2     checks if var1 is less than var2</li>
<li>var1 &gt; var2     checks if var1 is greater than var2</li>
<li>-n var1             checks if var1 has a length greater than zero</li>
<li>-z var1             checks if var1 has a length of zero</li>
</ul>

<p>
Substring:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8ac6f2; font-weight: bold;">if</span> [[ $<span style="color: #cae682;">full_string</span> =~ <span style="color: #95e454;">"$substring"</span> ]]; <span style="color: #8ac6f2; font-weight: bold;">then</span>
    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"Found '$substr' in $full_string"</span>
<span style="color: #8ac6f2; font-weight: bold;">else</span>
    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"'$substr' not found in $full_string"</span>
<span style="color: #8ac6f2; font-weight: bold;">fi</span>

<span style="color: #8ac6f2; font-weight: bold;">if </span><span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$full_string"</span> | grep -q <span style="color: #95e454;">"$substring"</span>; <span style="color: #8ac6f2; font-weight: bold;">then</span>
  <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"Found '$substring' in $full_string"</span>
<span style="color: #8ac6f2; font-weight: bold;">else</span>
  <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"'$substring' not found in $full_string"</span>
<span style="color: #8ac6f2; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org374d016" class="outline-4">
<h4 id="org374d016"><span class="section-number-4">2.10.9.</span> if</h4>
<div class="outline-text-4" id="text-2-10-9">
<ul class="org-ul">
<li>[] is just a reference to the command <b>test</b></li>
<li>(( )) - ariphmetic</li>
</ul>

<p>
statements:
</p>
<ul class="org-ul">
<li><b>if</b> [ $c == 5 ]</li>
<li><b>then</b> echo ok</li>
<li><b>elif</b> [ &lt;some test&gt; ]</li>
<li><b>then</b> something</li>
<li><b>else</b> something</li>
<li><b>fi</b></li>
</ul>

<pre class="example">
if [ "5" == 6 ] ;then echo ok;else echo bad;fi
</pre>


<pre class="example">
test $c = 5;echo $?
</pre>


<pre class="example">
ERROR: if[ or [$c or 5] or 5 ];
</pre>
</div>
<ol class="org-ol">
<li><a id="org8618901"></a>double square brackets<br />
<div class="outline-text-5" id="text-2-10-9-1">
<ul class="org-ul">
<li>Single [] are posix shell compliant condition tests. Portable.</li>
<li>Double [[]] are an extension to the standard [] and are supported by bash and other shells (e.g. zsh, ksh)
For example: || instead of -o and regex matching with =~</li>
<li>[ is POSIX</li>
<li>[[ is a Bash extension inspired from Korn shell</li>
</ul>

<p>
Use [] whenever you want your script to be portable across shells. Use [[]] if you want conditional
expressions not supported by [] and don't need to be portable.
</p>
</div>
</li>
</ol>
</div>
