sources_org/shell.org
*** loop
- while - while COMMAND; do done
- until - same as while and inverse
- for - for v in VARIABLE; do ? done ; if no "in VARIABLE" - in "$@" is assumed
- select word in words - same as echo words | while IFS=" " read word; do

#+begin_src sh
while IFS= read -r line
do
    echo "$line"
done <<< "$the_list"

while IFS=, read -r name familyname address; do
    printf 'Got "%s", "%s", and "%s"\n' "$name" "$familyname" "$address"
done <file.csv

while read line ; do
    echo $line
done < <( ... code ... )

your_code | while read line;
do
    echo $line
done

# while read line;
# do
#     echo $line
# done < $lines

echo -e "$a" | while IFS=":" read f v; do
    echo "$f _ $v" # f - first column v - all others
done

set -- "123 3456"
for v in "$@"; do
    $v
done

for j in `seq 0 24`; do # safest
    ...
done

for j in `seq 0 24`; do echo we ; done

select DRINK in tea cofee water juice appe all none
do
   case $DRINK in
      tea|cofee|water|all)
         echo "Go to canteen"
         ;;
      juice|appe)
         echo "Available at home"
      ;;
      none)
         break
      ;;
      ,*) echo "ERROR: Invalid selection"
      ;;
   esac
done

# loop files in current directory
for filename in *; do echo "put ${filename}"; done

# command for every line of file - can not use variables
xargs -rd'\n' -I@ -a p2.txt echo @

#+end_src

#+begin_src bash :results output
for myvar in "the first" "the second" "and the third" ; do
	echo "This is ${myvar}"
done
#+end_src

#+RESULTS:
: This is the first
: This is the second
: This is and the third

#+begin_src bash :results output
for (( i = 1 ; i <= 3 ; i++ )) ; do
	echo "i is ${i}"
done
#+end_src

#+RESULTS:
: i is 1
: i is 2
: i is 3

*** file comparision
- -d file                        checks if the file exists and is it’s a directory
- -e file                        checks if the file exists on system
- -w file                       checks if the file exists on system and if it is writable
- -r file                        checks if the file exists on system and it is readable
- -s file                        checks if the file exists on system and it is not empty
- -f file                         checks if the file exists on system and it is a file
- -O file                       checks if the file exists on system and if it’s is owned by the current user
- -G file                        checks if the file exists and the default group is the same as the current user
- -x file                         checks if the file exists on system and is executable
- file A -nt file B         checks if file A is newer than file B
- file A -ot file B          checks if file A is older than file B

*** functions
- function must precede call.
- exit - stop script
- return - stop function
#+begin_src sh
function_name () {
    if [ -z $1 ] ;then return 1;fi # Checks if any params.
    echo $1 # first parameter
    if [ $2 ] ; then
	echo "Parameter #2 is $2."
    fi
    ret="val" # return value
    return 32 # set $? status
}

func2 # call with no params
func2 first # call with one param

b(){ echo wtf;}

#+end_src

*** debug <<shell_debug>>
Display commands and their arguments as they are executed.
- bash -x script-name
- set -x - for bash

Display shell input lines as they are read.
- set -v - for bash

export _DEBUG=on #  intelligent DEBUG function

there is two way for debug: trap command and PROMPT_COMMAND="echo Bye"
**** links
- https://www.cyberciti.biz/tips/debugging-shell-script.html
- https://habr.com/ru/articles/666982/
