shell.html
<div id="outline-container-orgdcb9d85" class="outline-4">
<h4 id="orgdcb9d85"><span class="section-number-4">2.10.10.</span> loop</h4>
<div class="outline-text-4" id="text-2-10-10">
<ul class="org-ul">
<li>while - while COMMAND; do done</li>
<li>until - same as while and inverse</li>
<li>for - for v in VARIABLE; do ? done ; if no "in VARIABLE" - in "$@" is assumed</li>
<li>select word in words - same as echo words | while IFS=" " read word; do</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8ac6f2; font-weight: bold;">while</span> <span style="color: #cae682;">IFS</span>= read -r line
<span style="color: #8ac6f2; font-weight: bold;">do</span>
    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$line"</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span> &lt;&lt;&lt; <span style="color: #95e454;">"$the_list"</span>

<span style="color: #8ac6f2; font-weight: bold;">while</span> <span style="color: #cae682;">IFS</span>=, read -r name familyname address; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    <span style="color: #e5786d;">printf</span> <span style="color: #95e454;">'Got "%s", "%s", and "%s"\n'</span> <span style="color: #95e454;">"$name"</span> <span style="color: #95e454;">"$familyname"</span> <span style="color: #95e454;">"$address"</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span> &lt;file.csv

<span style="color: #8ac6f2; font-weight: bold;">while </span><span style="color: #e5786d;">read</span> line ; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    <span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">line</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span> &lt; &lt;( ... code ... )

your_code | <span style="color: #8ac6f2; font-weight: bold;">while </span><span style="color: #e5786d;">read</span> line;
<span style="color: #8ac6f2; font-weight: bold;">do</span>
    <span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">line</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">while read line;</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">do</span>
<span style="color: #fa8072;">#     </span><span style="color: #99968b; font-style: italic;">echo $line</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">done &lt; $lines</span>

<span style="color: #e5786d;">echo</span> -e <span style="color: #95e454;">"$a"</span> | <span style="color: #8ac6f2; font-weight: bold;">while</span> <span style="color: #cae682;">IFS</span>=<span style="color: #95e454;">":"</span> read f v; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$f _ $v"</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">f - first column v - all others</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #e5786d;">set</span> -- <span style="color: #95e454;">"123 3456"</span>
<span style="color: #8ac6f2; font-weight: bold;">for</span> v<span style="color: #8ac6f2; font-weight: bold;"> in</span> <span style="color: #95e454;">"$@"</span>; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    $<span style="color: #cae682;">v</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #8ac6f2; font-weight: bold;">for</span> j<span style="color: #8ac6f2; font-weight: bold;"> in</span> <span style="color: #fa8072;">`seq 0 24`</span>; <span style="color: #8ac6f2; font-weight: bold;">do</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">safest</span>
    ...
<span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #8ac6f2; font-weight: bold;">for</span> j<span style="color: #8ac6f2; font-weight: bold;"> in</span> <span style="color: #fa8072;">`seq 0 24`</span>; <span style="color: #8ac6f2; font-weight: bold;">do </span><span style="color: #e5786d;">echo</span> we ; <span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #8ac6f2; font-weight: bold;">select</span> DRINK<span style="color: #8ac6f2; font-weight: bold;"> in</span> tea cofee water juice appe all none
<span style="color: #8ac6f2; font-weight: bold;">do</span>
   <span style="color: #8ac6f2; font-weight: bold;">case</span> $<span style="color: #cae682;">DRINK</span><span style="color: #8ac6f2; font-weight: bold;"> in</span>
      tea|cofee|water|all)
         <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"Go to canteen"</span>
         ;;
      juice|appe)
         <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"Available at home"</span>
      ;;
      none)
         <span style="color: #8ac6f2; font-weight: bold;">break</span>
      ;;
      *) <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"ERROR: Invalid selection"</span>
      ;;
   <span style="color: #8ac6f2; font-weight: bold;">esac</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">loop files in current directory</span>
<span style="color: #8ac6f2; font-weight: bold;">for</span> filename<span style="color: #8ac6f2; font-weight: bold;"> in</span> *; <span style="color: #8ac6f2; font-weight: bold;">do </span><span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"put ${filename}"</span>; <span style="color: #8ac6f2; font-weight: bold;">done</span>

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">command for every line of file - can not use variables</span>
xargs -rd<span style="color: #95e454;">'\n'</span> -I@ -a p2.txt echo @

</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8ac6f2; font-weight: bold;">for</span> myvar<span style="color: #8ac6f2; font-weight: bold;"> in</span> <span style="color: #95e454;">"the first"</span> <span style="color: #95e454;">"the second"</span> <span style="color: #95e454;">"and the third"</span> ; <span style="color: #8ac6f2; font-weight: bold;">do</span>
        <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"This is ${myvar}"</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8ac6f2; font-weight: bold;">for</span> (( i = 1 ; i &lt;= 3 ; i++ )) ; <span style="color: #8ac6f2; font-weight: bold;">do</span>
        <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"i is ${i}"</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3311fa8" class="outline-4">
<h4 id="org3311fa8"><span class="section-number-4">2.10.11.</span> file comparision</h4>
<div class="outline-text-4" id="text-2-10-11">
<ul class="org-ul">
<li>-d file                        checks if the file exists and is it’s a directory</li>
<li>-e file                        checks if the file exists on system</li>
<li>-w file                       checks if the file exists on system and if it is writable</li>
<li>-r file                        checks if the file exists on system and it is readable</li>
<li>-s file                        checks if the file exists on system and it is not empty</li>
<li>-f file                         checks if the file exists on system and it is a file</li>
<li>-O file                       checks if the file exists on system and if it’s is owned by the current user</li>
<li>-G file                        checks if the file exists and the default group is the same as the current user</li>
<li>-x file                         checks if the file exists on system and is executable</li>
<li>file A -nt file B         checks if file A is newer than file B</li>
<li>file A -ot file B          checks if file A is older than file B</li>
</ul>
</div>
</div>

<div id="outline-container-orga34f5b1" class="outline-4">
<h4 id="orga34f5b1"><span class="section-number-4">2.10.12.</span> functions</h4>
<div class="outline-text-4" id="text-2-10-12">
<ul class="org-ul">
<li>function must precede call.</li>
<li>exit - stop script</li>
<li>return - stop function</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682; font-weight: bold;">function_name</span> () {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> [ -z $<span style="color: #cae682;">1</span> ] ;<span style="color: #8ac6f2; font-weight: bold;">then return</span> 1;<span style="color: #8ac6f2; font-weight: bold;">fi</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Checks if any params.</span>
    <span style="color: #e5786d;">echo</span> $<span style="color: #cae682;">1</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">first parameter</span>
    <span style="color: #8ac6f2; font-weight: bold;">if</span> [ $<span style="color: #cae682;">2</span> ] ; <span style="color: #8ac6f2; font-weight: bold;">then</span>
        <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"Parameter #2 is $2."</span>
    <span style="color: #8ac6f2; font-weight: bold;">fi</span>
    <span style="color: #cae682;">ret</span>=<span style="color: #95e454;">"val"</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">return value</span>
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 32 <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">set $? status</span>
}

func2 <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">call with no params</span>
func2 first <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">call with one param</span>

<span style="color: #cae682; font-weight: bold;">b</span>(){ <span style="color: #e5786d;">echo</span> wtf;}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe61c7f" class="outline-4">
<h4 id="orgbe61c7f"><span class="section-number-4">2.10.13.</span> debug <a id="orgfad25a8"></a></h4>
<div class="outline-text-4" id="text-2-10-13">
<p>
Display commands and their arguments as they are executed.
</p>
<ul class="org-ul">
<li>bash -x script-name</li>
<li>set -x - for bash</li>
</ul>

<p>
Display shell input lines as they are read.
</p>
<ul class="org-ul">
<li>set -v - for bash</li>
</ul>

<p>
export _DEBUG=on #  intelligent DEBUG function
</p>

<p>
there is two way for debug: trap command and PROMPT<sub>COMMAND</sub>="echo Bye"
</p>
</div>
<ol class="org-ol">
<li><a id="org1e250ee"></a>links<br />
<div class="outline-text-5" id="text-2-10-13-1">
<ul class="org-ul">
<li><a href="https://www.cyberciti.biz/tips/debugging-shell-script.html">https://www.cyberciti.biz/tips/debugging-shell-script.html</a></li>
<li><a href="https://habr.com/ru/articles/666982/">https://habr.com/ru/articles/666982/</a></li>
</ul>
</div>
</li>
</ol>
</div>
