sources_org/shell.org
*** exit status
- $?
- exit 5

exit codes:
- 0           success
- 1-255       failure (in general)
- 1 : Miscellaneous errors, such as “divide by zero” and other impermissible operations.
- 2 : Missing keyword or command, or permission problem.
- 126         the requested command (file) can't be executed (but was found)
- 127         command (file) not found
- 128         according to ABS it's used to report an invalid argument to the exit uiltin, but I wasn't able to verify that in the source code of Bash (see code 255)
- 128 +        N the shell was terminated by the signal N (also used like this by various other programs), invalid argument to exit.
- 255          wrong argument to the exit builtin (see code 128)
*** generate random

2 byte unsigned decimal integers,
: $ od -vAn -N2 -tu2 < /dev/urandom
: 24352

1 byte signed decimal integer,
: $ od -vAn -N1 -td1 < /dev/urandom
: -78

4 byte unsigned decimal integers,
: $ od -vAn -N4 -tu4 < /dev/urandom
: 3394619386

seconds since epoch
: date +%s%N | cut -b10-19

RANDOM env variable
: echo $RANDOM % 1000 + 1 | bc

shasum
: head -100 /dev/urandom | sha1sum | cut -d ' ' -f 1
*** documentation
#+begin_src sh
# Processes a file.
# $1 - the name of the input file
# $2 - the name of the output file
process_file(){
}
#+end_src
*** best practices
1) safer scripts, see [[set]]:
   - set -euxo pipefail
2) Instead of, use:
   - cd "${foo}"; ... ; cd ..
   - ( cd "${foo}" ... )
   - pushd "${foo}"; ... ; popd
3) variables:
   - preffer local
   - global make readonle declare -r
   - always refer as "${var}"
4) Prepend a command with \ to override alias/builtin lookup. E.g.:
   - t() { ls ;}
   - alias  t="ls .."
   - t # refer to alias
   - \t # refer to function
5) For various reasons, printf is preferable to echo
   - error() {  printf "${red}!!! %s${reset}\\n" "${*}" 1>&2 ;   }
6) Name heredoc tags with what they’re part of, like:
#+begin_src sh
cat <<HELPMSG
  usage $0 [OPTION]... [ARGUMENT]...
HELPMSG
# Single-quote heredocs leading tag to prevent interpolation of text between them.
cat <<'MSG'
  [...]
MSG

# 7)
# this won't work:
  sudo printf "..." > /root/some_file

# this will:
  printf "..." | sudo tee /root/some_file > /dev/null


8) if
# Don't do this
  if [ "$#" -ge "1" ] && [ "$1" = '-h' ] || [ "$1" = '--help' ] || [ "$1" = "-?" ]; then
    usage
    exit 0
  fi

# Do this
  help_wanted() {
    [ "$#" -ge "1" ] && [ "$1" = '-h' ] || [ "$1" = '--help' ] || [ "$1" = "-?" ]
  }

  if help_wanted "$@"; then
    usage
    exit 0
  fi
#+end_src

9) Check whether the script is running in the correct folder
   - Allow the script to run in any folder
   - Allow the script to run in any folder and locate input and output based on the environment
   - Require the script to be run from a certain folder and test if folder is good.

10) write log:
: echo "[${now}] Logfile for $scriptName:  $logFile" 2>&1 | tee $logFile

11) Create documentation with -h and --help
12) Clean up function
#+begin_src sh
finish() {
  result=$?
  # Your cleanup code here
  exit ${result}
}
trap finish EXIT ERR # secuted on EXIT or ERR
#+end_src



# instead of
grep pattern file | awk ‘{print $1}’
# use
awk ‘/pattern/{print $1}’
**** links
- https://www.javacodegeeks.com/2013/10/shell-scripting-best-practices.html
- https://bertvv.github.io/cheat-sheets/Bash.html
- http://redsymbol.net/articles/bash-exit-traps/

*** export
: export FLASK_RUN_HOST=localhost FLASK_RUN_PORT=8080 ; flask --app main run --no-debug

new bash session will have exports.
- -n NAME - disable export
- -f - export function
- -p - same as env but in order of history of exports.
*** null command
:
creates the effect of block comments in Bash scripts.
*** multiline comment
#+begin_src bash :results output :exports both
: << 'END'
This is a comment
END
#+end_src

#+RESULTS:
: $100

*** read
Read a line from the standard input.
- -d delim	continue until the first character of DELIM is read, by default '\n'
- -r 		If this option is given, backslash does not act as an escape character. The backslash is considered to be
 part of the line.
: read -ei asd: aaa ; echo $aaa
: >> asd:22345r
: >> asd:22345r

: read -d '' <<EOF ... EOF

Collect all input until EOF, exit code = 1
#+begin_src bash :results output :eval never
read -d '' AAA
# echo $AAA
mypy -c "$AAA"
#+end_src

*** Templates
in function check that argument was passed
: if [ -z "$1" ] ; then echo brute_loop no \$1 ; return 1 ; fi
*** links
https://devmanual.gentoo.org/tools-reference/bash/index.html
