shell.html
<div id="outline-container-org4846fde" class="outline-4">
<h4 id="org4846fde"><span class="section-number-4">2.10.14.</span> exit status</h4>
<div class="outline-text-4" id="text-2-10-14">
<ul class="org-ul">
<li>$?</li>
<li>exit 5</li>
</ul>

<p>
exit codes:
</p>
<ul class="org-ul">
<li>0           success</li>
<li>1-255       failure (in general)</li>
<li>1 : Miscellaneous errors, such as “divide by zero” and other impermissible operations.</li>
<li>2 : Missing keyword or command, or permission problem.</li>
<li>126         the requested command (file) can't be executed (but was found)</li>
<li>127         command (file) not found</li>
<li>128         according to ABS it's used to report an invalid argument to the exit uiltin, but I wasn't able to verify that in the source code of Bash (see code 255)</li>
<li>128 +        N the shell was terminated by the signal N (also used like this by various other programs), invalid argument to exit.</li>
<li>255          wrong argument to the exit builtin (see code 128)</li>
</ul>
</div>
</div>
<div id="outline-container-org7701081" class="outline-4">
<h4 id="org7701081"><span class="section-number-4">2.10.15.</span> generate random</h4>
<div class="outline-text-4" id="text-2-10-15">
<p>
2 byte unsigned decimal integers,
</p>
<pre class="example">
$ od -vAn -N2 -tu2 &lt; /dev/urandom
24352
</pre>


<p>
1 byte signed decimal integer,
</p>
<pre class="example">
$ od -vAn -N1 -td1 &lt; /dev/urandom
-78
</pre>


<p>
4 byte unsigned decimal integers,
</p>
<pre class="example">
$ od -vAn -N4 -tu4 &lt; /dev/urandom
3394619386
</pre>


<p>
seconds since epoch
</p>
<pre class="example">
date +%s%N | cut -b10-19
</pre>


<p>
RANDOM env variable
</p>
<pre class="example">
echo $RANDOM % 1000 + 1 | bc
</pre>


<p>
shasum
</p>
<pre class="example">
head -100 /dev/urandom | sha1sum | cut -d ' ' -f 1
</pre>
</div>
</div>
<div id="outline-container-orgd56fa26" class="outline-4">
<h4 id="orgd56fa26"><span class="section-number-4">2.10.16.</span> documentation</h4>
<div class="outline-text-4" id="text-2-10-16">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Processes a file.</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">$1 - the name of the input file</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">$2 - the name of the output file</span>
<span style="color: #cae682; font-weight: bold;">process_file</span>(){
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd3004ca" class="outline-4">
<h4 id="orgd3004ca"><span class="section-number-4">2.10.17.</span> best practices</h4>
<div class="outline-text-4" id="text-2-10-17">
<ol class="org-ol">
<li>safer scripts, see <a href="#orgd02d529">2.11</a>:
<ul class="org-ul">
<li>set -euxo pipefail</li>
</ul></li>
<li>Instead of, use:
<ul class="org-ul">
<li>cd "${foo}"; &#x2026; ; cd ..</li>
<li>( cd "${foo}" &#x2026; )</li>
<li>pushd "${foo}"; &#x2026; ; popd</li>
</ul></li>
<li>variables:
<ul class="org-ul">
<li>preffer local</li>
<li>global make readonle declare -r</li>
<li>always refer as "${var}"</li>
</ul></li>
<li>Prepend a command with \ to override alias/builtin lookup. E.g.:
<ul class="org-ul">
<li>t() { ls ;}</li>
<li>alias  t="ls .."</li>
<li>t # refer to alias</li>
<li>\t # refer to function</li>
</ul></li>
<li>For various reasons, printf is preferable to echo
<ul class="org-ul">
<li>error() {  printf "\({red}!!! %s\){reset}\\n" "${*}" 1&gt;&amp;2 ;   }</li>
</ul></li>
<li>Name heredoc tags with what they’re part of, like:</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">cat &lt;&lt;HELPMSG
<span style="color: #ffff00; font-weight: bold;">  usage $0 [OPTION]... [ARGUMENT]...</span>
<span style="color: #ffff00; font-weight: bold;">HELPMSG</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Single-quote heredocs leading tag to prevent interpolation of text between them.</span>
cat &lt;&lt;<span style="color: #95e454;">'MSG'</span>
<span style="color: #ffff00; font-weight: bold;">  [...]</span>
<span style="color: #ffff00; font-weight: bold;">MSG</span>

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">7)</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">this won't work:</span>
  sudo printf <span style="color: #95e454;">"..."</span> &gt; /root/some_file

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">this will:</span>
  <span style="color: #e5786d;">printf</span> <span style="color: #95e454;">"..."</span> | sudo tee /root/some_file &gt; /dev/null


8) <span style="color: #8ac6f2; font-weight: bold;">if</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Don't do this</span>
  <span style="color: #8ac6f2; font-weight: bold;">if</span> [ <span style="color: #95e454;">"$#"</span> -ge <span style="color: #95e454;">"1"</span> ] &amp;&amp; [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">'-h'</span> ] || [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">'--help'</span> ] || [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">"-?"</span> ]; <span style="color: #8ac6f2; font-weight: bold;">then</span>
    usage
    <span style="color: #8ac6f2; font-weight: bold;">exit</span> 0
  <span style="color: #8ac6f2; font-weight: bold;">fi</span>

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Do this</span>
  help_wanted() {
    [ <span style="color: #95e454;">"$#"</span> -ge <span style="color: #95e454;">"1"</span> ] &amp;&amp; [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">'-h'</span> ] || [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">'--help'</span> ] || [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">"-?"</span> ]
  }

  <span style="color: #8ac6f2; font-weight: bold;">if</span> help_wanted <span style="color: #95e454;">"$@"</span>; <span style="color: #8ac6f2; font-weight: bold;">then</span>
    usage
    <span style="color: #8ac6f2; font-weight: bold;">exit</span> 0
  <span style="color: #8ac6f2; font-weight: bold;">fi</span>
</pre>
</div>

<ol class="org-ol">
<li>Check whether the script is running in the correct folder
<ul class="org-ul">
<li>Allow the script to run in any folder</li>
<li>Allow the script to run in any folder and locate input and output based on the environment</li>
<li>Require the script to be run from a certain folder and test if folder is good.</li>
</ul></li>

<li>write log:</li>
</ol>
<pre class="example">
echo "[${now}] Logfile for $scriptName:  $logFile" 2&gt;&amp;1 | tee $logFile
</pre>


<ol class="org-ol">
<li>Create documentation with -h and &#x2013;help</li>
<li>Clean up function</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682; font-weight: bold;">finish</span>() {
  <span style="color: #cae682;">result</span>=$<span style="color: #cae682;">?</span>
  <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Your cleanup code here</span>
  <span style="color: #8ac6f2; font-weight: bold;">exit</span> ${<span style="color: #cae682;">result</span>}
}
<span style="color: #8ac6f2; font-weight: bold;">trap</span> finish EXIT ERR <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">secuted on EXIT or ERR</span>
</pre>
</div>



<p>
grep pattern file | awk ‘{print $1}’
</p>

<p>
awk ‘/pattern/{print $1}’
</p>
</div>
<ol class="org-ol">
<li><a id="org7fbeeae"></a>links<br />
<div class="outline-text-5" id="text-2-10-17-1">
<ul class="org-ul">
<li><a href="https://www.javacodegeeks.com/2013/10/shell-scripting-best-practices.html">https://www.javacodegeeks.com/2013/10/shell-scripting-best-practices.html</a></li>
<li><a href="https://bertvv.github.io/cheat-sheets/Bash.html">https://bertvv.github.io/cheat-sheets/Bash.html</a></li>
<li><a href="http://redsymbol.net/articles/bash-exit-traps/">http://redsymbol.net/articles/bash-exit-traps/</a></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgcf9c587" class="outline-4">
<h4 id="orgcf9c587"><span class="section-number-4">2.10.18.</span> export</h4>
<div class="outline-text-4" id="text-2-10-18">
<pre class="example">
export FLASK_RUN_HOST=localhost FLASK_RUN_PORT=8080 ; flask --app main run --no-debug
</pre>


<p>
new bash session will have exports.
</p>
<ul class="org-ul">
<li>-n NAME - disable export</li>
<li>-f - export function</li>
<li>-p - same as env but in order of history of exports.</li>
</ul>
</div>
</div>
<div id="outline-container-orga9d1d1e" class="outline-4">
<h4 id="orga9d1d1e"><span class="section-number-4">2.10.19.</span> null command</h4>
<div class="outline-text-4" id="text-2-10-19">
<pre class="example">

</pre>

<p>
creates the effect of block comments in Bash scripts.
</p>
</div>
</div>
<div id="outline-container-org9fc9537" class="outline-4">
<h4 id="org9fc9537"><span class="section-number-4">2.10.20.</span> multiline comment</h4>
<div class="outline-text-4" id="text-2-10-20">
<div class="org-src-container">
<pre class="src src-bash">: &lt;&lt; <span style="color: #95e454;">'END'</span>
<span style="color: #ffff00; font-weight: bold;">This is a comment</span>
<span style="color: #ffff00; font-weight: bold;">END</span>
</pre>
</div>

<pre class="example">
$100
</pre>
</div>
</div>

<div id="outline-container-org36f75d3" class="outline-4">
<h4 id="org36f75d3"><span class="section-number-4">2.10.21.</span> read</h4>
<div class="outline-text-4" id="text-2-10-21">
<p>
Read a line from the standard input.
</p>
<ul class="org-ul">
<li>-d delim	continue until the first character of DELIM is read, by default '\n'</li>
<li>-r 		If this option is given, backslash does not act as an escape character. The backslash is considered to be
part of the line.</li>
</ul>
<pre class="example">
read -ei asd: aaa ; echo $aaa
&gt;&gt; asd:22345r
&gt;&gt; asd:22345r
</pre>


<pre class="example">
read -d '' &lt;&lt;EOF ... EOF
</pre>


<p>
Collect all input until EOF, exit code = 1
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #e5786d;">read</span> -d <span style="color: #95e454;">''</span> AAA
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">echo $AAA</span>
mypy -c <span style="color: #95e454;">"$AAA"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5b03b3" class="outline-4">
<h4 id="orgd5b03b3"><span class="section-number-4">2.10.22.</span> Templates</h4>
<div class="outline-text-4" id="text-2-10-22">
<p>
in function check that argument was passed
</p>
<pre class="example">
if [ -z "$1" ] ; then echo brute_loop no \$1 ; return 1 ; fi
</pre>
</div>
</div>
<div id="outline-container-org3121e14" class="outline-4">
<h4 id="org3121e14"><span class="section-number-4">2.10.23.</span> links</h4>
<div class="outline-text-4" id="text-2-10-23">
<p>
<a href="https://devmanual.gentoo.org/tools-reference/bash/index.html">https://devmanual.gentoo.org/tools-reference/bash/index.html</a>
</p>
</div>
</div>
</div>
