sources_org/shell.org
** set builtin <<set>>
see [[shell_debug]]
: help set

Using + rather than - causes these flags to be turned off.

The current set of flags:
: echo $- # himBHs

- --  Assign any remaining arguments to the positional parameters.
- -   Assign any remaining arguments to the positional parameters.
- -e  Exit immediately if a command exits with a non-zero status.
- -u  Treat unset variables as an error when substituting.
- -f  Disable file name generation (globbing). disables filename expansion also known as globbing.
- -o pipefail exit execution if one of the commands in the pipe fails.
- -v  Print shell input lines as they are read.
- -x  Print commands and their arguments as they are executed.
- -C  If set, disallow existing regular files to be overwritten by redirection of output
- -T  If set, the DEBUG and RETURN traps are inherited by shell functions.

set -e may result in some difficult to debug issues during loops because a failed command will _only exit the subshell created by the pipe_

*** usage
Prevent unexpected errors, make shell safer:
: set -euxo pipefail

#+begin_src sh :eval never
# "unofficial" bash strict mode
# See: http://redsymbol.net/articles/unofficial-bash-strict-mode
set -o errexit  # Exit when simple command fails               'set -e'
set -o errtrace # Exit on error inside any functions or subshells.
set -o nounset  # Trigger error when expanding unset variables 'set -u'
set -o pipefail # Do not hide errors within pipes              'set -o pipefail'
set -o xtrace   # Display expanded command and arguments       'set -x'
IFS=$'\n\t'     # Split words on \n\t rather than spaces
#+end_src

*** traps
Defines and activates handlers to be run when the shell receives signals
    or other conditions.

: trap --help
- -l	print a list of signal names and their corresponding numbers
- -p	display the trap commands associated with each SIGNAL_SPEC

Besides traps(handlers) for signals, bash have 4 special traps:
- EXIT to run on exit from the shell.
- RETURN to run each time a function or a sources script finishes.
- ERR to run each time command failure would cause the shell to exit if set -e is used.
- DEBUG to execute before every command.

: trap "echo $BASH_COMMAND" DEBUG

add variable trace attribete to see when it used:
#+begin_src sh :eval never
declare -t VARIABLE=value
trap "echo VARIABLE is being used here." DEBUG
#+end_src

#+begin_src sh :eval never
set -E # If set, the ERR trap is inherited by shell functions.
set -o pipefail # exit execution if one of the commands in the pipe fails.
set -u # Report Non-Existent Variables
trap 'echo $? $LINENO :${BASH_LINENO[@]} "$BASH_COMMAND" ::${FUNCNAME[@]}' ERR
#+end_src
**** links
- https://selivan.github.io/2022/05/21/bash-debug.html
- https://tldp.org/LDP/Bash-Beginners-Guide/html/sect_12_02.html
** ls
directory -  flat file that maps an name to inode on the filesystem.

- ls -al -tr - sort by time, reversal (latest at the bottom) (desc)
- ls * - directories and their files/folders - deep 1
- ls -d */ - only directories
- ls -d .* - dot files
- ls -d /home/user/{*,.*} - directories and all files, include hidden with full path
- ls -F appends symbols to filenames */=>@|
  - @ means symbolic link (or that the file has extended attributes).
  - * means executable.
  - = means socket.
  - | means named pipe.
  - > means door.
  - / means directory.

output in columns with classify
: l='ls -F --color' ; paste -d: <($l | grep '/$') <($l | grep '*$') <($l | grep '@$') <($l | grep -v '[/@*]$') | tac| column -t -s ":" -N FOLDERS,EXECUTABLES,LINKS,OTHER
*** get direcotories
- ls -d */
- ls -l | grep ^d
- find . -maxdepth 1 -type d
- echo */
- tree -d -L 1
*** Linux File Timestamps
- mtime - modified time - write file's conetents
- ctime - change time - tracks metadata changes such as ownership and permissions. It includes renaming a file.
- atime - (access time) anyone accessed the file

ls - default mtime
- u - atime
- c - ctime
** pushd/popd and dirs
- dirs -v - to print stack
- dirs - cd history without pushd/popd.
  - dirs +0 - current directory
  - dirs +1 - last directory
  - ~1 = dirs +1
  - ~-0 dirs -0 - first directory in history
https://www.howtogeek.com/659146/how-to-use-pushd-and-popd-on-linux/
** sh script
#+begin_src bash :eval no :exports code :results none
#!/usr/bin/env bash
set -euxo pipefail

help_wanted() {
    [ "$#" -ge "1" ] && [ "$1" = '-h' ] || [ "$1" = '--help' ] || [ "$1" = "-?" ]
}

if help_wanted "$@"; then
    usage
    exit 0
fi
#+end_src

# https://gist.github.com/mohanpedala/1e2ff5661761d3abd0385e8223e16425
