shell.html
<div id="outline-container-org402c539" class="outline-3">
<h3 id="org402c539"><span class="section-number-3">2.11.</span> set builtin <a id="orgd02d529"></a></h3>
<div class="outline-text-3" id="text-2-11">
<p>
see <a href="#orgfad25a8">2.10.13</a>
</p>
<pre class="example">
help set
</pre>


<p>
Using + rather than - causes these flags to be turned off.
</p>

<p>
The current set of flags:
</p>
<pre class="example">
echo $- # himBHs
</pre>


<ul class="org-ul">
<li>&#x2013;  Assign any remaining arguments to the positional parameters.</li>
<li>-   Assign any remaining arguments to the positional parameters.</li>
<li>-e  Exit immediately if a command exits with a non-zero status.</li>
<li>-u  Treat unset variables as an error when substituting.</li>
<li>-f  Disable file name generation (globbing). disables filename expansion also known as globbing.</li>
<li>-o pipefail exit execution if one of the commands in the pipe fails.</li>
<li>-v  Print shell input lines as they are read.</li>
<li>-x  Print commands and their arguments as they are executed.</li>
<li>-C  If set, disallow existing regular files to be overwritten by redirection of output</li>
<li>-T  If set, the DEBUG and RETURN traps are inherited by shell functions.</li>
</ul>

<p>
set -e may result in some difficult to debug issues during loops because a failed command will <span class="underline">only exit the subshell created by the pipe</span>
</p>
</div>

<div id="outline-container-orgeb0c27f" class="outline-4">
<h4 id="orgeb0c27f"><span class="section-number-4">2.11.1.</span> usage</h4>
<div class="outline-text-4" id="text-2-11-1">
<p>
Prevent unexpected errors, make shell safer:
</p>
<pre class="example">
set -euxo pipefail
</pre>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">"unofficial" bash strict mode</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">See: http://redsymbol.net/articles/unofficial-bash-strict-mode</span>
<span style="color: #e5786d;">set</span> -o errexit  <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Exit when simple command fails               'set -e'</span>
<span style="color: #e5786d;">set</span> -o errtrace <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Exit on error inside any functions or subshells.</span>
<span style="color: #e5786d;">set</span> -o nounset  <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Trigger error when expanding unset variables 'set -u'</span>
<span style="color: #e5786d;">set</span> -o pipefail <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Do not hide errors within pipes              'set -o pipefail'</span>
<span style="color: #e5786d;">set</span> -o xtrace   <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Display expanded command and arguments       'set -x'</span>
<span style="color: #cae682;">IFS</span>=$<span style="color: #95e454;">'\n\t'</span>     <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Split words on \n\t rather than spaces</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org49e37b0" class="outline-4">
<h4 id="org49e37b0"><span class="section-number-4">2.11.2.</span> traps</h4>
<div class="outline-text-4" id="text-2-11-2">
<p>
Defines and activates handlers to be run when the shell receives signals
    or other conditions.
</p>

<pre class="example">
trap --help
</pre>

<ul class="org-ul">
<li>-l	print a list of signal names and their corresponding numbers</li>
<li>-p	display the trap commands associated with each SIGNAL<sub>SPEC</sub></li>
</ul>

<p>
Besides traps(handlers) for signals, bash have 4 special traps:
</p>
<ul class="org-ul">
<li>EXIT to run on exit from the shell.</li>
<li>RETURN to run each time a function or a sources script finishes.</li>
<li>ERR to run each time command failure would cause the shell to exit if set -e is used.</li>
<li>DEBUG to execute before every command.</li>
</ul>

<pre class="example">
trap "echo $BASH_COMMAND" DEBUG
</pre>


<p>
add variable trace attribete to see when it used:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #e5786d;">declare</span> -t <span style="color: #cae682;">VARIABLE</span>=value
<span style="color: #8ac6f2; font-weight: bold;">trap</span> <span style="color: #95e454;">"echo VARIABLE is being used here."</span> DEBUG
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #e5786d;">set</span> -E <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">If set, the ERR trap is inherited by shell functions.</span>
<span style="color: #e5786d;">set</span> -o pipefail <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">exit execution if one of the commands in the pipe fails.</span>
<span style="color: #e5786d;">set</span> -u <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Report Non-Existent Variables</span>
<span style="color: #8ac6f2; font-weight: bold;">trap</span> <span style="color: #95e454;">'echo $? $LINENO :${BASH_LINENO[@]} "$BASH_COMMAND" ::${FUNCNAME[@]}'</span> ERR
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orgb11afd4"></a>links<br />
<div class="outline-text-5" id="text-2-11-2-1">
<ul class="org-ul">
<li><a href="https://selivan.github.io/2022/05/21/bash-debug.html">https://selivan.github.io/2022/05/21/bash-debug.html</a></li>
<li><a href="https://tldp.org/LDP/Bash-Beginners-Guide/html/sect_12_02.html">https://tldp.org/LDP/Bash-Beginners-Guide/html/sect_12_02.html</a></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org0e44ab1" class="outline-3">
<h3 id="org0e44ab1"><span class="section-number-3">2.12.</span> ls</h3>
<div class="outline-text-3" id="text-2-12">
<p>
directory -  flat file that maps an name to inode on the filesystem.
</p>

<ul class="org-ul">
<li>ls -al -tr - sort by time, reversal (latest at the bottom) (desc)</li>
<li>ls * - directories and their files/folders - deep 1</li>
<li>ls -d */ - only directories</li>
<li>ls -d .* - dot files</li>
<li>ls -d /home/user/{<b>,.</b>} - directories and all files, include hidden with full path</li>
<li>ls -F appends symbols to filenames */=&gt;@|
<ul class="org-ul">
<li>@ means symbolic link (or that the file has extended attributes).</li>
<li>* means executable.</li>
<li>= means socket.</li>
<li>| means named pipe.</li>
<li>&gt; means door.</li>
<li>/ means directory.</li>
</ul></li>
</ul>

<p>
output in columns with classify
</p>
<pre class="example">
l='ls -F --color' ; paste -d: &lt;($l | grep '/$') &lt;($l | grep '*$') &lt;($l | grep '@$') &lt;($l | grep -v '[/@*]$') | tac| column -t -s ":" -N FOLDERS,EXECUTABLES,LINKS,OTHER
</pre>
</div>
<div id="outline-container-orgc40482e" class="outline-4">
<h4 id="orgc40482e"><span class="section-number-4">2.12.1.</span> get direcotories</h4>
<div class="outline-text-4" id="text-2-12-1">
<ul class="org-ul">
<li>ls -d */</li>
<li>ls -l | grep ^d</li>
<li>find . -maxdepth 1 -type d</li>
<li>echo */</li>
<li>tree -d -L 1</li>
</ul>
</div>
</div>
<div id="outline-container-org8ffadd1" class="outline-4">
<h4 id="org8ffadd1"><span class="section-number-4">2.12.2.</span> Linux File Timestamps</h4>
<div class="outline-text-4" id="text-2-12-2">
<ul class="org-ul">
<li>mtime - modified time - write file's conetents</li>
<li>ctime - change time - tracks metadata changes such as ownership and permissions. It includes renaming a file.</li>
<li>atime - (access time) anyone accessed the file</li>
</ul>

<p>
ls - default mtime
</p>
<ul class="org-ul">
<li>u - atime</li>
<li>c - ctime</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdac21fb" class="outline-3">
<h3 id="orgdac21fb"><span class="section-number-3">2.13.</span> pushd/popd and dirs</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>dirs -v - to print stack</li>
<li>dirs - cd history without pushd/popd.
<ul class="org-ul">
<li>dirs +0 - current directory</li>
<li>dirs +1 - last directory</li>
<li>~1 = dirs +1</li>
<li>~-0 dirs -0 - first directory in history</li>
</ul></li>
</ul>
<p>
<a href="https://www.howtogeek.com/659146/how-to-use-pushd-and-popd-on-linux/">https://www.howtogeek.com/659146/how-to-use-pushd-and-popd-on-linux/</a>
</p>
</div>
</div>
