sources_org/shell.org
** source & ./ & exec
in bash . and source equal
in POSIX:
- ./script creates a new shell and executes each command in the script within the new shell. When
  the end of the script file is encountered, the new shell exits. Any changes in the new shell
  caused by the script are lost when the shell exits. (no screen formations)
- *source* execute a shell script within the context of the current shell. Since execution takes place
  within the context of the current shell, any changes in the shell are retained following the
  completion of the shell. (like by yourself)
- . script - in the current shell without forking a sub shell (equal to *source*)
- exec ./script - exit shell after finish

The exec command will execute a command in place of the current shell, that is, it terminates the
current shell and starts a new process in its place.

exec was often used to execute the last command of a shell script. This would kill the shell
slightly earlier; otherwise, the shell would wait until the last command was finished. This practice
saves a process and some memory.

try exec ls. you will be logged out from your login shell.
** ariphmetic
let m=(4 * 1024)
echo $((2*2))
((m-=3)) # m=m-3
((m++)

the let command is not specified by POSIX®. The portable alternative is:
[ "$(( <EXPRESSION> ))" -ne 0 ]

echo $((2#010)) - binary to decimal

expr
- is command should be preffered
- cannot assign directly to bash variables but instead returns a result on stdout
- takes each operator it recognizes as a separate word and then concatenates them into a single expression that's evaluated according to it's own rules (which differ from shell arithmetic).
** execute command
$() or ``

. file == source file - execute commands in file in current shell. no need x right
./file - execute file - need x right

 $( ) has the side-effect of removing trailing newlines from the results.
** xargs
- -0, --null - Input items are terminated by a null character instead of by whitespace - file or directory
  names containing spaces or newlines are correctly handled
-

- transfer input to one line usable as arguments (default echo)
- xargs -n 2 # execute command for every two argument, ex diff

ex
- find /path -name '*.foo' | xargs -P 24 -I '{}' /cpu/bound/process '{}' -o '{}'.out
  - -P n - Run up to max-procs processes at a time
- cat lines | xargs | tr ' ' ',' => line1,line2,line3,line4
** history save with time
with timestamp
echo 'export HISTTIMEFORMAT="%d/%m/%y %T "' >> ~/.bash_profile

** id -u user
get user id
** diff
https://www.math.utah.edu/docs/info/diff_3.html

- default
- “Copied” context with -c
- “Unified” context with -u Instead of displaying the two files separately, it merges them together.

diff one two

Default context - no longer widely used (used by git)
- `8a12,15' (lar) - after line 8 of one append lines 12-15 of two.
- '5,7c8,10' (fct) - change lines 5--7 of one to read as lines 8--10 of two
- `5,7d3' (rdl) - delete lines 5--7 of one (which at 3 in two)
- < - in one
- > - in two

“Copied” context - has context lines without pre-symbols
- '!' - changing like
- '+' - line of two file (nothin in one)
- '-' - line of one file (nothin in two)

“Unified” context - more compact because it omits redundant context lines. GNU patch can apply this format.
- *** from-file from-file-modification-time
- --- to-file to-file-modification time
- @@ from-file-range to-file-range @@
- '+' line of two file
- '-' line of one file

Differences Side by Side diff -y :
- `|'    The corresponding lines differ, and they are either both complete or both incomplete.
- `<'    The files differ and only the first file contains the line.
- `>'    The files differ and only the second file contains the line.
- `('    Only the first file contains the line, but the difference is ignored.
- `)'    Only the second file contains the line, but the difference is ignored.
- `\'    The corresponding lines differ, and only the first line is incomplete.
- `/'    The corresponding lines differ, and only the second line is incomplete.
** date
- date +%c --date "2022-06-20" => Mon Jun 20 00:00:00 2022
- date +%F --date='@2147483647' => 2038-01-19
- date --date '06/02/2016 09:01:39' +"%s" => 1464872499
- date +%s => 1656480511
** ps <<ps>>
https://www.computernetworkingnotes.com/linux-tutorials/ps-aux-command-and-ps-command-explained.html

a:- This option prints the running processes from all users.
u:- This option shows user or owner column in output.
x:- This option prints the processes those have not been executed from the terminal.

ps –eo pid,user,%cpu,cmd –-sort=-%cpu | head –n 4
ps –A --forest

notes:
- CPU usage is expressed as the percentage of time spent running during the entire lifetime of a process.
- The SIZE and RSS fields don't count some parts of a process including the page tables, kernel stack, struct thread_info, and struct task_struct.
- SIZE is the virtual size of the process (code+data+stack).
- Processes marked <defunct> are dead processes (so-called "zombies") that remain because their parent has not destroyed them properly.
- If the length of the username is greater than the length of the display column, the username will be truncated.

PID of the bash script you can use variable $$
