shell.html
<div id="outline-container-org657c10a" class="outline-3">
<h3 id="org657c10a"><span class="section-number-3">2.14.</span> sh script</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fa8072;">#</span><span style="color: #99968b; font-style: italic;">!/usr/bin/</span><span style="color: #8ac6f2; font-weight: bold;">env</span><span style="color: #99968b; font-style: italic;"> bash</span>
<span style="color: #e5786d;">set</span> -euxo pipefail

<span style="color: #cae682; font-weight: bold;">help_wanted</span>() {
    [ <span style="color: #95e454;">"$#"</span> -ge <span style="color: #95e454;">"1"</span> ] &amp;&amp; [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">'-h'</span> ] || [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">'--help'</span> ] || [ <span style="color: #95e454;">"$1"</span> = <span style="color: #95e454;">"-?"</span> ]
}

<span style="color: #8ac6f2; font-weight: bold;">if</span> help_wanted <span style="color: #95e454;">"$@"</span>; <span style="color: #8ac6f2; font-weight: bold;">then</span>
    usage
    <span style="color: #8ac6f2; font-weight: bold;">exit</span> 0
<span style="color: #8ac6f2; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org224f39d" class="outline-3">
<h3 id="org224f39d"><span class="section-number-3">2.15.</span> source &amp; ./ &amp; exec</h3>
<div class="outline-text-3" id="text-2-15">
<p>
in bash . and source equal
in POSIX:
</p>
<ul class="org-ul">
<li>./script creates a new shell and executes each command in the script within the new shell. When
the end of the script file is encountered, the new shell exits. Any changes in the new shell
caused by the script are lost when the shell exits. (no screen formations)</li>
<li><b>source</b> execute a shell script within the context of the current shell. Since execution takes place
within the context of the current shell, any changes in the shell are retained following the
completion of the shell. (like by yourself)</li>
<li>. script - in the current shell without forking a sub shell (equal to <b>source</b>)</li>
<li>exec ./script - exit shell after finish</li>
</ul>

<p>
The exec command will execute a command in place of the current shell, that is, it terminates the
current shell and starts a new process in its place.
</p>

<p>
exec was often used to execute the last command of a shell script. This would kill the shell
slightly earlier; otherwise, the shell would wait until the last command was finished. This practice
saves a process and some memory.
</p>

<p>
try exec ls. you will be logged out from your login shell.
</p>
</div>
</div>
<div id="outline-container-orgb789acf" class="outline-3">
<h3 id="orgb789acf"><span class="section-number-3">2.16.</span> ariphmetic</h3>
<div class="outline-text-3" id="text-2-16">
<p>
let m=(4 * 1024)
echo $((2*2))
((m-=3)) # m=m-3
((m++)
</p>

<p>
the let command is not specified by POSIX®. The portable alternative is:
[ "$(( &lt;EXPRESSION&gt; ))" -ne 0 ]
</p>

<p>
echo $((2#010)) - binary to decimal
</p>

<p>
expr
</p>
<ul class="org-ul">
<li>is command should be preffered</li>
<li>cannot assign directly to bash variables but instead returns a result on stdout</li>
<li>takes each operator it recognizes as a separate word and then concatenates them into a single expression that's evaluated according to it's own rules (which differ from shell arithmetic).</li>
</ul>
</div>
</div>
<div id="outline-container-orgda4ca81" class="outline-3">
<h3 id="orgda4ca81"><span class="section-number-3">2.17.</span> execute command</h3>
<div class="outline-text-3" id="text-2-17">
<p>
$() or ``
</p>

<p>
. file == source file - execute commands in file in current shell. no need x right
./file - execute file - need x right
</p>

<p>
$( ) has the side-effect of removing trailing newlines from the results.
</p>
</div>
</div>
<div id="outline-container-orgf495c4e" class="outline-3">
<h3 id="orgf495c4e"><span class="section-number-3">2.18.</span> xargs</h3>
<div class="outline-text-3" id="text-2-18">
<ul class="org-ul">
<li>-0, &#x2013;null - Input items are terminated by a null character instead of by whitespace - file or directory
names containing spaces or newlines are correctly handled</li>
<li></li>


<li>transfer input to one line usable as arguments (default echo)</li>
<li>xargs -n 2 # execute command for every two argument, ex diff</li>
</ul>

<p>
ex
</p>
<ul class="org-ul">
<li>find /path -name '*.foo' | xargs -P 24 -I '{}' /cpu/bound/process '{}' -o '{}'.out
<ul class="org-ul">
<li>-P n - Run up to max-procs processes at a time</li>
</ul></li>
<li>cat lines | xargs | tr ' ' ',' =&gt; line1,line2,line3,line4</li>
</ul>
</div>
</div>
<div id="outline-container-orgdefccb7" class="outline-3">
<h3 id="orgdefccb7"><span class="section-number-3">2.19.</span> history save with time</h3>
<div class="outline-text-3" id="text-2-19">
<p>
with timestamp
echo 'export HISTTIMEFORMAT="%d/%m/%y %T "' &gt;&gt; ~/.bash<sub>profile</sub>
</p>
</div>
</div>

<div id="outline-container-orgc1d6388" class="outline-3">
<h3 id="orgc1d6388"><span class="section-number-3">2.20.</span> id -u user</h3>
<div class="outline-text-3" id="text-2-20">
<p>
get user id
</p>
</div>
</div>
<div id="outline-container-org686a4bb" class="outline-3">
<h3 id="org686a4bb"><span class="section-number-3">2.21.</span> diff</h3>
<div class="outline-text-3" id="text-2-21">
<p>
<a href="https://www.math.utah.edu/docs/info/diff_3.html">https://www.math.utah.edu/docs/info/diff_3.html</a>
</p>

<ul class="org-ul">
<li>default</li>
<li>“Copied” context with -c</li>
<li>“Unified” context with -u Instead of displaying the two files separately, it merges them together.</li>
</ul>

<p>
diff one two
</p>

<p>
Default context - no longer widely used (used by git)
</p>
<ul class="org-ul">
<li>`8a12,15' (lar) - after line 8 of one append lines 12-15 of two.</li>
<li>'5,7c8,10' (fct) - change lines 5&#x2013;7 of one to read as lines 8&#x2013;10 of two</li>
<li>`5,7d3' (rdl) - delete lines 5&#x2013;7 of one (which at 3 in two)</li>
<li>&lt; - in one</li>
<li>&gt; - in two</li>
</ul>

<p>
“Copied” context - has context lines without pre-symbols
</p>
<ul class="org-ul">
<li>'!' - changing like</li>
<li>'+' - line of two file (nothin in one)</li>
<li>'-' - line of one file (nothin in two)</li>
</ul>

<p>
“Unified” context - more compact because it omits redundant context lines. GNU patch can apply this format.
</p>
<ul class="org-ul">
<li><b>*</b> from-file from-file-modification-time</li>
<li>&#x2014; to-file to-file-modification time</li>
<li>@@ from-file-range to-file-range @@</li>
<li>'+' line of two file</li>
<li>'-' line of one file</li>
</ul>

<p>
Differences Side by Side diff -y :
</p>
<ul class="org-ul">
<li>`|'    The corresponding lines differ, and they are either both complete or both incomplete.</li>
<li>`&lt;'    The files differ and only the first file contains the line.</li>
<li>`&gt;'    The files differ and only the second file contains the line.</li>
<li>`('    Only the first file contains the line, but the difference is ignored.</li>
<li>`)'    Only the second file contains the line, but the difference is ignored.</li>
<li>`\'    The corresponding lines differ, and only the first line is incomplete.</li>
<li>`/'    The corresponding lines differ, and only the second line is incomplete.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd83a06" class="outline-3">
<h3 id="orgdd83a06"><span class="section-number-3">2.22.</span> date</h3>
<div class="outline-text-3" id="text-2-22">
<ul class="org-ul">
<li>date +%c &#x2013;date "2022-06-20" =&gt; Mon Jun 20 00:00:00 2022</li>
<li>date +%F &#x2013;date='@2147483647' =&gt; 2038-01-19</li>
<li>date &#x2013;date '06/02/2016 09:01:39' +"%s" =&gt; 1464872499</li>
<li>date +%s =&gt; 1656480511</li>
</ul>
</div>
</div>
<div id="outline-container-org0911f8e" class="outline-3">
<h3 id="org0911f8e"><span class="section-number-3">2.23.</span> ps <a id="org35a0895"></a></h3>
<div class="outline-text-3" id="text-2-23">
<p>
<a href="https://www.computernetworkingnotes.com/linux-tutorials/ps-aux-command-and-ps-command-explained.html">https://www.computernetworkingnotes.com/linux-tutorials/ps-aux-command-and-ps-command-explained.html</a>
</p>

<p>
a:- This option prints the running processes from all users.
u:- This option shows user or owner column in output.
x:- This option prints the processes those have not been executed from the terminal.
</p>

<p>
ps –eo pid,user,%cpu,cmd –-sort=-%cpu | head –n 4
ps –A &#x2013;forest
</p>

<p>
notes:
</p>
<ul class="org-ul">
<li>CPU usage is expressed as the percentage of time spent running during the entire lifetime of a process.</li>
<li>The SIZE and RSS fields don't count some parts of a process including the page tables, kernel stack, struct thread<sub>info</sub>, and struct task<sub>struct</sub>.</li>
<li>SIZE is the virtual size of the process (code+data+stack).</li>
<li>Processes marked &lt;defunct&gt; are dead processes (so-called "zombies") that remain because their parent has not destroyed them properly.</li>
<li>If the length of the username is greater than the length of the display column, the username will be truncated.</li>
</ul>

<p>
PID of the bash script you can use variable $$
</p>
</div>
