sources_org/shell.org
*** Column	Description
USER 	The user account under which this process is running
PID	Process ID of this process
%CPU	CPU time used by this process (in percentage).
%MEM	Physical memory used by this process (in percentage).
VSZ	Virtual memory used by this process (in bytes).
RSS	Resident Set Size, the non-swappable physical memory used by this process (in KiB)
TTY	Terminal from which this process is started. Question mark (?) sign represents that this process is not started from a terminal.
STAT	Process state. Explained in next table.
START	Starting time and date of this process
TIME	Total CPU time used by this process
COMMAND	The command with all its arguments which started this process

*** stat code with description
D	uninterruptible sleep (usually IO)
R	running or runnable (on run queue)
S	interruptible sleep (waiting for an event to complete)
T	stopped by job control signal
t	stopped by debugger during the tracing
w	paging (not valid since the 2.6.xx kernel)
x	dead (should never be seen)
Z	defunct ("zombie") process, terminated but not reaped by its parent
< 	high-priority (not nice to other users)
N	low-priority (nice to other users)
L	has pages locked into memory (for real-time and custom IO)
s	is a session leader
l	is multi-threaded (using CLONE_THREAD, like NPTL pthreads do)
+	is in the foreground process group
** top <<top>>
include *uptime* command
: top -d 0.5 # faster
: cat /proc/loadavg

sort:
- ps -o RES
- ps -o +%MEM
- f - Field manager
  - s -  current sort field,
  - q - quit

control:
- ? - help
- parent-child - V key
- kill: press k and enter PID
- bold/colur - b/z
- renice - r
- </> - sort by column

memory:
- %MEM: The percentage of the system’s physical memory in use by this process
- VIRT: Virtual memory size
- RES: Resident set size: the total physical memory in use by this process


sort by VIRT memory
: for i in {1..10};do date; top -b -o +VIRT | head -n 17|tail -11;sleep 5;done
*** view description
first row:
- current time (22 :14:26)
- uptime of the machine (up 155 day, 16:33)
- users sessions logged in (2 users)
- average load: 1, 5, 15 - exponentially-damped moving sums of a five second average

second row:
- Total Processes running (866 total)
- Running Processes (8 running)
- Sleeping Processes (856 sleeping)
- Stopped Processes (0 stopped)

CPU line: sum up all the percentages the total will be 100% of the cpu
- us, user    : time running un-niced user processes in percentage(18.6%us)
- sy, system  : time running kernel processes
- ni, nice    : time running niced user processes
- id, idle    : time spent in the kernel idle handler
- wa, IO-wait : time waiting for I/O completion
- hi : time spent servicing hardware interrupts
- si : time spent servicing software interrupts
- st : time stolen from this vm by the hypervisor

processes
- PID – ID of the process(819328)
- USER – The user that is the owner of the process (root)
- PR – priority of the process (20)
- NI – The “NICE” value of the process (0)
- VIRT – virtual memory used by the process (3423m)
- RES – physical memory used from the process (3.3g)
- SHR – shared memory of the process (1788)
- S – indicates the status of the process: S=sleep R=running Z=zombie (S)
- %CPU – This is the percentage of CPU used by this process (65.9)
- %MEM – This is the percentage of RAM used by the process (5.2)
- TIME+ –This is the total time of activity of this process (1363:48)
- COMMAND – And this is the name of the process (exim)

** pgrep
get all processed by name and kill them
: pgrep python | xargs kill -s 9
** vmstat
 https://www.howtogeek.com/425232/how-to-securely-delete-files-on-linux/


Since last reboot

vmstat 2 -d -S M
- 2 sec recreate
-


- -a - active and inactive memory
- -f -  shows the number of tasks that have been launched
- -d - disk
- -D - summary statistics for your disk activity
- -p sda1
** pmap
report memory map of a process
: pmap -x $(pidof bash | cut -d ' ' -f 1) | head -n-2 | tail -n+3 | grep -v deleted | sort -k2 -n | awk '{sum+=$2} END {print sum/1024 " MiB"}'
** find
find files by name and execute command:
- find . -type f -name "*.txt" -exec ls -l {} +
- find . -type f -name "*.txt" | xargs ls -l
- find . -type f -name "*.txt" -exec mv {} {}.old \;
multiple file extensions:
- find . -type f \( -name "*.sh" -o -name "*.txt" \)
find directory:
- find . -type d -iname So* -ls
  - -ls - print in ls -al format
*** find [options] [starting-point...] [ex‐pression]
expressions:
- TESTS:
  - -amin n File was last accessed less than, more than or exactly n minutes ago.
  - -empty File is empty and is either a regular file or a directory.
  - -executable Matches  files  which  are  executable
  - -group gname File belongs to group gname (numeric group ID allowed).
  - -iname pattern  Like -name, but the match is case insensitive.
  - -name pattern  Base of file name
  - -links n  has less than, more than or exactly n hard links.
  - -nouser No user corresponds to file's numeric user ID.
  - -perm -a+r,u+w
  - -readable  Matches  files  which  are  readable  by the current user.
  - -size 2M
  - -type c
    - b      block (buffered) special
    - c      character (unbuffered) special
    - d      directory
    - p      named pipe (FIFO)
    - f      regular file
    - l      symbolic link;
    - s      socket
    - D      door (Solaris)
  - -user uname File is owned by user uname (numeric user ID allowed).
- ACTION
  - -delete
  - exec command ;
  - -print full file name
  - -quit exit

when {} used - at the end must be:
- + - result: ls -l file1 file2 file3
- \; -  {} may be used more than once in the same exec statement, result: ls -l file1, ls -l file2

*** links
https://www.howtogeek.com/425408/how-to-use-all-linuxs-search-commands/

** dd
