shell.html
<div id="outline-container-orgb13eb93" class="outline-4">
<h4 id="orgb13eb93"><span class="section-number-4">2.23.1.</span> Column	Description</h4>
<div class="outline-text-4" id="text-2-23-1">
<p>
USER 	The user account under which this process is running
PID	Process ID of this process
%CPU	CPU time used by this process (in percentage).
%MEM	Physical memory used by this process (in percentage).
VSZ	Virtual memory used by this process (in bytes).
RSS	Resident Set Size, the non-swappable physical memory used by this process (in KiB)
TTY	Terminal from which this process is started. Question mark (?) sign represents that this process is not started from a terminal.
STAT	Process state. Explained in next table.
START	Starting time and date of this process
TIME	Total CPU time used by this process
COMMAND	The command with all its arguments which started this process
</p>
</div>
</div>

<div id="outline-container-orga00db97" class="outline-4">
<h4 id="orga00db97"><span class="section-number-4">2.23.2.</span> stat code with description</h4>
<div class="outline-text-4" id="text-2-23-2">
<p>
D	uninterruptible sleep (usually IO)
R	running or runnable (on run queue)
S	interruptible sleep (waiting for an event to complete)
T	stopped by job control signal
t	stopped by debugger during the tracing
w	paging (not valid since the 2.6.xx kernel)
x	dead (should never be seen)
Z	defunct ("zombie") process, terminated but not reaped by its parent
&lt; 	high-priority (not nice to other users)
N	low-priority (nice to other users)
L	has pages locked into memory (for real-time and custom IO)
s	is a session leader
l	is multi-threaded (using CLONE<sub>THREAD</sub>, like NPTL pthreads do)
</p>
<ul class="org-ul">
<li>is in the foreground process group</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf56289e" class="outline-3">
<h3 id="orgf56289e"><span class="section-number-3">2.24.</span> top <a id="orgddc6097"></a></h3>
<div class="outline-text-3" id="text-2-24">
<p>
include <b>uptime</b> command
</p>
<pre class="example">
top -d 0.5 # faster
cat /proc/loadavg
</pre>


<p>
sort:
</p>
<ul class="org-ul">
<li>ps -o RES</li>
<li>ps -o +%MEM</li>
<li>f - Field manager
<ul class="org-ul">
<li>s -  current sort field,</li>
<li>q - quit</li>
</ul></li>
</ul>

<p>
control:
</p>
<ul class="org-ul">
<li>? - help</li>
<li>parent-child - V key</li>
<li>kill: press k and enter PID</li>
<li>bold/colur - b/z</li>
<li>renice - r</li>
<li>&lt;/&gt; - sort by column</li>
</ul>

<p>
memory:
</p>
<ul class="org-ul">
<li>%MEM: The percentage of the system’s physical memory in use by this process</li>
<li>VIRT: Virtual memory size</li>
<li>RES: Resident set size: the total physical memory in use by this process</li>
</ul>


<p>
sort by VIRT memory
</p>
<pre class="example">
for i in {1..10};do date; top -b -o +VIRT | head -n 17|tail -11;sleep 5;done
</pre>
</div>
<div id="outline-container-orgbb89ca5" class="outline-4">
<h4 id="orgbb89ca5"><span class="section-number-4">2.24.1.</span> view description</h4>
<div class="outline-text-4" id="text-2-24-1">
<p>
first row:
</p>
<ul class="org-ul">
<li>current time (22 :14:26)</li>
<li>uptime of the machine (up 155 day, 16:33)</li>
<li>users sessions logged in (2 users)</li>
<li>average load: 1, 5, 15 - exponentially-damped moving sums of a five second average</li>
</ul>

<p>
second row:
</p>
<ul class="org-ul">
<li>Total Processes running (866 total)</li>
<li>Running Processes (8 running)</li>
<li>Sleeping Processes (856 sleeping)</li>
<li>Stopped Processes (0 stopped)</li>
</ul>

<p>
CPU line: sum up all the percentages the total will be 100% of the cpu
</p>
<ul class="org-ul">
<li>us, user    : time running un-niced user processes in percentage(18.6%us)</li>
<li>sy, system  : time running kernel processes</li>
<li>ni, nice    : time running niced user processes</li>
<li>id, idle    : time spent in the kernel idle handler</li>
<li>wa, IO-wait : time waiting for I/O completion</li>
<li>hi : time spent servicing hardware interrupts</li>
<li>si : time spent servicing software interrupts</li>
<li>st : time stolen from this vm by the hypervisor</li>
</ul>

<p>
processes
</p>
<ul class="org-ul">
<li>PID – ID of the process(819328)</li>
<li>USER – The user that is the owner of the process (root)</li>
<li>PR – priority of the process (20)</li>
<li>NI – The “NICE” value of the process (0)</li>
<li>VIRT – virtual memory used by the process (3423m)</li>
<li>RES – physical memory used from the process (3.3g)</li>
<li>SHR – shared memory of the process (1788)</li>
<li>S – indicates the status of the process: S=sleep R=running Z=zombie (S)</li>
<li>%CPU – This is the percentage of CPU used by this process (65.9)</li>
<li>%MEM – This is the percentage of RAM used by the process (5.2)</li>
<li>TIME+ –This is the total time of activity of this process (1363:48)</li>
<li>COMMAND – And this is the name of the process (exim)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org17ea2a7" class="outline-3">
<h3 id="org17ea2a7"><span class="section-number-3">2.25.</span> pgrep</h3>
<div class="outline-text-3" id="text-2-25">
<p>
get all processed by name and kill them
</p>
<pre class="example">
pgrep python | xargs kill -s 9
</pre>
</div>
</div>
<div id="outline-container-org972fb99" class="outline-3">
<h3 id="org972fb99"><span class="section-number-3">2.26.</span> vmstat</h3>
<div class="outline-text-3" id="text-2-26">
<p>
<a href="https://www.howtogeek.com/425232/how-to-securely-delete-files-on-linux/">https://www.howtogeek.com/425232/how-to-securely-delete-files-on-linux/</a>
</p>


<p>
Since last reboot
</p>

<p>
vmstat 2 -d -S M
</p>
<ul class="org-ul">
<li>2 sec recreate</li>
<li></li>
</ul>


<ul class="org-ul">
<li>-a - active and inactive memory</li>
<li>-f -  shows the number of tasks that have been launched</li>
<li>-d - disk</li>
<li>-D - summary statistics for your disk activity</li>
<li>-p sda1</li>
</ul>
</div>
</div>
<div id="outline-container-orgf573286" class="outline-3">
<h3 id="orgf573286"><span class="section-number-3">2.27.</span> pmap</h3>
<div class="outline-text-3" id="text-2-27">
<p>
report memory map of a process
</p>
<pre class="example">
pmap -x $(pidof bash | cut -d ' ' -f 1) | head -n-2 | tail -n+3 | grep -v deleted | sort -k2 -n | awk '{sum+=$2} END {print sum/1024 " MiB"}'
</pre>
</div>
</div>
<div id="outline-container-org78bddcb" class="outline-3">
<h3 id="org78bddcb"><span class="section-number-3">2.28.</span> find</h3>
<div class="outline-text-3" id="text-2-28">
<p>
find files by name and execute command:
</p>
<ul class="org-ul">
<li>find . -type f -name "*.txt" -exec ls -l {} +</li>
<li>find . -type f -name "*.txt" | xargs ls -l</li>
<li>find . -type f -name "*.txt" -exec mv {} {}.old \;</li>
</ul>
<p>
multiple file extensions:
</p>
<ul class="org-ul">
<li>find . -type f \( -name "*.sh" -o -name "*.txt" \)</li>
</ul>
<p>
find directory:
</p>
<ul class="org-ul">
<li>find . -type d -iname So* -ls
<ul class="org-ul">
<li>-ls - print in ls -al format</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org9ffe2c2" class="outline-4">
<h4 id="org9ffe2c2"><span class="section-number-4">2.28.1.</span> find [options] [starting-point&#x2026;] [ex‐pression]</h4>
<div class="outline-text-4" id="text-2-28-1">
<p>
expressions:
</p>
<ul class="org-ul">
<li>TESTS:
<ul class="org-ul">
<li>-amin n File was last accessed less than, more than or exactly n minutes ago.</li>
<li>-empty File is empty and is either a regular file or a directory.</li>
<li>-executable Matches  files  which  are  executable</li>
<li>-group gname File belongs to group gname (numeric group ID allowed).</li>
<li>-iname pattern  Like -name, but the match is case insensitive.</li>
<li>-name pattern  Base of file name</li>
<li>-links n  has less than, more than or exactly n hard links.</li>
<li>-nouser No user corresponds to file's numeric user ID.</li>
<li>-perm -a+r,u+w</li>
<li>-readable  Matches  files  which  are  readable  by the current user.</li>
<li>-size 2M</li>
<li>-type c
<ul class="org-ul">
<li>b      block (buffered) special</li>
<li>c      character (unbuffered) special</li>
<li>d      directory</li>
<li>p      named pipe (FIFO)</li>
<li>f      regular file</li>
<li>l      symbolic link;</li>
<li>s      socket</li>
<li>D      door (Solaris)</li>
</ul></li>
<li>-user uname File is owned by user uname (numeric user ID allowed).</li>
</ul></li>
<li>ACTION
<ul class="org-ul">
<li>-delete</li>
<li>exec command ;</li>
<li>-print full file name</li>
<li>-quit exit</li>
</ul></li>
</ul>

<p>
when {} used - at the end must be:
</p>
<ul class="org-ul">
<li>+ - result: ls -l file1 file2 file3</li>
<li>\; -  {} may be used more than once in the same exec statement, result: ls -l file1, ls -l file2</li>
</ul>
</div>
</div>

<div id="outline-container-org8c2d212" class="outline-4">
<h4 id="org8c2d212"><span class="section-number-4">2.28.2.</span> links</h4>
<div class="outline-text-4" id="text-2-28-2">
<p>
<a href="https://www.howtogeek.com/425408/how-to-use-all-linuxs-search-commands/">https://www.howtogeek.com/425408/how-to-use-all-linuxs-search-commands/</a>
</p>
</div>
</div>
</div>
