sources_org/shell.org
*** usecases
create:
dd if=/dev/zero of=test.img bs=1 count 0 seek=10G

resize +2G:
e2fsck -f test.img
resize2fs test.img 12G
e2fsck -f test.img


---
Iso Disk write:
cdrecord dev=0,0,0 -eject -dao debian-testing-amd64-xfce-CD-1.iso

# flash gentoo iso to USB
dd if=/a.iso of=/dev/sdc bs=8192k

# flash tails to USB
dd if=tails.img of=/dev/sda bs=16M oflag=direct status=progress

# flash ISO Gentoo to HDDD
dd if=gentoo.iso of=/dev/sda bs=4M oflag=direct status=progress

# Clone disk partition using dd over SSH
dd bs=16M if=/dev/sda3 | ssh root@serverB "dd bs=16M of=/dev/sda3"
*** bs
read and write up to BYTES bytes at a time (default: 512); overrides ibs and obs

**** block size theory
Block devices and block sizes
- For example hard disks, cdrom drives and floppies are block devices, but not the keyboard.
- file system needs to split up a partition into blocks to store files and file parts (another block size)
- Most hard drives shipped with 512 byte sector/block sizes.


Logical and Physical Sector Size
- Advanced Format, same as 4K sector technology, uses the storage surface media more efficiently by combining
data that would have been stored in eight 512-byte sectors into one single sector that is 4096 bytes (4 KiB)
in length.
- any data transfers between the disk and the computer still use the common 512-byte block size.
- the disk is addressable in 512-byte blocks, but performance will be better if the OS arranges the disk
  operations to take into account the 4096-byte internal block size.

filesystem block size:
- tune2fs -l /dev/sdb2
- file -s /dev/sda1
- stat -fc %s .
- blockdev --getbsz /dev/sda # change when mounted

Kernel block size
- All linux blocks are currently 1024 bytes.

https://www.baeldung.com/linux/dd-optimal-blocksize
*** cteate disk
dd if=/dev/zero of=/mnt/sda5/tdisk.img bs=1 seek=40G count=1
Discarding device blocks:     4096/10485760                 done
Creating filesystem with 10485760 4k blocks and 2621440 inodes
Filesystem UUID: 351a17dd-246d-49f5-b871-dde0cf38c1c4
Superblock backups stored on blocks:
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208,
	4096000, 7962624

Allocating group tables:   0/320       done
Writing inode tables:   0/320       done
Creating journal (65536 blocks): done
Writing superblocks and filesystem accounting information:   0/320       done

mkfs.ext4 tdisk.img


.
** access control to files
- lsattr
- chattr
- chmod
- chown
- stat
** for external storages
- lsblk -p - list block devices, find connected USB Flash
- parted - partition table
  - parted -l  - list partitions on all disks
- fdisk - partition table
  - fdisk -l
- dd
  - status=progress - useful to see what's happening
- sync - Synchronize cached writes to persistent storagem, when u write to USB

** filesystem block size
- tune2fs -l /dev/sdb2
- file -s /dev/sda1
- stat -fc %s .
- blockdev --getbsz /dev/sda # change when mounted

** tar
tar.gz:
- crate: tar -czf a.tar.gz /
- extract: tar xpzf  --xattrs-include=' *.*' --numeric-owner a.tar.gz
  - -p, --preserve-permissions (default for supe ruser)
- inspect: tar ztf/tf m.tar.gz/m.tar
- create from files: tar --totals -cvf a.tar file1 file2 file3

common archives and commands to extract
- .tar 	-xvf
- .tar.gz	-xvzf
- .tar.bz2	-xvjf
- .tar.xz	-xJf
- .tar.lzma	-xlf
- .tar.lzo	-xlOf
- .tar.zst	-xIf

** compression
TOP for texts:
- 7z - LZMA compression algorithm
- xz
- bzip2 - BWT
- rar
- gzip - LZ77
- zip

TOP for mixed:
- rar
- 7z
- zip
- bzip2
- gzip

my for texts 518MB :
- time tar.xz - real	1m49.582s, user	1m50.062s - 44M
- time tar.7z - real	0m55.497s, user	1m43.210s - 44M
- time tar.bz2 - real	0m33.160s, user	0m31.348s - 48M
- time tar.gz - real	0m10.430s, user	0m8.876s - 59M

texts < 14370 chars:
: cat file  | gzip -f - |base64 | base64 -d | gzip -d -
for text > 14370 chars:
: cat file  | bzip2 |base64 | base64 -d | bzip2 -d
*** tar.7z
compress:
: tar cf - <source folder> | 7z a -si <Destination archive>.tar.7z
decompress
: 7z x -so yourfile.tar.7z | tar xf - -C target_dir
*** zip
create:
- zip a f	# creat a.zip with f file
- zip -r a f	# creat a.zip with with f folder and all it's files
-

inspect archive: unzip -l a.zip

extract:
- unzip test_archive.zip -d ./Music

**** zip chunks/multi-part/split
to chunks:
- zip -r -s <size in megabytes>M <new_file>.zip <folder>/*
to single archive (myfiles.z01, myfiles.z02, myfiles.z03):
- zip -F myfiles.zip --out single-archive.zip
decompress:
- All parts must be concatenated together in order, and then ``zip -F'' (for zip 2.x) or ``zip -FF'' (for zip
  3.x) must be performed on the concatenated archive in order to ``fix'' it
- unzip -l - list archive files
*** links
- https://www.mattmahoney.net/dc/text.html
- https://www.mattmahoney.net/dc/10gb.html
** curl
- proxy support
- user authentication
- ftp upload
- SSL connections
- cookies
- file transfer resume and more

*** SOCKS5 proxy
- curl -x socks5h://localhost:8080 api.ipify.org

*** mimic browser request:
- curl --http0.9 -vvv -H "Accept: application/xml" -A "Mozilla" http://a.ru
