shell.html

<div id="outline-container-orgc9ff91d" class="outline-3">
<h3 id="orgc9ff91d"><span class="section-number-3">2.29.</span> dd</h3>
<div class="outline-text-3" id="text-2-29">
</div>
<div id="outline-container-org1ad68c0" class="outline-4">
<h4 id="org1ad68c0"><span class="section-number-4">2.29.1.</span> usecases</h4>
<div class="outline-text-4" id="text-2-29-1">
<p>
create:
dd if=/dev/zero of=test.img bs=1 count 0 seek=10G
</p>

<p>
resize +2G:
e2fsck -f test.img
resize2fs test.img 12G
e2fsck -f test.img
</p>


<p>
&#x2014;
Iso Disk write:
cdrecord dev=0,0,0 -eject -dao debian-testing-amd64-xfce-CD-1.iso
</p>

<p>
dd if=/a.iso of=/dev/sdc bs=8192k
</p>

<p>
dd if=tails.img of=/dev/sda bs=16M oflag=direct status=progress
</p>

<p>
dd if=gentoo.iso of=/dev/sda bs=4M oflag=direct status=progress
</p>

<p>
dd bs=16M if=/dev/sda3 | ssh root@serverB "dd bs=16M of=/dev/sda3"
</p>
</div>
</div>
<div id="outline-container-orgcd1afcc" class="outline-4">
<h4 id="orgcd1afcc"><span class="section-number-4">2.29.2.</span> bs</h4>
<div class="outline-text-4" id="text-2-29-2">
<p>
read and write up to BYTES bytes at a time (default: 512); overrides ibs and obs
</p>
</div>

<ol class="org-ol">
<li><a id="org3a07281"></a>block size theory<br />
<div class="outline-text-5" id="text-2-29-2-1">
<p>
Block devices and block sizes
</p>
<ul class="org-ul">
<li>For example hard disks, cdrom drives and floppies are block devices, but not the keyboard.</li>
<li>file system needs to split up a partition into blocks to store files and file parts (another block size)</li>
<li>Most hard drives shipped with 512 byte sector/block sizes.</li>
</ul>


<p>
Logical and Physical Sector Size
</p>
<ul class="org-ul">
<li>Advanced Format, same as 4K sector technology, uses the storage surface media more efficiently by combining</li>
</ul>
<p>
data that would have been stored in eight 512-byte sectors into one single sector that is 4096 bytes (4 KiB)
in length.
</p>
<ul class="org-ul">
<li>any data transfers between the disk and the computer still use the common 512-byte block size.</li>
<li>the disk is addressable in 512-byte blocks, but performance will be better if the OS arranges the disk
operations to take into account the 4096-byte internal block size.</li>
</ul>

<p>
filesystem block size:
</p>
<ul class="org-ul">
<li>tune2fs -l /dev/sdb2</li>
<li>file -s /dev/sda1</li>
<li>stat -fc %s .</li>
<li>blockdev &#x2013;getbsz /dev/sda # change when mounted</li>
</ul>

<p>
Kernel block size
</p>
<ul class="org-ul">
<li>All linux blocks are currently 1024 bytes.</li>
</ul>

<p>
<a href="https://www.baeldung.com/linux/dd-optimal-blocksize">https://www.baeldung.com/linux/dd-optimal-blocksize</a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org5699861" class="outline-4">
<h4 id="org5699861"><span class="section-number-4">2.29.3.</span> cteate disk</h4>
<div class="outline-text-4" id="text-2-29-3">
<p>
dd if=/dev/zero of=/mnt/sda5/tdisk.img bs=1 seek=40G count=1
Discarding device blocks:     4096/10485760                 done
Creating filesystem with 10485760 4k blocks and 2621440 inodes
Filesystem UUID: 351a17dd-246d-49f5-b871-dde0cf38c1c4
Superblock backups stored on blocks:
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208,
	4096000, 7962624
</p>

<p>
Allocating group tables:   0/320       done
Writing inode tables:   0/320       done
Creating journal (65536 blocks): done
Writing superblocks and filesystem accounting information:   0/320       done
</p>

<p>
mkfs.ext4 tdisk.img
</p>


<p>
.
</p>
</div>
</div>
</div>
<div id="outline-container-org7228bd5" class="outline-3">
<h3 id="org7228bd5"><span class="section-number-3">2.30.</span> access control to files</h3>
<div class="outline-text-3" id="text-2-30">
<ul class="org-ul">
<li>lsattr</li>
<li>chattr</li>
<li>chmod</li>
<li>chown</li>
<li>stat</li>
</ul>
</div>
</div>
<div id="outline-container-org8b22236" class="outline-3">
<h3 id="org8b22236"><span class="section-number-3">2.31.</span> for external storages</h3>
<div class="outline-text-3" id="text-2-31">
<ul class="org-ul">
<li>lsblk -p - list block devices, find connected USB Flash</li>
<li>parted - partition table
<ul class="org-ul">
<li>parted -l  - list partitions on all disks</li>
</ul></li>
<li>fdisk - partition table
<ul class="org-ul">
<li>fdisk -l</li>
</ul></li>
<li>dd
<ul class="org-ul">
<li>status=progress - useful to see what's happening</li>
</ul></li>
<li>sync - Synchronize cached writes to persistent storagem, when u write to USB</li>
</ul>
</div>
</div>

<div id="outline-container-orgb93638b" class="outline-3">
<h3 id="orgb93638b"><span class="section-number-3">2.32.</span> filesystem block size</h3>
<div class="outline-text-3" id="text-2-32">
<ul class="org-ul">
<li>tune2fs -l /dev/sdb2</li>
<li>file -s /dev/sda1</li>
<li>stat -fc %s .</li>
<li>blockdev &#x2013;getbsz /dev/sda # change when mounted</li>
</ul>
</div>
</div>

<div id="outline-container-org0f496f3" class="outline-3">
<h3 id="org0f496f3"><span class="section-number-3">2.33.</span> tar</h3>
<div class="outline-text-3" id="text-2-33">
<p>
tar.gz:
</p>
<ul class="org-ul">
<li>crate: tar -czf a.tar.gz /</li>
<li>extract: tar xpzf  &#x2013;xattrs-include=' <b>.</b>' &#x2013;numeric-owner a.tar.gz
<ul class="org-ul">
<li>-p, &#x2013;preserve-permissions (default for supe ruser)</li>
</ul></li>
<li>inspect: tar ztf/tf m.tar.gz/m.tar</li>
<li>create from files: tar &#x2013;totals -cvf a.tar file1 file2 file3</li>
</ul>

<p>
common archives and commands to extract
</p>
<ul class="org-ul">
<li>.tar 	-xvf</li>
<li>.tar.gz	-xvzf</li>
<li>.tar.bz2	-xvjf</li>
<li>.tar.xz	-xJf</li>
<li>.tar.lzma	-xlf</li>
<li>.tar.lzo	-xlOf</li>
<li>.tar.zst	-xIf</li>
</ul>
</div>
</div>

<div id="outline-container-orgf53b46f" class="outline-3">
<h3 id="orgf53b46f"><span class="section-number-3">2.34.</span> compression</h3>
<div class="outline-text-3" id="text-2-34">
<p>
TOP for texts:
</p>
<ul class="org-ul">
<li>7z - LZMA compression algorithm</li>
<li>xz</li>
<li>bzip2 - BWT</li>
<li>rar</li>
<li>gzip - LZ77</li>
<li>zip</li>
</ul>

<p>
TOP for mixed:
</p>
<ul class="org-ul">
<li>rar</li>
<li>7z</li>
<li>zip</li>
<li>bzip2</li>
<li>gzip</li>
</ul>

<p>
my for texts 518MB :
</p>
<ul class="org-ul">
<li>time tar.xz - real	1m49.582s, user	1m50.062s - 44M</li>
<li>time tar.7z - real	0m55.497s, user	1m43.210s - 44M</li>
<li>time tar.bz2 - real	0m33.160s, user	0m31.348s - 48M</li>
<li>time tar.gz - real	0m10.430s, user	0m8.876s - 59M</li>
</ul>

<p>
texts &lt; 14370 chars:
</p>
<pre class="example">
cat file  | gzip -f - |base64 | base64 -d | gzip -d -
</pre>

<p>
for text &gt; 14370 chars:
</p>
<pre class="example">
cat file  | bzip2 |base64 | base64 -d | bzip2 -d
</pre>
</div>
<div id="outline-container-orgb7f786b" class="outline-4">
<h4 id="orgb7f786b"><span class="section-number-4">2.34.1.</span> tar.7z</h4>
<div class="outline-text-4" id="text-2-34-1">
<p>
compress:
</p>
<pre class="example">
tar cf - &lt;source folder&gt; | 7z a -si &lt;Destination archive&gt;.tar.7z
</pre>

<p>
decompress
</p>
<pre class="example">
7z x -so yourfile.tar.7z | tar xf - -C target_dir
</pre>
</div>
</div>
<div id="outline-container-orgb0e0cb6" class="outline-4">
<h4 id="orgb0e0cb6"><span class="section-number-4">2.34.2.</span> zip</h4>
<div class="outline-text-4" id="text-2-34-2">
<p>
create:
</p>
<ul class="org-ul">
<li>zip a f	# creat a.zip with f file</li>
<li>zip -r a f	# creat a.zip with with f folder and all it's files</li>
<li></li>
</ul>

<p>
inspect archive: unzip -l a.zip
</p>

<p>
extract:
</p>
<ul class="org-ul">
<li>unzip test<sub>archive.zip</sub> -d ./Music</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgd8528a9"></a>zip chunks/multi-part/split<br />
<div class="outline-text-5" id="text-2-34-2-1">
<p>
to chunks:
</p>
<ul class="org-ul">
<li>zip -r -s &lt;size in megabytes&gt;M &lt;new<sub>file</sub>&gt;.zip &lt;folder&gt;/*</li>
</ul>
<p>
to single archive (myfiles.z01, myfiles.z02, myfiles.z03):
</p>
<ul class="org-ul">
<li>zip -F myfiles.zip &#x2013;out single-archive.zip</li>
</ul>
<p>
decompress:
</p>
<ul class="org-ul">
<li>All parts must be concatenated together in order, and then ``zip -F'' (for zip 2.x) or ``zip -FF'' (for zip
3.x) must be performed on the concatenated archive in order to ``fix'' it</li>
<li>unzip -l - list archive files</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org21e7aa4" class="outline-4">
<h4 id="org21e7aa4"><span class="section-number-4">2.34.3.</span> links</h4>
<div class="outline-text-4" id="text-2-34-3">
<ul class="org-ul">
<li><a href="https://www.mattmahoney.net/dc/text.html">https://www.mattmahoney.net/dc/text.html</a></li>
<li><a href="https://www.mattmahoney.net/dc/10gb.html">https://www.mattmahoney.net/dc/10gb.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc857e9c" class="outline-3">
<h3 id="orgc857e9c"><span class="section-number-3">2.35.</span> curl</h3>
<div class="outline-text-3" id="text-2-35">
<ul class="org-ul">
<li>proxy support</li>
<li>user authentication</li>
<li>ftp upload</li>
<li>SSL connections</li>
<li>cookies</li>
<li>file transfer resume and more</li>
</ul>
</div>

<div id="outline-container-orga0b8295" class="outline-4">
<h4 id="orga0b8295"><span class="section-number-4">2.35.1.</span> SOCKS5 proxy</h4>
<div class="outline-text-4" id="text-2-35-1">
<ul class="org-ul">
<li>curl -x socks5h://localhost:8080 api.ipify.org</li>
</ul>
</div>
</div>

<div id="outline-container-orgc77829c" class="outline-4">
<h4 id="orgc77829c"><span class="section-number-4">2.35.2.</span> mimic browser request:</h4>
<div class="outline-text-4" id="text-2-35-2">
<ul class="org-ul">
<li>curl &#x2013;http0.9 -vvv -H "Accept: application/xml" -A "Mozilla" <a href="http://a.ru">http://a.ru</a></li>
</ul>
</div>
</div>
