sources_org/shell.org
*** POST GET
POST file:
- curl -X POST -F file1=@/art.jpg http://site.com/api/upload
- curl -i -X POST host:port/post-file  -H "Content-Type: text/xml" --data-binary "@path/to/file"
-

GET
- curl -X GET "http://anonchek.ru/get?id=a43219ce4a4a490d9cd34beb718cb09f" -H  "accept: application/json"
- curl -Gv 'https://geocode-maps.yandex.ru/1.x/?apikey=ba47e54a-61a5-49af-9c84-558d92b35a33&format=json' --data-urlencode 'geocode=Тверская 6'

you cannot really use the -d/--data option if this is not a POST request. But this is still possible if you
 use the -G option.
- curl -X DELETE -G 'http://localhost:5000/locations' -d 'id=3'
-
*** POST paramters
--url-query
- --url-query name=val
- --url-query "+name=%20foo"
- --url-query @fileonly
- --url-query name@file
- --url-query =encodethis

-d
- -d "name=curl" -d "tool=cmdline"
- -d @filename

--data-urlencode - as -d buth with urlencode
- --data-urlencode name=val
- --data-urlencode =encodethis
- -data-urlencode name@file
- --data-urlencode @fileonly

--data-raw - without the special interpretation of the @ character

--data-binary @filename

--data-ascii alias to -d

-I,  --head

-F or --form

-T, --upload-file

*** FTP
upload folder
: find mydir -type f -exec curl -u xxx:psw --ftp-create-dirs -T {} ftp://192.168.1.158/public/demon_test/{} \;
upload file
: curl -g -k -T "Armored Core 4 [BLES00039].iso" ftp://192.168.1.101/dev_hdd0/GAMES/
** du - file space usage
du -h -x -s -- * | sort -r -h | head -20 - biggest files
** man, info, help
*** history
Man pages - UNIX traditional way of distributing documentation about programs.

GNU advocates against the use of man pages at all and contends that complex software systems should have
 complete and comprehensive documentation rather than just a set of short man pages.

help is a built-in command in the bash shell (and that shell only) that documents some of the builtin commands
 and keywords of that shell

*** man
**** terms
convention to the layout of man pages (sections of page): Name, Synopsis, Configuration, Description, Options, ... etc.

page - name of program or function.

pages located in *sections* 1-9. (groups of pages) see: $ man man
- man man.7 or man 7 man or man 'man(7)'
**** arguments
- -a	display all pages, wihtout will exit after displaying the most suitable manual page it finds.
- -aw	print list of exisitng pages
- --wildcard gl* - to use wildcard in term
- --regex gl.*
- -k search -s 3	 list of all man pages which relate to 'search' in section 3
- man -P 'less -p ^EXAMPLES' man	to get EXAMPLES section for man comman
- man tcpdump | less -Ip examples
**** keys
- h		help
- / and ?	search forward/backward
  - n/N	search forward, backward
- Ctrl + k/n	up/down
- u / d	Scroll up/down by half a page
- b / space	Scroll up/down by a page
- highlighting on and off, press Esc+U.
*** info <<info>>
**** info command line arguments
- -a :: get list of all manuals for term
- -k :: look up string in all indices of all manuals
- -d ::
- -O :: command line options for command

**** terms:
- node - page

**** keys:
navigation
- d		directory node - internal mode
- n/p or [/]	next/previous node
- u		up node (level)
- l/r		go back/forward - return from reference
- t		top node

help
- h 		help
- H		Basic info command keys
- q		quit

- C-n/p	next/previous line
- //?		search
  - }/{ or C-x n/p	next/previous
  - R			toggle regex search
- M-/		tree search in current node tree, Global search!
- TAB/S-TAB	next/previous reference
- C-x C-b	list of visiter references with locations of files
- t/T		default - major nodes and detail or full one tree.
- C-x 1	Delete all other windows.
- x		Delete current window.

Backspace or ] - back and up level
space or [ - forward and down

b - top of buffer
1-9 - pick node in menu

< - top page
> - bottom page

l - go back at history
r - go forward at history

i - search for topoc and go to the index

Cross reference - link to another topic
Follow cross reference - just RET or f name_of_reference
f? - get list of references
Tab - scroll references at page (very useful)
l - go back

d - directory

**** search sequence
- d	directory node
- m	Pick a menu item specified by name with completion
- i	Search for a specified string in the index

M-x apropos
** less
man tcpdump | less -Ip examples
- I - IGNORE-CASE
- p - pattern
** date
set time:
  - date +%Y%m%d -s "20220429"
  - date -s "19:35"
epoch to time:
- date -d @1234567890

** tee
append line to file and to STDOUT
: echo "as" | tee -a /etc/fstab
*** freeze problem
tee inside the process substitution will not exit until it gets an eof on its stdin or some error happens.
