shell.html
<div id="outline-container-org2fb931e" class="outline-4">
<h4 id="org2fb931e"><span class="section-number-4">2.35.3.</span> POST GET</h4>
<div class="outline-text-4" id="text-2-35-3">
<p>
POST file:
</p>
<ul class="org-ul">
<li>curl -X POST -F file1=@/art.jpg <a href="http://site.com/api/upload">http://site.com/api/upload</a></li>
<li>curl -i -X POST host:port/post-file  -H "Content-Type: text/xml" &#x2013;data-binary "@path/to/file"</li>
<li></li>
</ul>

<p>
GET
</p>
<ul class="org-ul">
<li>curl -X GET "<a href="http://anonchek.ru/get?id=a43219ce4a4a490d9cd34beb718cb09f">http://anonchek.ru/get?id=a43219ce4a4a490d9cd34beb718cb09f</a>" -H  "accept: application/json"</li>
<li>curl -Gv 'https://geocode-maps.yandex.ru/1.x/?apikey=ba47e54a-61a5-49af-9c84-558d92b35a33&amp;format=json' &#x2013;data-urlencode 'geocode=Тверская 6'</li>
</ul>

<p>
you cannot really use the -d/&#x2013;data option if this is not a POST request. But this is still possible if you
 use the -G option.
</p>
<ul class="org-ul">
<li>curl -X DELETE -G 'http://localhost:5000/locations' -d 'id=3'</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org913f084" class="outline-4">
<h4 id="org913f084"><span class="section-number-4">2.35.4.</span> POST paramters</h4>
<div class="outline-text-4" id="text-2-35-4">
<p>
&#x2013;url-query
</p>
<ul class="org-ul">
<li>&#x2013;url-query name=val</li>
<li>&#x2013;url-query "+name=%20foo"</li>
<li>&#x2013;url-query @fileonly</li>
<li>&#x2013;url-query name@file</li>
<li>&#x2013;url-query =encodethis</li>
</ul>

<p>
-d
</p>
<ul class="org-ul">
<li>-d "name=curl" -d "tool=cmdline"</li>
<li>-d @filename</li>
</ul>

<p>
&#x2013;data-urlencode - as -d buth with urlencode
</p>
<ul class="org-ul">
<li>&#x2013;data-urlencode name=val</li>
<li>&#x2013;data-urlencode =encodethis</li>
<li>-data-urlencode name@file</li>
<li>&#x2013;data-urlencode @fileonly</li>
</ul>

<p>
&#x2013;data-raw - without the special interpretation of the @ character
</p>

<p>
&#x2013;data-binary @filename
</p>

<p>
&#x2013;data-ascii alias to -d
</p>

<p>
-I,  &#x2013;head
</p>

<p>
-F or &#x2013;form
</p>

<p>
-T, &#x2013;upload-file
</p>
</div>
</div>

<div id="outline-container-org5a9c930" class="outline-4">
<h4 id="org5a9c930"><span class="section-number-4">2.35.5.</span> FTP</h4>
<div class="outline-text-4" id="text-2-35-5">
<p>
upload folder
</p>
<pre class="example">
find mydir -type f -exec curl -u xxx:psw --ftp-create-dirs -T {} ftp://192.168.1.158/public/demon_test/{} \;
</pre>

<p>
upload file
</p>
<pre class="example">
curl -g -k -T "Armored Core 4 [BLES00039].iso" ftp://192.168.1.101/dev_hdd0/GAMES/
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5209f2" class="outline-3">
<h3 id="orga5209f2"><span class="section-number-3">2.36.</span> du - file space usage</h3>
<div class="outline-text-3" id="text-2-36">
<p>
du -h -x -s &#x2013; * | sort -r -h | head -20 - biggest files
</p>
</div>
</div>
<div id="outline-container-org6d8355a" class="outline-3">
<h3 id="org6d8355a"><span class="section-number-3">2.37.</span> man, info, help</h3>
<div class="outline-text-3" id="text-2-37">
</div>
<div id="outline-container-orgdb2b7d4" class="outline-4">
<h4 id="orgdb2b7d4"><span class="section-number-4">2.37.1.</span> history</h4>
<div class="outline-text-4" id="text-2-37-1">
<p>
Man pages - UNIX traditional way of distributing documentation about programs.
</p>

<p>
GNU advocates against the use of man pages at all and contends that complex software systems should have
 complete and comprehensive documentation rather than just a set of short man pages.
</p>

<p>
help is a built-in command in the bash shell (and that shell only) that documents some of the builtin commands
 and keywords of that shell
</p>
</div>
</div>

<div id="outline-container-org4f25a95" class="outline-4">
<h4 id="org4f25a95"><span class="section-number-4">2.37.2.</span> man</h4>
<div class="outline-text-4" id="text-2-37-2">
</div>
<ol class="org-ol">
<li><a id="org55bb196"></a>terms<br />
<div class="outline-text-5" id="text-2-37-2-1">
<p>
convention to the layout of man pages (sections of page): Name, Synopsis, Configuration, Description, Options, &#x2026; etc.
</p>

<p>
page - name of program or function.
</p>

<p>
pages located in <b>sections</b> 1-9. (groups of pages) see: $ man man
</p>
<ul class="org-ul">
<li>man man.7 or man 7 man or man 'man(7)'</li>
</ul>
</div>
</li>
<li><a id="org7e7c1c7"></a>arguments<br />
<div class="outline-text-5" id="text-2-37-2-2">
<ul class="org-ul">
<li>-a	display all pages, wihtout will exit after displaying the most suitable manual page it finds.</li>
<li>-aw	print list of exisitng pages</li>
<li>&#x2013;wildcard gl* - to use wildcard in term</li>
<li>&#x2013;regex gl.*</li>
<li>-k search -s 3	 list of all man pages which relate to 'search' in section 3</li>
<li>man -P 'less -p ^EXAMPLES' man	to get EXAMPLES section for man comman</li>
<li>man tcpdump | less -Ip examples</li>
</ul>
</div>
</li>
<li><a id="orga4fc645"></a>keys<br />
<div class="outline-text-5" id="text-2-37-2-3">
<ul class="org-ul">
<li>h		help</li>
<li>/ and ?	search forward/backward
<ul class="org-ul">
<li>n/N	search forward, backward</li>
</ul></li>
<li>Ctrl + k/n	up/down</li>
<li>u / d	Scroll up/down by half a page</li>
<li>b / space	Scroll up/down by a page</li>
<li>highlighting on and off, press Esc+U.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orga7b0b58" class="outline-4">
<h4 id="orga7b0b58"><span class="section-number-4">2.37.3.</span> info <a id="org5e552a6"></a></h4>
<div class="outline-text-4" id="text-2-37-3">
</div>
<ol class="org-ol">
<li><a id="orgc8b3916"></a>info command line arguments<br />
<div class="outline-text-5" id="text-2-37-3-1">
<dl class="org-dl">
<dt>-a</dt><dd>get list of all manuals for term</dd>
<dt>-k</dt><dd>look up string in all indices of all manuals</dd>
<dt>-d</dt><dd></dd>

<dt>-O</dt><dd>command line options for command</dd>
</dl>
</div>
</li>

<li><a id="orge199d2e"></a>terms:<br />
<div class="outline-text-5" id="text-2-37-3-2">
<ul class="org-ul">
<li>node - page</li>
</ul>
</div>
</li>

<li><a id="org1af2137"></a>keys:<br />
<div class="outline-text-5" id="text-2-37-3-3">
<p>
navigation
</p>
<ul class="org-ul">
<li>d		directory node - internal mode</li>
<li>n/p or <code>[/]</code> next/previous node</li>
<li>u		up node (level)</li>
<li>l/r		go back/forward - return from reference</li>
<li>t		top node</li>
</ul>

<p>
help
</p>
<ul class="org-ul">
<li>h 		help</li>
<li>H		Basic info command keys</li>
<li>q		quit</li>

<li>C-n/p	next/previous line</li>
<li>//?		search
<ul class="org-ul">
<li>}/{ or C-x n/p	next/previous</li>
<li>R			toggle regex search</li>
</ul></li>
<li>M-/		tree search in current node tree, Global search!</li>
<li>TAB/S-TAB	next/previous reference</li>
<li>C-x C-b	list of visiter references with locations of files</li>
<li>t/T		default - major nodes and detail or full one tree.</li>
<li>C-x 1	Delete all other windows.</li>
<li>x		Delete current window.</li>
</ul>

<p>
Backspace or ] - back and up level
space or [ - forward and down
</p>

<p>
b - top of buffer
1-9 - pick node in menu
</p>

<p>
&lt; - top page
&gt; - bottom page
</p>

<p>
l - go back at history
r - go forward at history
</p>

<p>
i - search for topoc and go to the index
</p>

<p>
Cross reference - link to another topic
Follow cross reference - just RET or f name<sub>of</sub><sub>reference</sub>
f? - get list of references
Tab - scroll references at page (very useful)
l - go back
</p>

<p>
d - directory
</p>
</div>
</li>

<li><a id="org3b788b5"></a>search sequence<br />
<div class="outline-text-5" id="text-2-37-3-4">
<ul class="org-ul">
<li>d	directory node</li>
<li>m	Pick a menu item specified by name with completion</li>
<li>i	Search for a specified string in the index</li>
</ul>

<p>
M-x apropos
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgcbedb7a" class="outline-3">
<h3 id="orgcbedb7a"><span class="section-number-3">2.38.</span> less</h3>
<div class="outline-text-3" id="text-2-38">
<p>
man tcpdump | less -Ip examples
</p>
<ul class="org-ul">
<li>I - IGNORE-CASE</li>
<li>p - pattern</li>
</ul>
</div>
</div>
<div id="outline-container-org12684f7" class="outline-3">
<h3 id="org12684f7"><span class="section-number-3">2.39.</span> date</h3>
<div class="outline-text-3" id="text-2-39">
<p>
set time:
</p>
<ul class="org-ul">
<li>date +%Y%m%d -s "20220429"</li>
<li>date -s "19:35"</li>
</ul>
<p>
epoch to time:
</p>
<ul class="org-ul">
<li>date -d @1234567890</li>
</ul>
</div>
</div>

<div id="outline-container-org19269f4" class="outline-3">
<h3 id="org19269f4"><span class="section-number-3">2.40.</span> tee</h3>
<div class="outline-text-3" id="text-2-40">
<p>
append line to file and to STDOUT
</p>
<pre class="example">
echo "as" | tee -a /etc/fstab
</pre>
</div>
<div id="outline-container-orgb0c0d90" class="outline-4">
<h4 id="orgb0c0d90"><span class="section-number-4">2.40.1.</span> freeze problem</h4>
<div class="outline-text-4" id="text-2-40-1">
<p>
tee inside the process substitution will not exit until it gets an eof on its stdin or some error happens.
</p>
</div>
</div>
</div>
