sources_org/shell.org
** time
- real - time from start to finish of the call.
- user - amount of CPU time spent in user-mode code (outside the kernel) within the process. This is only actual CPU
time used in executing the process.
- Sys - is the amount of CPU time spent in the kernel within the process.

other explanation.
- Real time is wall clock time. (what we could measure with a stopwatch)
- User time is the amount of time spend in user-mode within the process
- Sys is the CPU time spend in the kernel within the process.

Wall time, or the amount of time that passes between you starting the process and the process ending.

(Wall time) - (CPU time) = (time the CPU spent doing other things)

cases
- real < user: The process is CPU bound and takes advantage of parallel execution on multiple cores/CPUs.
- real ≈ user: The process is CPU bound and takes no advantage of parallel exeuction.
- real > user: The process is I/O bound. Execution on multiple cores would be of little to no advantage.

** lsfd
files opende by processes of user:
lsfd -Q 'USER == "larry"'
** fuser
find process on port:
: fuser -nv tcp 80
** administration commands
- мониторинга процессов (ps, top, htop, atop, lsof)
- проверок производительности системы (nmon, iostat, sar, vmstat)
- утилитами диагностики сетевых подключений (ping, traceroute, mtr, nmap, netstat, tcpdupm, dig, scp),
- файрволов Linux (ufw/firewalld, iptables/nftables)
*** memory
- dmesg | grep Memory:  - RAM memory available in kilobytes.
- cat /proc/meminfo, free
  - free - idle memory
  - buff/cache - memory used for cache but available.
- vmstat -w - first report produced gives averages since the last reboot, additional for delay period.
- vmstat -wa - active/inactive


Context switching
- Context switching can be due to multitasking, Interrupt handling , user & kernel mode switching. The
 interrupt rate will naturally go high, if there is higher network traffic, or higher disk traffic. Also it is
 dependent on the application which every now and then invoking system calls.
- If the cores/CPU's are not sufficient to handle load of threads created by application will also result in context switching.

** USECASES
- print column:
  - ps | awk '{print $2}'
  - ps | tr -s ' ' | cut -d ' ' -f 3
- find duplicated files:
  - find ./ -type f -exec md5sum '{}' ';' > dupl
  - cat dupl  | sort | uniq --all-repeated=separate -w 15 | grep '\.\/' | uniq -w 15 | cut -c 35- | xargs rm
- copy files from stdinput | xargs -I{} cp -u {} /destination/path
- rename multiple files: find . -depth -name "*.html" -exec sh -c 'f="{}"; mv -- "$f" "${f%.html}.php"' \;


- sync directories:  # rsync -aqxP /var/* /mnt/newvar
- вывод в файл и stdout: cmd | tee file
- list directories: ls -d */
- read file line by line:  while read -r line;do echo "$line";done < file
- message window: xmessage -timeout 50 "MESSAGE HERE!!!"
- execute for every file: find . -name "*.jpg" -maxdepth 1 -type f -exec ~/firef \{\} \; -exec sleep 1 \; -exec pkill firefox \;
  - find . -name "*.mpg" -maxdepth 1 -type f   -exec sh -c "firefox {} & sleep 10 ; pkill firefox ;" \;
  - for f in *.txt; do echo "$f"; done
- zip
  - for f in ./* ; do zip -r "${f:2}".zip "${f:2}" ; done # all folders
  - for f in ./* ; do zip -r "${f:2}".zip "$f" ; done # all files

*time elapsed*
: SECONDS=0 ;  while true ; sleep 1 ; do echo -ne "\r" $SECONDS ; done

*get parent process*
- ps -o ppid= -p 21509
- pstree -s -p 21509

*filename filepath*
- basename $fspec # get filename
- dirname $fspec # get filedir

*split and rejoin big file*
- split -d -b 1M file file_prefix_
  - -b 1M put SIZE bytes per output file
  - -d use numeric suffixes starting at 0, not alphabetic
- cat file_prefix_* > file

*logs from several host to one file*
- node:
: script -c 'python param.py' |& sed -u "s/^/${who}: /" |& perl -ne 'use IO::Handle ; printf "%s %s",  scalar time(), $_ ; STDOUT->autoflush(1) ;' |& tee -a ${who}.log
- server:
: watch "cat chief_0.log worker_0.log worker_1.log | sort -ns -k1 | tail"

add string to every line in pipeline:
- <command> | sed 's/^/<string>/'
- <command> | awk '{print "<string>" $0}'
- <command> | while read line; do echo "<string>$line"; done
- echo "asd\n asd2 \n ddvv" | sed 's/$/ file/'

*overwrite output*
: echo -en "aaaa\r" ; sleep 1 ; echo -ne "bbb\033[0K\r" ; sleep 1; echo "[INFO] Processing file: log.txt"

<<telega-most-frequient-spammers>>
- cat messages.org | grep -o "@[^$ ]*" | grep -v '>' | sort | uniq -c | sort -r

*find line and remove this line and next one*
: sed '/pattern/,+1d' file.txt > temp_file.txt && mv temp_file.txt file.txt


*replace substring in files*
#+begin_src bash :results output :eval never
for f in ./*.el ; do
    cat $f | sed 's/2023/2024/g' > /tmp/t
    mv /tmp/t $f
done
#+end_src

*split long lines*, broke line with limit
: echo 'asdasd' | fold -s -w 80

*filter lines by dinstance*
- sed -r '/^(.{9,})$/d' inputfile.txt
** USECASE: save output of command to cash
#+begin_src bash :results output
CACHE_TIME=3600 # 1 hour

CACHE_DIR=/tmp/cache_exec

function cache_exec() {

  local cmd="$*"
  local cache_file="$CACHE_DIR/"$(echo "$cmd" | sha1sum | cut -f 1 -d ' ')

  mkdir -p $CACHE_DIR # create if not exist

  if [ -f "$cache_file" ] && [ $(($(date +%s) - $(stat -c "%Y" "$cache_file"))) -lt $CACHE_TIME ]; then
    cat "$cache_file"
  else
    local output=$("$@")
    echo "$output" > "$cache_file"
    echo "$output"
  fi
}
# cache_exec uname -a
#+end_src

