shell.html
<div id="outline-container-org419d03b" class="outline-3">
<h3 id="org419d03b"><span class="section-number-3">2.41.</span> time</h3>
<div class="outline-text-3" id="text-2-41">
<ul class="org-ul">
<li>real - time from start to finish of the call.</li>
<li>user - amount of CPU time spent in user-mode code (outside the kernel) within the process. This is only actual CPU</li>
</ul>
<p>
time used in executing the process.
</p>
<ul class="org-ul">
<li>Sys - is the amount of CPU time spent in the kernel within the process.</li>
</ul>

<p>
other explanation.
</p>
<ul class="org-ul">
<li>Real time is wall clock time. (what we could measure with a stopwatch)</li>
<li>User time is the amount of time spend in user-mode within the process</li>
<li>Sys is the CPU time spend in the kernel within the process.</li>
</ul>

<p>
Wall time, or the amount of time that passes between you starting the process and the process ending.
</p>

<p>
(Wall time) - (CPU time) = (time the CPU spent doing other things)
</p>

<p>
cases
</p>
<ul class="org-ul">
<li>real &lt; user: The process is CPU bound and takes advantage of parallel execution on multiple cores/CPUs.</li>
<li>real ≈ user: The process is CPU bound and takes no advantage of parallel exeuction.</li>
<li>real &gt; user: The process is I/O bound. Execution on multiple cores would be of little to no advantage.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf8d280" class="outline-3">
<h3 id="orgbf8d280"><span class="section-number-3">2.42.</span> lsfd</h3>
<div class="outline-text-3" id="text-2-42">
<p>
files opende by processes of user:
lsfd -Q 'USER == "larry"'
</p>
</div>
</div>
<div id="outline-container-orgbbc4a31" class="outline-3">
<h3 id="orgbbc4a31"><span class="section-number-3">2.43.</span> fuser</h3>
<div class="outline-text-3" id="text-2-43">
<p>
find process on port:
</p>
<pre class="example">
fuser -nv tcp 80
</pre>
</div>
</div>
<div id="outline-container-orgc996d92" class="outline-3">
<h3 id="orgc996d92"><span class="section-number-3">2.44.</span> administration commands</h3>
<div class="outline-text-3" id="text-2-44">
<ul class="org-ul">
<li>мониторинга процессов (ps, top, htop, atop, lsof)</li>
<li>проверок производительности системы (nmon, iostat, sar, vmstat)</li>
<li>утилитами диагностики сетевых подключений (ping, traceroute, mtr, nmap, netstat, tcpdupm, dig, scp),</li>
<li>файрволов Linux (ufw/firewalld, iptables/nftables)</li>
</ul>
</div>
<div id="outline-container-org5821b7f" class="outline-4">
<h4 id="org5821b7f"><span class="section-number-4">2.44.1.</span> memory</h4>
<div class="outline-text-4" id="text-2-44-1">
<ul class="org-ul">
<li>dmesg | grep Memory:  - RAM memory available in kilobytes.</li>
<li>cat /proc/meminfo, free
<ul class="org-ul">
<li>free - idle memory</li>
<li>buff/cache - memory used for cache but available.</li>
</ul></li>
<li>vmstat -w - first report produced gives averages since the last reboot, additional for delay period.</li>
<li>vmstat -wa - active/inactive</li>
</ul>


<p>
Context switching
</p>
<ul class="org-ul">
<li>Context switching can be due to multitasking, Interrupt handling , user &amp; kernel mode switching. The
interrupt rate will naturally go high, if there is higher network traffic, or higher disk traffic. Also it is
dependent on the application which every now and then invoking system calls.</li>
<li>If the cores/CPU's are not sufficient to handle load of threads created by application will also result in context switching.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb9afc3f" class="outline-3">
<h3 id="orgb9afc3f"><span class="section-number-3">2.45.</span> USECASES</h3>
<div class="outline-text-3" id="text-2-45">
<ul class="org-ul">
<li>print column:
<ul class="org-ul">
<li>ps | awk '{print $2}'</li>
<li>ps | tr -s ' ' | cut -d ' ' -f 3</li>
</ul></li>
<li>find duplicated files:
<ul class="org-ul">
<li>find ./ -type f -exec md5sum '{}' ';' &gt; dupl</li>
<li>cat dupl  | sort | uniq &#x2013;all-repeated=separate -w 15 | grep '\.\/' | uniq -w 15 | cut -c 35- | xargs rm</li>
</ul></li>
<li>copy files from stdinput | xargs -I{} cp -u {} /destination/path</li>
<li>rename multiple files: find . -depth -name "*.html" -exec sh -c 'f="{}"; mv &#x2013; "\(f" "\){f%.html}.php"' \;</li>
</ul>


<ul class="org-ul">
<li>sync directories:  # rsync -aqxP /var/* /mnt/newvar</li>
<li>вывод в файл и stdout: cmd | tee file</li>
<li>list directories: ls -d */</li>
<li>read file line by line:  while read -r line;do echo "$line";done &lt; file</li>
<li>message window: xmessage -timeout 50 "MESSAGE HERE!!!"</li>
<li>execute for every file: find . -name "*.jpg" -maxdepth 1 -type f -exec ~/firef \{\} \; -exec sleep 1 \; -exec pkill firefox \;
<ul class="org-ul">
<li>find . -name "*.mpg" -maxdepth 1 -type f   -exec sh -c "firefox {} &amp; sleep 10 ; pkill firefox ;" \;</li>
<li>for f in *.txt; do echo "$f"; done</li>
</ul></li>
<li>zip
<ul class="org-ul">
<li>for f in ./* ; do zip -r "\({f:2}".zip "\){f:2}" ; done # all folders</li>
<li>for f in ./* ; do zip -r "${f:2}".zip "$f" ; done # all files</li>
</ul></li>
</ul>

<p>
<b>time elapsed</b>
</p>
<pre class="example">
SECONDS=0 ;  while true ; sleep 1 ; do echo -ne "\r" $SECONDS ; done
</pre>


<p>
<b>get parent process</b>
</p>
<ul class="org-ul">
<li>ps -o ppid= -p 21509</li>
<li>pstree -s -p 21509</li>
</ul>

<p>
<b>filename filepath</b>
</p>
<ul class="org-ul">
<li>basename $fspec # get filename</li>
<li>dirname $fspec # get filedir</li>
</ul>

<p>
<b>split and rejoin big file</b>
</p>
<ul class="org-ul">
<li>split -d -b 1M file file<sub>prefix</sub>_
<ul class="org-ul">
<li>-b 1M put SIZE bytes per output file</li>
<li>-d use numeric suffixes starting at 0, not alphabetic</li>
</ul></li>
<li>cat file<sub>prefix</sub><sub>*</sub> &gt; file</li>
</ul>

<p>
<b>logs from several host to one file</b>
</p>
<ul class="org-ul">
<li>node:</li>
</ul>
<pre class="example">
script -c 'python param.py' |&amp; sed -u "s/^/${who}: /" |&amp; perl -ne 'use IO::Handle ; printf "%s %s",  scalar time(), $_ ; STDOUT-&gt;autoflush(1) ;' |&amp; tee -a ${who}.log
</pre>

<ul class="org-ul">
<li>server:</li>
</ul>
<pre class="example">
watch "cat chief_0.log worker_0.log worker_1.log | sort -ns -k1 | tail"
</pre>


<p>
add string to every line in pipeline:
</p>
<ul class="org-ul">
<li>&lt;command&gt; | sed 's/^/&lt;string&gt;/'</li>
<li>&lt;command&gt; | awk '{print "&lt;string&gt;" $0}'</li>
<li>&lt;command&gt; | while read line; do echo "&lt;string&gt;$line"; done</li>
<li>echo "asd\n asd2 \n ddvv" | sed 's/$/ file/'</li>
</ul>

<p>
<b>overwrite output</b>
</p>
<pre class="example">
echo -en "aaaa\r" ; sleep 1 ; echo -ne "bbb\033[0K\r" ; sleep 1; echo "[INFO] Processing file: log.txt"
</pre>


<p>
<a id="org94dbcc5"></a>
</p>
<ul class="org-ul">
<li>cat messages.org | grep -o "@[^$ ]*" | grep -v '&gt;' | sort | uniq -c | sort -r</li>
</ul>

<p>
<b>find line and remove this line and next one</b>
</p>
<pre class="example">
sed '/pattern/,+1d' file.txt &gt; temp_file.txt &amp;&amp; mv temp_file.txt file.txt
</pre>



<p>
<b>replace substring in files</b>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8ac6f2; font-weight: bold;">for</span> f<span style="color: #8ac6f2; font-weight: bold;"> in</span> ./*.el ; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    cat $<span style="color: #cae682;">f</span> | sed <span style="color: #95e454;">'s/2023/2024/g'</span> &gt; /tmp/t
    mv /tmp/t $<span style="color: #cae682;">f</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>
</pre>
</div>

<p>
<b>split long lines</b>, broke line with limit
</p>
<pre class="example">
echo 'asdasd' | fold -s -w 80
</pre>


<p>
<b>filter lines by dinstance</b>
</p>
<ul class="org-ul">
<li>sed -r '/<sup>(.{9,})</sup>$/d' inputfile.txt</li>
</ul>
</div>
</div>
<div id="outline-container-org899765d" class="outline-3">
<h3 id="org899765d"><span class="section-number-3">2.46.</span> USECASE: save output of command to cash</h3>
<div class="outline-text-3" id="text-2-46">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682;">CACHE_TIME</span>=3600 <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">1 hour</span>

<span style="color: #cae682;">CACHE_DIR</span>=/tmp/cache_exec

<span style="color: #8ac6f2; font-weight: bold;">function</span> <span style="color: #cae682; font-weight: bold;">cache_exec</span>() {

  <span style="color: #e5786d;">local</span> <span style="color: #cae682;">cmd</span>=<span style="color: #95e454;">"$*"</span>
  <span style="color: #e5786d;">local</span> <span style="color: #cae682;">cache_file</span>=<span style="color: #95e454;">"$CACHE_DIR/"</span>$(<span style="color: #fa8072;">echo "$cmd" | sha1sum | cut -f 1 -d ' '</span>)

  mkdir -p $<span style="color: #cae682;">CACHE_DIR</span> <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">create if not exist</span>

  <span style="color: #8ac6f2; font-weight: bold;">if</span> [ -f <span style="color: #95e454;">"$cache_file"</span> ] &amp;&amp; [ $(<span style="color: #fa8072;">($(date +%s</span>) - $(<span style="color: #fa8072;">stat -c "%Y" "$cache_file"</span>))) -lt $<span style="color: #cae682;">CACHE_TIME</span> ]; <span style="color: #8ac6f2; font-weight: bold;">then</span>
    cat <span style="color: #95e454;">"$cache_file"</span>
  <span style="color: #8ac6f2; font-weight: bold;">else</span>
    <span style="color: #e5786d;">local</span> <span style="color: #cae682;">output</span>=$(<span style="color: #fa8072;">"$@"</span>)
    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$output"</span> &gt; <span style="color: #95e454;">"$cache_file"</span>
    <span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"$output"</span>
  <span style="color: #8ac6f2; font-weight: bold;">fi</span>
}
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">cache_exec uname -a</span>
</pre>
</div>
</div>
</div>
