sources_org/shell.org
** USECASE: case - set environment varibles per directory after cd command
#+begin_src bash :eval no :exports code :results none
set_env() {
  # Check the current directory and set environment variables accordingly
  case "$PWD" in
    /etc/*)
      export AETCEA="vvasd"
      ;;
    /home/*)
      export HALOM="12345"
      ;;
    *)
      # Do nothing if the directory does not match any of the above cases
      ;;
  esac
}

# Modify the cd command to call the set_env function
cd() { builtin cd "$@" ; set_env ; }
#+end_src
Do not unset them.
** USECASE: find N last modified files in current directory and subdirs
: find . -type f -printf '%T@ %p\n' | sort -n | tail -4 | cut -f2- -d" "
where -4 - to get last 4 modified
** links
- https://learnbyexample.gitbooks.io/linux-command-line/content/Shell.html
- Shell & Utilities https://pubs.opengroup.org/onlinepubs/9699919799/utilities/contents.html
- https://github.com/dylanaraps/pure-bash-bible

extract IP:PORT from file:
- grep -E -o "([0-9]{1,3}[\.]){3}[0-9]{1,3}:[0-9]{1,5}" p.txt

* Bash new features
bash --posix or set -o posix - to execute in POSIX mode

Syntax
- case :: ;;& ;& etc
- for ((i=0; i<3; i++)); do ; printf '%s\n' "$i" ; done
- extended glob  :: +( ) @( ) !( ) *( )
- select :: construction to create menu with input from user.
- file slurp :: $(< file), in shell: $(cat file)

Expansions
- {a,b,c} or {1..10}
- <( ) and >( ) process substitutions. instead of foo <(bar), write mkfifo /tmp/foo_fifo; bar > /tmp/foo_fifo & foo /tmp/foo_fifo

Parameter Expansions
- ${name:n:l} - $(expr "x$name" : "x.\{0,$n\}\(.\{0,$l\}\)")
- ${name/foo/bar} -- you can use $(printf '%s\n' "$name" | sed 's/foo/bar/')
- ${!name}
- #, ##, %, and %% - operators when used together with the @ or * parameters

Arrays, in shell: IFS and set -f

Conditionals
- [[ - use [ and use double quotes around the expansions [ "$var" = "" ]
- [ foo = *glov ]] - use case or expr or grep
- == - use = instead - only = is defined by POSIX
- compare lexicographically. < >  - not POSIX
- compare modification times [ file1 -nt/-ot file2 ]] - [ "$(find 'file1' -prune -newer 'file2')" ] or [ "file1" -nt "file2" ]
- same hardlink [ file1 -ef file2 ]]  - [ "file1" -ef "file2" ]
- (( )) (without the $) acts like a command on its own

Arithmetic
- ++ --
- , - comma as command separator
- **
- let or ((...)) - use [ "$((...))" -ne 0 ]
** links
- http://mywiki.wooledge.org/Bashism
- https://www.gnu.org/software/bash/manual/html_node/Bash-POSIX-Mode.html
* tmux
 emerge --ask app-misc/tmux
** status
[10] 0: bash*
- 10 - session number
- bash - window name, default is dynamic from current command name
** terms
- server :: Servers are terminated when the last remaining running session is closed.
- session :: default session with number 0. When we start a new instance of tmux, new session is created
 inside the running server.
- window ::
- pane :: splits of window, pseudoterminals. Window always have at least one pane.

target-session (-t)
-

** keys
Ctrl-b is the begining of commands:
- ?	help
- [	now Page Up, Page down
- CTRL+SPACE to start copying
- ALT+w or CTRL+w to copy into Tmux buffer.
- ]	to paste
quit:
- x	kill the current panel and quit if one left in window
- &	kill window and quit
- d	disconnect from panel

toggle between:
- (/)	toggle between sessions
- s	list sessions, x - kill session, C-p/n - up/down
- w	list sessions and windows
- %	create a horizontal pane
- "	create a vertical pane
- o	toggle between panes - current surround with green lines
- array toggle between panes
- L


rename:
- $	session
- ,	window

- https://danielmiessler.com/study/tmux/

** commands
- tmux ls - list tmux sessions
- tmux attach -t 0 - attach to session
- tmux
** xorg start and terminal unused
To start terminal with tmux:
: xfce4-terminal -e tmux
To kill unused terminal windows with idling single bash:
: alias cl="ps aux | grep '\-bash' | grep Ss+ |  tr -s ' ' | cut -f 2 -d ' ' | xargs kill -s 9"

to kill deattached tmux sessions, add to ~/.bashrc,
: test -n "$DISPLAY" && tmux list-sessions | grep -v attached | cut -d: -f1 |  xargs -r -n1 tmux kill-session -t &>/dev/null

to set nema of new window:
: xdotool getactivewindow set_window --name $(echo "${PWD/#$HOME/\~}")
** xorg system clipboard - How to copy to clipboard?
Soltuion:
create file ~/tmux.conf and add this line:
: set -s copy-command "xclip -sel clip -i"

this app should be installed:
: emerge x11-misc/xclip
** kill deattached sessions
: tmux list-sessions | grep -v attached | cut -d: -f1 |  xargs -r -n1 tmux kill-session -t &>/dev/null

** option
global options:
: tmux show-options -g
For window options:
: tmux show-options -w
For server options:
: tmux show-options -s

** rebind keys
tmux list-keys | less
: bind-key -T copy-mode C-k    send-keys -X cursor-up
: bind-key -T copy-mode C-l    send-keys -X cursor-left

* SSH
Secure SHell - port 22.
- Mozilla recommendations https://infosec.mozilla.org/guidelines/openssh
