shell.html

<div id="outline-container-org41209ab" class="outline-3">
<h3 id="org41209ab"><span class="section-number-3">2.47.</span> USECASE: case - set environment varibles per directory after cd command</h3>
<div class="outline-text-3" id="text-2-47">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682; font-weight: bold;">set_env</span>() {
  <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Check the current directory and set environment variables accordingly</span>
  <span style="color: #8ac6f2; font-weight: bold;">case</span> <span style="color: #95e454;">"$PWD"</span><span style="color: #8ac6f2; font-weight: bold;"> in</span>
    /etc/*)
      <span style="color: #e5786d;">export</span> <span style="color: #cae682;">AETCEA</span>=<span style="color: #95e454;">"vvasd"</span>
      ;;
    /home/*)
      <span style="color: #e5786d;">export</span> <span style="color: #cae682;">HALOM</span>=<span style="color: #95e454;">"12345"</span>
      ;;
    *)
      <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Do nothing if the directory does not match any of the above cases</span>
      ;;
  <span style="color: #8ac6f2; font-weight: bold;">esac</span>
}

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Modify the cd command to call the set_env function</span>
<span style="color: #e5786d;">cd</span>() { <span style="color: #e5786d;">builtin</span> cd <span style="color: #95e454;">"$@"</span> ; set_env ; }
</pre>
</div>
<p>
Do not unset them.
</p>
</div>
</div>
<div id="outline-container-org752bdb1" class="outline-3">
<h3 id="org752bdb1"><span class="section-number-3">2.48.</span> USECASE: find N last modified files in current directory and subdirs</h3>
<div class="outline-text-3" id="text-2-48">
<pre class="example">
find . -type f -printf '%T@ %p\n' | sort -n | tail -4 | cut -f2- -d" "
</pre>

<p>
where -4 - to get last 4 modified
</p>
</div>
</div>
<div id="outline-container-orgeeee35a" class="outline-3">
<h3 id="orgeeee35a"><span class="section-number-3">2.49.</span> links</h3>
<div class="outline-text-3" id="text-2-49">
<ul class="org-ul">
<li><a href="https://learnbyexample.gitbooks.io/linux-command-line/content/Shell.html">https://learnbyexample.gitbooks.io/linux-command-line/content/Shell.html</a></li>
<li>Shell &amp; Utilities <a href="https://pubs.opengroup.org/onlinepubs/9699919799/utilities/contents.html">https://pubs.opengroup.org/onlinepubs/9699919799/utilities/contents.html</a></li>
<li><a href="https://github.com/dylanaraps/pure-bash-bible">https://github.com/dylanaraps/pure-bash-bible</a></li>
</ul>

<p>
extract IP:PORT from file:
</p>
<ul class="org-ul">
<li>grep -E -o "([0-9]{1,3}[\.]){3}[0-9]{1,3}:[0-9]{1,5}" p.txt</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4739f7c" class="outline-2">
<h2 id="org4739f7c"><span class="section-number-2">3.</span> Bash new features</h2>
<div class="outline-text-2" id="text-3">
<p>
bash &#x2013;posix or set -o posix - to execute in POSIX mode
</p>

<p>
Syntax
</p>
<dl class="org-dl">
<dt>case</dt><dd>;;&amp; ;&amp; etc</dd>
<dt>(no term)</dt><dd>for ((i=0; i&lt;3; i++)); do ; printf '%s\n' "$i" ; done</dd>
<dt>extended glob </dt><dd>+( ) @( ) !( ) *( )</dd>
<dt>select</dt><dd>construction to create menu with input from user.</dd>
<dt>file slurp</dt><dd>$(&lt; file), in shell: $(cat file)</dd>
</dl>

<p>
Expansions
</p>
<ul class="org-ul">
<li>{a,b,c} or {1..10}</li>
<li>&lt;( ) and &gt;( ) process substitutions. instead of foo &lt;(bar), write mkfifo /tmp/foo<sub>fifo</sub>; bar &gt; /tmp/foo<sub>fifo</sub> &amp; foo /tmp/foo<sub>fifo</sub></li>
</ul>

<p>
Parameter Expansions
</p>
<ul class="org-ul">
<li>${name:n:l} - $(expr "x$name" : "x.\{0,$n\}\(.\{0,$l\}\)")</li>
<li>${name/foo/bar} &#x2013; you can use $(printf '%s\n' "$name" | sed 's/foo/bar/')</li>
<li>${!name}</li>
<li>#, ##, %, and %% - operators when used together with the @ or * parameters</li>
</ul>

<p>
Arrays, in shell: IFS and set -f
</p>

<p>
Conditionals
</p>
<ul class="org-ul">
<li>[[ - use [ and use double quotes around the expansions [ "$var" = "" ]</li>
<li>[ foo = *glov ]] - use case or expr or grep</li>
<li>== - use = instead - only = is defined by POSIX</li>
<li>compare lexicographically. &lt; &gt;  - not POSIX</li>
<li>compare modification times [ file1 -nt/-ot file2 ]] - [ "$(find 'file1' -prune -newer 'file2')" ] or [ "file1" -nt "file2" ]</li>
<li>same hardlink [ file1 -ef file2 ]]  - [ "file1" -ef "file2" ]</li>
<li>(( )) (without the $) acts like a command on its own</li>
</ul>

<p>
Arithmetic
</p>
<ul class="org-ul">
<li>++ &#x2013;</li>
<li>, - comma as command separator</li>
<li>**</li>
<li>let or ((&#x2026;)) - use [ "$((&#x2026;))" -ne 0 ]</li>
</ul>
</div>
<div id="outline-container-orgc540f97" class="outline-3">
<h3 id="orgc540f97"><span class="section-number-3">3.1.</span> links</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="http://mywiki.wooledge.org/Bashism">http://mywiki.wooledge.org/Bashism</a></li>
<li><a href="https://www.gnu.org/software/bash/manual/html_node/Bash-POSIX-Mode.html">https://www.gnu.org/software/bash/manual/html_node/Bash-POSIX-Mode.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge5e9080" class="outline-2">
<h2 id="orge5e9080"><span class="section-number-2">4.</span> tmux</h2>
<div class="outline-text-2" id="text-4">
<p>
emerge &#x2013;ask app-misc/tmux
</p>
</div>
<div id="outline-container-org2685fd6" class="outline-3">
<h3 id="org2685fd6"><span class="section-number-3">4.1.</span> status</h3>
<div class="outline-text-3" id="text-4-1">
<p>
[10] 0: bash*
</p>
<ul class="org-ul">
<li>10 - session number</li>
<li>bash - window name, default is dynamic from current command name</li>
</ul>
</div>
</div>
<div id="outline-container-org57a54e5" class="outline-3">
<h3 id="org57a54e5"><span class="section-number-3">4.2.</span> terms</h3>
<div class="outline-text-3" id="text-4-2">
<dl class="org-dl">
<dt>server</dt><dd>Servers are terminated when the last remaining running session is closed.</dd>
<dt>session</dt><dd>default session with number 0. When we start a new instance of tmux, new session is created
inside the running server.</dd>
<dt>window</dt><dd></dd>

<dt>pane</dt><dd>splits of window, pseudoterminals. Window always have at least one pane.</dd>
</dl>

<p>
target-session (-t)
</p>
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>

<div id="outline-container-orgf6907d7" class="outline-3">
<h3 id="orgf6907d7"><span class="section-number-3">4.3.</span> keys</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Ctrl-b is the begining of commands:
</p>
<ul class="org-ul">
<li>?	help</li>
<li>[	now Page Up, Page down</li>
<li>CTRL+SPACE to start copying</li>
<li>ALT+w or CTRL+w to copy into Tmux buffer.</li>
<li>]	to paste</li>
</ul>
<p>
quit:
</p>
<ul class="org-ul">
<li>x	kill the current panel and quit if one left in window</li>
<li>&amp;	kill window and quit</li>
<li>d	disconnect from panel</li>
</ul>

<p>
toggle between:
</p>
<ul class="org-ul">
<li>(/)	toggle between sessions</li>
<li>s	list sessions, x - kill session, C-p/n - up/down</li>
<li>w	list sessions and windows</li>
<li>%	create a horizontal pane</li>
<li>"	create a vertical pane</li>
<li>o	toggle between panes - current surround with green lines</li>
<li>array toggle between panes</li>
<li>L</li>
</ul>


<p>
rename:
</p>
<ul class="org-ul">
<li>$	session</li>
<li>,	window</li>

<li><a href="https://danielmiessler.com/study/tmux/">https://danielmiessler.com/study/tmux/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4d8bc03" class="outline-3">
<h3 id="org4d8bc03"><span class="section-number-3">4.4.</span> commands</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>tmux ls - list tmux sessions</li>
<li>tmux attach -t 0 - attach to session</li>
<li>tmux</li>
</ul>
</div>
</div>
<div id="outline-container-org95c848f" class="outline-3">
<h3 id="org95c848f"><span class="section-number-3">4.5.</span> xorg start and terminal unused</h3>
<div class="outline-text-3" id="text-4-5">
<p>
To start terminal with tmux:
</p>
<pre class="example">
xfce4-terminal -e tmux
</pre>

<p>
To kill unused terminal windows with idling single bash:
</p>
<pre class="example">
alias cl="ps aux | grep '\-bash' | grep Ss+ |  tr -s ' ' | cut -f 2 -d ' ' | xargs kill -s 9"
</pre>


<p>
to kill deattached tmux sessions, add to ~/.bashrc,
</p>
<pre class="example">
test -n "$DISPLAY" &amp;&amp; tmux list-sessions | grep -v attached | cut -d: -f1 |  xargs -r -n1 tmux kill-session -t &amp;&gt;/dev/null
</pre>


<p>
to set nema of new window:
</p>
<pre class="example">
xdotool getactivewindow set_window --name $(echo "${PWD/#$HOME/\~}")
</pre>
</div>
</div>
<div id="outline-container-org8bcc2a3" class="outline-3">
<h3 id="org8bcc2a3"><span class="section-number-3">4.6.</span> xorg system clipboard - How to copy to clipboard?</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Soltuion:
create file ~/tmux.conf and add this line:
</p>
<pre class="example">
set -s copy-command "xclip -sel clip -i"
</pre>


<p>
this app should be installed:
</p>
<pre class="example">
emerge x11-misc/xclip
</pre>
</div>
</div>
<div id="outline-container-org5279b3a" class="outline-3">
<h3 id="org5279b3a"><span class="section-number-3">4.7.</span> kill deattached sessions</h3>
<div class="outline-text-3" id="text-4-7">
<pre class="example">
tmux list-sessions | grep -v attached | cut -d: -f1 |  xargs -r -n1 tmux kill-session -t &amp;&gt;/dev/null
</pre>
</div>
</div>

<div id="outline-container-org93f5491" class="outline-3">
<h3 id="org93f5491"><span class="section-number-3">4.8.</span> option</h3>
<div class="outline-text-3" id="text-4-8">
<p>
global options:
</p>
<pre class="example">
tmux show-options -g
</pre>

<p>
For window options:
</p>
<pre class="example">
tmux show-options -w
</pre>

<p>
For server options:
</p>
<pre class="example">
tmux show-options -s
</pre>
</div>
</div>

<div id="outline-container-org9b42904" class="outline-3">
<h3 id="org9b42904"><span class="section-number-3">4.9.</span> rebind keys</h3>
<div class="outline-text-3" id="text-4-9">
<p>
tmux list-keys | less
</p>
<pre class="example">
bind-key -T copy-mode C-k    send-keys -X cursor-up
bind-key -T copy-mode C-l    send-keys -X cursor-left
</pre>
</div>
</div>
</div>

<div id="outline-container-org5481568" class="outline-2">
<h2 id="org5481568"><span class="section-number-2">5.</span> SSH</h2>
<div class="outline-text-2" id="text-5">
<p>
Secure SHell - port 22.
</p>
<ul class="org-ul">
<li>Mozilla recommendations <a href="https://infosec.mozilla.org/guidelines/openssh">https://infosec.mozilla.org/guidelines/openssh</a></li>
</ul>
</div>
