sources_org/shell.org
** config files
- /etc/ssh/sshd_config - server conf
  - /etc/conf.d/sshd
  - /etc/ssh/known_hosts and ~/.ssh/known_hosts - list of public keys for all the hosts to which the user has
    connected with ssh. for verifying the identity of client's systems. protecting against impersonation or
    man-in-the-middle attacks.
  - ~/.ssh/authorized_keys - mandatory, not added automatically
- /etc/ssh/ssh_config - client conf
  - ~/.ssh/config

** permissions
- 0600 ~/.ssh/authorized_keys # rw
- 0600 ~/.ssh/known_hosts
- 0644 ~/.ssh/config # rw-r-r
- 0600 ~/.ssh/id_rsa # rw
- 0644 ~/.ssh/id_rsa.pub # rw-r-r
- 0700 or 755 /ssh
- 644 /etc/ssh_config
- 600 /etc/ss_config
** authentication types
1) password
   - PasswordAuthentication yes
2) public key
3) Host-based - public key + ip white list
   - EnableSSHKeySign yes
   - HostbasedAuthentication yes
   - IgnoreRhosts no
4) keyboard-interactive - server sends prompts to the Client who should provide the correct response.
   - KbdInteractiveAuthentication yes
   - ChallengeResponseAuthentication yes
5) challenge-response - A specific backend system sends the challenges to the client’s PC and verifies the response.
   - ChallengeResponseAuthentication yes
   - KbdInteractiveAuthentication yes
6) GSSAPI - Kerberos authentication
   - GssapiAuthentication
   - GssapiKeyExchange
** usage
- /usr/sbin/sshd -t # validate its configuration
- ssh-add -l # list keys
- copy files
  - from remote to local
    - rsync username@ip_address:/home/username/filename .
    - scp filename username@ip_address:/home/username .
    - rsync -r source_folder/ dest_folder/ # recurse copy contents of the source folder into dest_folder
    - rsync -vP username@host:/path/to/file . # download large file with progress
  - from local to the remote
    - rsync username@ip_address:/home/username/filename .
    - scp filename username@ip_address:/home/username
      -
- ssh -t command # execute command right after login
** commands
- scp - secure file copy
- sftp - secure file transfer
- ssh-add - add private key identities to the authentication agent
- ssh-agent - authentication agent
- ssh-copy-id - use locally available keys to authorize logins on a remote machine
- ssh-keygen - authentication key utility
- ssh-keyscan - gather SSH public keys from servers
- sshd - OpenSSH daemon

** 1) ssh server - password
- net-misc/openssh
- Config server:
  - PasswordAuthentication yes
  - PermitRootLogin yes
  - PubkeyAuthentication yes # allow migrate to pubkey (not required)
  - ListenAddress 0.0.0.0 # and add rc_need="net.enp" to /etc/conf.d/sshd (not required)
- sshd -t
client: ssh user@127.16.0.1

** 2) ssh server - generate key - public key and private key
Just don’t use ECDSA/DSA!

1) create and copy key at client
   - ssh-keygen -t ecdsa -a 256 -b 521 (-f ~/.ssh/id_ed25519 -C "username@hostname") (best security)
   - ssh-keygen -t ed25519 -a 256 -b 521 (-f ~/.ssh/id_ed25519 -C "username@hostname")
   - ssh-keygen -b 4096 -t rsa -f ~/.ssh/mykey_rsa

     - add *-q -N ""* for empty passphrase
   - ssh-copy-id -i ~/.ssh/id_rsa.pub 172.16.0.1
   - ssh user@172.16.0.1 # try loggin
   - eval `ssh-agent`
   - ssh-add /home/user/.ssh/id_rsa
   - ssh user@172.16.0.1 # try loggin
2) server - change config of sshd
   - PermitRootLogin no # if not needed
   - PasswordAuthentication no
   - HostbasedAuthentication no
   - KbdInteractiveAuthentication no # keyboard-interactive
   - # UsePAM yes # should be commented
   - AllowUsers user1 user2 # restrict access for this users only
   - sshd -t


1) client - samplify ~/.ssh/config
   - Host ssh-ex
     - HostName 104.236.90.57
     - User fideloper
     - IdentitiesOnly yes # where ssh-agent offers many different identities. (optional)
     - IdentityFile ~/.ssh/id_sshex
     - PreferredAuthentications publickey # (optional)

: drwx------  2 root root  4096 Mar 26 12:47 .ssh
: -rw------- .ssh/authorized_keys


ECDSA
- secp256r1 (256-bit curve): Equivalent to a 3072-bit RSA key.
- secp384r1 (384-bit curve): Equivalent to a 7680-bit RSA key.
- secp521r1 (521-bit curve): Equivalent to a 15360-bit RSA key.
- More resistant to quantum computer attacks compared to traditional RSA.

Elliptic Curve Cryptography (ECC)
 384-bit ECC key provides similar security as a 7680-bit RSA key.

Ed25519 : Equal to a RSA with ~3000-bit keys
- excellent security with a fixed key size of 256 bits.
- It is highly secure and resistant to side-channel attacks.

** 3) sftp server
1. uncomment /etc/ssh/sshd_config: Subsystem sftp /usr...
2. for autocompletion at client: echo "net-misc/openssh libedit" >> /etc/portage/package.use/openssh
** 4) X11 Forwarding
to start a graphical applications installed on a remote Linux system and forward that application windows
(screen) to the local system

1) /etc/sshd_config
   - ForwardX11=yes
2) ssh -Y host


ssh -X - is not working:
- Warning: untrusted X11 forwarding setup failed: xauth key data not generated
- xset: ubable to open display ""
