shell.html
<div id="outline-container-orgcad8fc4" class="outline-3">
<h3 id="orgcad8fc4"><span class="section-number-3">5.1.</span> config files</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>/etc/ssh/sshd<sub>config</sub> - server conf
<ul class="org-ul">
<li>/etc/conf.d/sshd</li>
<li><i>etc/ssh/known<sub>hosts</sub> and ~</i>.ssh/known<sub>hosts</sub> - list of public keys for all the hosts to which the user has
connected with ssh. for verifying the identity of client's systems. protecting against impersonation or
man-in-the-middle attacks.</li>
<li>~/.ssh/authorized<sub>keys</sub> - mandatory, not added automatically</li>
</ul></li>
<li>/etc/ssh/ssh<sub>config</sub> - client conf
<ul class="org-ul">
<li>~/.ssh/config</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf404acc" class="outline-3">
<h3 id="orgf404acc"><span class="section-number-3">5.2.</span> permissions</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>0600 ~/.ssh/authorized<sub>keys</sub> # rw</li>
<li>0600 ~/.ssh/known<sub>hosts</sub></li>
<li>0644 ~/.ssh/config # rw-r-r</li>
<li>0600 ~/.ssh/id<sub>rsa</sub> # rw</li>
<li>0644 ~/.ssh/id<sub>rsa.pub</sub> # rw-r-r</li>
<li>0700 or 755 /ssh</li>
<li>644 /etc/ssh<sub>config</sub></li>
<li>600 /etc/ss<sub>config</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgbb73a63" class="outline-3">
<h3 id="orgbb73a63"><span class="section-number-3">5.3.</span> authentication types</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>password
<ul class="org-ul">
<li>PasswordAuthentication yes</li>
</ul></li>
<li>public key</li>
<li>Host-based - public key + ip white list
<ul class="org-ul">
<li>EnableSSHKeySign yes</li>
<li>HostbasedAuthentication yes</li>
<li>IgnoreRhosts no</li>
</ul></li>
<li>keyboard-interactive - server sends prompts to the Client who should provide the correct response.
<ul class="org-ul">
<li>KbdInteractiveAuthentication yes</li>
<li>ChallengeResponseAuthentication yes</li>
</ul></li>
<li>challenge-response - A specific backend system sends the challenges to the client’s PC and verifies the response.
<ul class="org-ul">
<li>ChallengeResponseAuthentication yes</li>
<li>KbdInteractiveAuthentication yes</li>
</ul></li>
<li>GSSAPI - Kerberos authentication
<ul class="org-ul">
<li>GssapiAuthentication</li>
<li>GssapiKeyExchange</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org0cc8441" class="outline-3">
<h3 id="org0cc8441"><span class="section-number-3">5.4.</span> usage</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>/usr/sbin/sshd -t # validate its configuration</li>
<li>ssh-add -l # list keys</li>
<li>copy files
<ul class="org-ul">
<li>from remote to local
<ul class="org-ul">
<li>rsync username@ip<sub>address</sub>:/home/username/filename .</li>
<li>scp filename username@ip<sub>address</sub>:/home/username .</li>
<li>rsync -r source<sub>folder</sub>/ dest<sub>folder</sub>/ # recurse copy contents of the source folder into dest<sub>folder</sub></li>
<li>rsync -vP username@host:/path/to/file . # download large file with progress</li>
</ul></li>
<li>from local to the remote
<ul class="org-ul">
<li>rsync username@ip<sub>address</sub>:/home/username/filename .</li>
<li>scp filename username@ip<sub>address</sub>:/home/username
<ul class="org-ul">
<li></li>
</ul></li>
</ul></li>
</ul></li>
<li>ssh -t command # execute command right after login</li>
</ul>
</div>
</div>
<div id="outline-container-org68c03f4" class="outline-3">
<h3 id="org68c03f4"><span class="section-number-3">5.5.</span> commands</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>scp - secure file copy</li>
<li>sftp - secure file transfer</li>
<li>ssh-add - add private key identities to the authentication agent</li>
<li>ssh-agent - authentication agent</li>
<li>ssh-copy-id - use locally available keys to authorize logins on a remote machine</li>
<li>ssh-keygen - authentication key utility</li>
<li>ssh-keyscan - gather SSH public keys from servers</li>
<li>sshd - OpenSSH daemon</li>
</ul>
</div>
</div>

<div id="outline-container-org6a655b2" class="outline-3">
<h3 id="org6a655b2"><span class="section-number-3">5.6.</span> 1) ssh server - password</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>net-misc/openssh</li>
<li>Config server:
<ul class="org-ul">
<li>PasswordAuthentication yes</li>
<li>PermitRootLogin yes</li>
<li>PubkeyAuthentication yes # allow migrate to pubkey (not required)</li>
<li>ListenAddress 0.0.0.0 # and add rc<sub>need</sub>="net.enp" to /etc/conf.d/sshd (not required)</li>
</ul></li>
<li>sshd -t</li>
</ul>
<p>
client: ssh user@127.16.0.1
</p>
</div>
</div>

<div id="outline-container-org161d7c7" class="outline-3">
<h3 id="org161d7c7"><span class="section-number-3">5.7.</span> 2) ssh server - generate key - public key and private key</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Just don’t use ECDSA/DSA!
</p>

<ol class="org-ol">
<li>create and copy key at client
<ul class="org-ul">
<li>ssh-keygen -t ecdsa -a 256 -b 521 (-f ~/.ssh/id<sub>ed25519</sub> -C "username@hostname") (best security)</li>
<li>ssh-keygen -t ed25519 -a 256 -b 521 (-f ~/.ssh/id<sub>ed25519</sub> -C "username@hostname")</li>
<li>ssh-keygen -b 4096 -t rsa -f ~/.ssh/mykey<sub>rsa</sub>

<ul class="org-ul">
<li>add <b>-q -N ""</b> for empty passphrase</li>
</ul></li>
<li>ssh-copy-id -i ~/.ssh/id<sub>rsa.pub</sub> 172.16.0.1</li>
<li>ssh user@172.16.0.1 # try loggin</li>
<li>eval `ssh-agent`</li>
<li>ssh-add <i>home/user</i>.ssh/id<sub>rsa</sub></li>
<li>ssh user@172.16.0.1 # try loggin</li>
</ul></li>
<li>server - change config of sshd
<ul class="org-ul">
<li>PermitRootLogin no # if not needed</li>
<li>PasswordAuthentication no</li>
<li>HostbasedAuthentication no</li>
<li>KbdInteractiveAuthentication no # keyboard-interactive</li>
<li># UsePAM yes # should be commented</li>
<li>AllowUsers user1 user2 # restrict access for this users only</li>
<li>sshd -t</li>
</ul></li>
</ol>


<ol class="org-ol">
<li>client - samplify ~/.ssh/config
<ul class="org-ul">
<li>Host ssh-ex
<ul class="org-ul">
<li>HostName 104.236.90.57</li>
<li>User fideloper</li>
<li>IdentitiesOnly yes # where ssh-agent offers many different identities. (optional)</li>
<li>IdentityFile ~/.ssh/id<sub>sshex</sub></li>
<li>PreferredAuthentications publickey # (optional)</li>
</ul></li>
</ul></li>
</ol>

<pre class="example">
drwx------  2 root root  4096 Mar 26 12:47 .ssh
-rw------- .ssh/authorized_keys
</pre>



<p>
ECDSA
</p>
<ul class="org-ul">
<li>secp256r1 (256-bit curve): Equivalent to a 3072-bit RSA key.</li>
<li>secp384r1 (384-bit curve): Equivalent to a 7680-bit RSA key.</li>
<li>secp521r1 (521-bit curve): Equivalent to a 15360-bit RSA key.</li>
<li>More resistant to quantum computer attacks compared to traditional RSA.</li>
</ul>

<p>
Elliptic Curve Cryptography (ECC)
 384-bit ECC key provides similar security as a 7680-bit RSA key.
</p>

<p>
Ed25519 : Equal to a RSA with ~3000-bit keys
</p>
<ul class="org-ul">
<li>excellent security with a fixed key size of 256 bits.</li>
<li>It is highly secure and resistant to side-channel attacks.</li>
</ul>
</div>
</div>

<div id="outline-container-orgca2a192" class="outline-3">
<h3 id="orgca2a192"><span class="section-number-3">5.8.</span> 3) sftp server</h3>
<div class="outline-text-3" id="text-5-8">
<ol class="org-ol">
<li>uncomment /etc/ssh/sshd<sub>config</sub>: Subsystem sftp /usr&#x2026;</li>
<li>for autocompletion at client: echo "net-misc/openssh libedit" &gt;&gt; /etc/portage/package.use/openssh</li>
</ol>
</div>
</div>
<div id="outline-container-orgcbfeb30" class="outline-3">
<h3 id="orgcbfeb30"><span class="section-number-3">5.9.</span> 4) X11 Forwarding</h3>
<div class="outline-text-3" id="text-5-9">
<p>
to start a graphical applications installed on a remote Linux system and forward that application windows
(screen) to the local system
</p>

<ol class="org-ol">
<li>/etc/sshd<sub>config</sub>
<ul class="org-ul">
<li>ForwardX11=yes</li>
</ul></li>
<li>ssh -Y host</li>
</ol>


<p>
ssh -X - is not working:
</p>
<ul class="org-ul">
<li>Warning: untrusted X11 forwarding setup failed: xauth key data not generated</li>
<li>xset: ubable to open display ""</li>
</ul>
</div>
</div>
