sources_org/shell.org
** 5) sshfs - client
- File systems  --->  [*] FUSE (Filesystem in Userspace) support
- emerge --ask net-fs/sshfs
- umount: fusermount -u /path/to/local/sshfs/mount

Options for access:
- -o allow_other
  - replace allow_other with allow_root, for root).
- -o umask=M
  - set file permissions (octal)
- -o uid=N
  - set file owner
- -o gid=N
  - set file group


It is recommended to run SSHFS as regular user (not as root).

There is your options:
1) run as root
   - only root can access folder
   - with allow_other - you must hide folder as subfolder and set permissions on parent folder
     - chmod o-rwx /mnt
     - chown root:users /mnt
     - mkdir /mnt/share
     - sshfs -o allow_others -o uid=1000 -o gid=100 target:/mnt/share /mnt/share
2) run as user
   - only user can access folder
   - root and user can access folder but user can allow access to anyone
     - with /etc/fuse.conf uncomment: user_allow_other
     - sudo -u user sshfs -o allow_root -o uid=1000 -o gid=100 target:/mnt/share /mnt/share

/etc/fstab:
- as root (allow_other):
  - sshfs#SERVER_USER@remotehost:/SOURCEDIR /home/USER/Music fuse user,_netdev,idmap=user,transform_symlinks,identityfile=/home/USER/.ssh/id_rsa,allow_other,default_permissions,uid=1000,gid=1000 0 0
  - user@host:/remote/path /local/path  fuse.sshfs noauto,x-systemd.automount,_netdev,users,idmap=user,IdentityFile=/home/user/.ssh/id_rsa,allow_other,reconnect 0 0
    - noauto tells it not to mount at boot
    - x-systemd.automount does the on-demand magic
    - _netdev tells it that it is a network device, not a block device (without it "No such device" errors might happen)
- as user:
  - user@host:/remote/path /local/path  fuse.sshfs noauto,x-systemd.automount,_netdev,user,idmap=user,follow_symlinks,identityfile=/home/user/.ssh/id_rsa,allow_other,default_permissions,uid=USER_ID_N,gid=USER_GID_N 0 0

up:
- sshfs -o allow_other -o uid=1000 -o gid=100 target:/mnt/share /mnt/share

down:
- chmod -R g+rwx /mnt/share/* # allow at target to write
- fusermount -u /mnt/share # umount
** TODO Internet over socks
Viriant 1 - tun - man ssh
- https://www.copahost.com/blog/openvpn-in-ubuntu-tun-tap/
- # cat /dev/net/tun
  - cat: /dev/net/tun: File descriptor in bad state
  - If the output shows “File descriptor in bad state”, then it means it is working correctly.

Variant 2 - proxychains
- ssh -fNTD 127.0.0.1:<local port> username@sshserver
  - -f go backgroound
  - -N Do not execute a remote command.  This is useful for just for warding ports.
  - -T Disable pseudo-terminal allocation.
- edit /etc/proxychains.conf :
  - socks5 127.0.0.1 <localport>
  - proxy_dns
- proxychains <program name>


Variant 2 - tsocks
** DNS over socks
- net-proxy/dnsproxy
- https://github.com/awaw/dnsproxy
- test dnsproxy: dig @127.0.0.1 -p 53000 google.com (dnsutils)

problems: resolv.conf require 53 UDP port
1. you need to root to redirect to 53 port
2. UDP is not forwarded with SSH directly

solution:
- sudo -u ssh ssh -L 6667:0.0.0.0:6667 -C -o ProxyCommand='nc -X 5 -x 127.0.0.1:1082 %h %p' -p 9067 root@remove_ssh
- remote:
  - mkfifo /tmp/fifo
  - nc -l -p 6667 < /tmp/fifo | nc -u localhost 53000 > /tmp/fifo
- local:
  - socat udp-listen:53,reuseaddr,fork TCP:127.0.0.1:6667 &
  - (other) # mkfifo /tmp/fifo ; sudo nc -l -u -p 53 < /tmp/fifo | nc localhost 6667 > /tmp/fifo




- server:
  - ssh -L 6667:0.0.0:6667 root@remove_ssh (sudo -u ssh ssh -L 6667:0.0.0.0:6667 -C -o ProxyCommand='nc -X 5
  -x 127.0.0.1:1082 %h %p' -p 22 root@remove_ssh)
  - socat tcp4-listen:6667,reuseaddr,fork UDP:127.0.0.1:53000
- local:
  - socat udp-listen:53,reuseaddr,fork TCP:127.0.0.1:6667 &
  - (bad)# mkfifo /tmp/fifo ; sudo nc -l -u -p 53 < /tmp/fifo | nc localhost 6667 > /tmp/fifo
  - /etc/resolv.conf: nameserver 127.0.0.1
  - prevent dhcpd overweite /etc/resolv.conf: chattr +i /etc/resolv.conf

/tmp/fifo

https://superuser.com/questions/53103/udp-traffic-through-ssh-tunnel
** ssh-agent
- key manager for SSH. It holds your keys and certificates in memory, unencrypted, and ready for use by ssh
- runs in the background on your system

*do not type password all the time*
- eval $(ssh-agent) or eval `ssh-agent` # to start agent
- ssh-agent -k # to kill agent
- ssh-add -l # list private keys currently accessible to the agent ~/.ssh/id_rsa
- ssh-add key
- ssh-add -D - del -l list

ssh-add without any parameters - it will scan your home directory for some standard keys and add them to your
agent

ssh-agent -k # kill daemon

** agent forwarding problem
security risk: anyone with root access on the remote host can discreetly access your local SSH agent through
the socket. They can use your keys to impersonate you on other machines on the network.

How to reduce your risk when agent forwarding:
- ssh -A turns on agent forwarding for a single session.
- ssh-add -x locks the agent with a password, and ssh-add -X unlocks it
- alternative SSH agent that prompts you when it’s being used.
- ProxyJump directive: ssh -J bastion.example.com cloud.computer.internal # to connect to
  cloud.computer.internal via your bastion.example.com
  1. your SSH client uses keys from your agent to connect to bastion.example.com.
  2. Once connected, SSHD on the bastion connects to cloud.computer.internal and hands that connection off to
     your local SSH client.
  3. Your local SSH client runs through the handshake again, this time with cloud.computer.internal.
- Older versions of SSH and SSHD (prior to 7.2, released in 2016) don’t support ProxyJump:
  - ssh -o ProxyCommand="ssh bastion.example.com nc %h %p" cloud.computer.internal

https://smallstep.com/blog/ssh-agent-explained/
** ssh-copy-id
ssh-copy-id user@hostname.example.com -p <port-number>

copies the public key of your default identity (use -i identity_file for other identities) to the remote host.
