shell.html
<div id="outline-container-org5c4bb06" class="outline-3">
<h3 id="org5c4bb06"><span class="section-number-3">5.10.</span> 5) sshfs - client</h3>
<div class="outline-text-3" id="text-5-10">
<ul class="org-ul">
<li>File systems  &#x2014;&gt;  [*] FUSE (Filesystem in Userspace) support</li>
<li>emerge &#x2013;ask net-fs/sshfs</li>
<li>umount: fusermount -u /path/to/local/sshfs/mount</li>
</ul>

<p>
Options for access:
</p>
<ul class="org-ul">
<li>-o allow<sub>other</sub>
<ul class="org-ul">
<li>replace allow<sub>other</sub> with allow<sub>root</sub>, for root).</li>
</ul></li>
<li>-o umask=M
<ul class="org-ul">
<li>set file permissions (octal)</li>
</ul></li>
<li>-o uid=N
<ul class="org-ul">
<li>set file owner</li>
</ul></li>
<li>-o gid=N
<ul class="org-ul">
<li>set file group</li>
</ul></li>
</ul>


<p>
It is recommended to run SSHFS as regular user (not as root).
</p>

<p>
There is your options:
</p>
<ol class="org-ol">
<li>run as root
<ul class="org-ul">
<li>only root can access folder</li>
<li>with allow<sub>other</sub> - you must hide folder as subfolder and set permissions on parent folder
<ul class="org-ul">
<li>chmod o-rwx /mnt</li>
<li>chown root:users /mnt</li>
<li>mkdir /mnt/share</li>
<li>sshfs -o allow<sub>others</sub> -o uid=1000 -o gid=100 target:/mnt/share /mnt/share</li>
</ul></li>
</ul></li>
<li>run as user
<ul class="org-ul">
<li>only user can access folder</li>
<li>root and user can access folder but user can allow access to anyone
<ul class="org-ul">
<li>with /etc/fuse.conf uncomment: user<sub>allow</sub><sub>other</sub></li>
<li>sudo -u user sshfs -o allow<sub>root</sub> -o uid=1000 -o gid=100 target:/mnt/share /mnt/share</li>
</ul></li>
</ul></li>
</ol>

<p>
/etc/fstab:
</p>
<ul class="org-ul">
<li>as root (allow<sub>other</sub>):
<ul class="org-ul">
<li>sshfs#SERVER<sub>USER</sub>@remotehost:/SOURCEDIR <i>home/USER/Music fuse user,<sub>netdev,idmap</sub>=user,transform<sub>symlinks,identityfile</sub>=/home/USER</i>.ssh/id<sub>rsa,allow</sub><sub>other,default</sub><sub>permissions,uid</sub>=1000,gid=1000 0 0</li>
<li>user@host:/remote/path <i>local/path  fuse.sshfs noauto,x-systemd.automount,<sub>netdev,users,idmap</sub>=user,IdentityFile=/home/user</i>.ssh/id<sub>rsa,allow</sub><sub>other,reconnect</sub> 0 0
<ul class="org-ul">
<li>noauto tells it not to mount at boot</li>
<li>x-systemd.automount does the on-demand magic</li>
<li>_netdev tells it that it is a network device, not a block device (without it "No such device" errors might happen)</li>
</ul></li>
</ul></li>
<li>as user:
<ul class="org-ul">
<li>user@host:/remote/path <i>local/path  fuse.sshfs noauto,x-systemd.automount,<sub>netdev,user,idmap</sub>=user,follow<sub>symlinks,identityfile</sub>=/home/user</i>.ssh/id<sub>rsa,allow</sub><sub>other,default</sub><sub>permissions,uid</sub>=USER<sub>ID</sub><sub>N,gid</sub>=USER<sub>GID</sub><sub>N</sub> 0 0</li>
</ul></li>
</ul>

<p>
up:
</p>
<ul class="org-ul">
<li>sshfs -o allow<sub>other</sub> -o uid=1000 -o gid=100 target:/mnt/share /mnt/share</li>
</ul>

<p>
down:
</p>
<ul class="org-ul">
<li>chmod -R g+rwx /mnt/share/* # allow at target to write</li>
<li>fusermount -u /mnt/share # umount</li>
</ul>
</div>
</div>
<div id="outline-container-orga4fef71" class="outline-3">
<h3 id="orga4fef71"><span class="section-number-3">5.11.</span> <span class="todo TODO">TODO</span> Internet over socks</h3>
<div class="outline-text-3" id="text-5-11">
<p>
Viriant 1 - tun - man ssh
</p>
<ul class="org-ul">
<li><a href="https://www.copahost.com/blog/openvpn-in-ubuntu-tun-tap/">https://www.copahost.com/blog/openvpn-in-ubuntu-tun-tap/</a></li>
<li># cat /dev/net/tun
<ul class="org-ul">
<li>cat: /dev/net/tun: File descriptor in bad state</li>
<li>If the output shows “File descriptor in bad state”, then it means it is working correctly.</li>
</ul></li>
</ul>

<p>
Variant 2 - proxychains
</p>
<ul class="org-ul">
<li>ssh -fNTD 127.0.0.1:&lt;local port&gt; username@sshserver
<ul class="org-ul">
<li>-f go backgroound</li>
<li>-N Do not execute a remote command.  This is useful for just for warding ports.</li>
<li>-T Disable pseudo-terminal allocation.</li>
</ul></li>
<li>edit /etc/proxychains.conf :
<ul class="org-ul">
<li>socks5 127.0.0.1 &lt;localport&gt;</li>
<li>proxy<sub>dns</sub></li>
</ul></li>
<li>proxychains &lt;program name&gt;</li>
</ul>


<p>
Variant 2 - tsocks
</p>
</div>
</div>
<div id="outline-container-orga29a232" class="outline-3">
<h3 id="orga29a232"><span class="section-number-3">5.12.</span> DNS over socks</h3>
<div class="outline-text-3" id="text-5-12">
<ul class="org-ul">
<li>net-proxy/dnsproxy</li>
<li><a href="https://github.com/awaw/dnsproxy">https://github.com/awaw/dnsproxy</a></li>
<li>test dnsproxy: dig @127.0.0.1 -p 53000 google.com (dnsutils)</li>
</ul>

<p>
problems: resolv.conf require 53 UDP port
</p>
<ol class="org-ol">
<li>you need to root to redirect to 53 port</li>
<li>UDP is not forwarded with SSH directly</li>
</ol>

<p>
solution:
</p>
<ul class="org-ul">
<li>sudo -u ssh ssh -L 6667:0.0.0.0:6667 -C -o ProxyCommand='nc -X 5 -x 127.0.0.1:1082 %h %p' -p 9067 root@remove<sub>ssh</sub></li>
<li>remote:
<ul class="org-ul">
<li>mkfifo /tmp/fifo</li>
<li>nc -l -p 6667 &lt; /tmp/fifo | nc -u localhost 53000 &gt; /tmp/fifo</li>
</ul></li>
<li>local:
<ul class="org-ul">
<li>socat udp-listen:53,reuseaddr,fork TCP:127.0.0.1:6667 &amp;</li>
<li>(other) # mkfifo /tmp/fifo ; sudo nc -l -u -p 53 &lt; /tmp/fifo | nc localhost 6667 &gt; /tmp/fifo</li>
</ul></li>
</ul>




<ul class="org-ul">
<li><p>
server:
</p>
<ul class="org-ul">
<li>ssh -L 6667:0.0.0:6667 root@remove<sub>ssh</sub> (sudo -u ssh ssh -L 6667:0.0.0.0:6667 -C -o ProxyCommand='nc -X 5</li>
</ul>
<p>
-x 127.0.0.1:1082 %h %p' -p 22 root@remove<sub>ssh</sub>)
</p>
<ul class="org-ul">
<li>socat tcp4-listen:6667,reuseaddr,fork UDP:127.0.0.1:53000</li>
</ul></li>
<li>local:
<ul class="org-ul">
<li>socat udp-listen:53,reuseaddr,fork TCP:127.0.0.1:6667 &amp;</li>
<li>(bad)# mkfifo /tmp/fifo ; sudo nc -l -u -p 53 &lt; /tmp/fifo | nc localhost 6667 &gt; /tmp/fifo</li>
<li>/etc/resolv.conf: nameserver 127.0.0.1</li>
<li>prevent dhcpd overweite /etc/resolv.conf: chattr +i /etc/resolv.conf</li>
</ul></li>
</ul>

<p>
/tmp/fifo
</p>

<p>
<a href="https://superuser.com/questions/53103/udp-traffic-through-ssh-tunnel">https://superuser.com/questions/53103/udp-traffic-through-ssh-tunnel</a>
</p>
</div>
</div>
<div id="outline-container-orgcf2300e" class="outline-3">
<h3 id="orgcf2300e"><span class="section-number-3">5.13.</span> ssh-agent</h3>
<div class="outline-text-3" id="text-5-13">
<ul class="org-ul">
<li>key manager for SSH. It holds your keys and certificates in memory, unencrypted, and ready for use by ssh</li>
<li>runs in the background on your system</li>
</ul>

<p>
<b>do not type password all the time</b>
</p>
<ul class="org-ul">
<li>eval $(ssh-agent) or eval `ssh-agent` # to start agent</li>
<li>ssh-agent -k # to kill agent</li>
<li>ssh-add -l # list private keys currently accessible to the agent ~/.ssh/id<sub>rsa</sub></li>
<li>ssh-add key</li>
<li>ssh-add -D - del -l list</li>
</ul>

<p>
ssh-add without any parameters - it will scan your home directory for some standard keys and add them to your
agent
</p>

<p>
ssh-agent -k # kill daemon
</p>
</div>
</div>

<div id="outline-container-org462cadf" class="outline-3">
<h3 id="org462cadf"><span class="section-number-3">5.14.</span> agent forwarding problem</h3>
<div class="outline-text-3" id="text-5-14">
<p>
security risk: anyone with root access on the remote host can discreetly access your local SSH agent through
the socket. They can use your keys to impersonate you on other machines on the network.
</p>

<p>
How to reduce your risk when agent forwarding:
</p>
<ul class="org-ul">
<li>ssh -A turns on agent forwarding for a single session.</li>
<li>ssh-add -x locks the agent with a password, and ssh-add -X unlocks it</li>
<li>alternative SSH agent that prompts you when it’s being used.</li>
<li>ProxyJump directive: ssh -J bastion.example.com cloud.computer.internal # to connect to
cloud.computer.internal via your bastion.example.com
<ol class="org-ol">
<li>your SSH client uses keys from your agent to connect to bastion.example.com.</li>
<li>Once connected, SSHD on the bastion connects to cloud.computer.internal and hands that connection off to
your local SSH client.</li>
<li>Your local SSH client runs through the handshake again, this time with cloud.computer.internal.</li>
</ol></li>
<li>Older versions of SSH and SSHD (prior to 7.2, released in 2016) don’t support ProxyJump:
<ul class="org-ul">
<li>ssh -o ProxyCommand="ssh bastion.example.com nc %h %p" cloud.computer.internal</li>
</ul></li>
</ul>

<p>
<a href="https://smallstep.com/blog/ssh-agent-explained/">https://smallstep.com/blog/ssh-agent-explained/</a>
</p>
</div>
</div>
<div id="outline-container-orge2641e5" class="outline-3">
<h3 id="orge2641e5"><span class="section-number-3">5.15.</span> ssh-copy-id</h3>
<div class="outline-text-3" id="text-5-15">
<p>
ssh-copy-id user@hostname.example.com -p &lt;port-number&gt;
</p>

<p>
copies the public key of your default identity (use -i identity<sub>file</sub> for other identities) to the remote host.
</p>
</div>
</div>
