sources_org/shell.org
** inside of ssh
- The client presents a public key to the server.
- The server generates and sends a brief, random message, asking the client to sign it using the private key.
- The client asks the SSH agent to sign the message and forwards the result back to the server.
- The server checks the signature using the client’s public key.
- The server now has proof that the client is in possession of their private key.
- Later in the handshake process, a set of new, ephemeral and symmetric keys are generated and used to encrypt
  the SSH session traffic. These keys may not even last the entire session; a “rekey” event happens at regular
  intervals.

** old


В начале - настраиваем сервар на аутентификация по ключу
1) на клиенте (без пароля): ssh-keygen -o -b 4096 -t rsa -f ~/.ssh/mykey_rsa
2) на сервере по рутом /etc/ssh/sshd_config:
   - PermitRootLogin yes
   - PubkeyAuthentication no
   - PasswordAuthentication yes
На клиенте - копируем публичный ключ на сервер в authorized_keys:
- ip = 10.0.0.1 - сервера
- scp user@$ip:"~/.ssh/mykey_rsa.pub" ~/.ssh/authorized_keys

потом на сервере :
- PubkeyAuthentication yes
- AuthorizedKeysFile      .ssh/authorized_keys
- PasswordAuthentication no
- UsePAM no - Also verify UsePAM yes is not in the configuration file; it overrides the public key
  authentication mechanism. Alternatively PasswordAuthentication or ChallengeResponseAuthentication
  directives can be disabled

X: конектится по ssh сразу под тем пользователем под которым хочешь запустить X-приложение
- /etc/ssh/sshd_config
  - X11Forwarding yes
  - X11DisplayOffset 10

# E82.40 Check Point Remote Access VPN Clients for Windows
wine msiexec /i E82.40_CheckPointVPN.msi

*SOCKS 5 прокси*
ssh -D 8888 user@33.224.56.34

*restict one command with argument*
1. command="./nuke $SSH_ORIGINAL_COMMAND",no-port-forwarding,no-x11-forwarding,no-agent-forwarding KEY_TYPE KEY COMMENT
2. ./nuke:
   - set -euf -o pipefail
   - echo "$@"

*copy public key to remote machine*
- ssh-copy-id -i ~/.ssh/id_rsa.pub 192.168.0.1

** githib ~/.ssh/config
IdentityFile - replace for "ssh -i"

#+begin_src
# alias:
Host github.com
    HostName github.com
    Port 22
    User git_username
    IdentityFile ~/.ssh/rsa_id
    PreferredAuthentications publickey
#+end_src

** key type
- RSA - difficulty of factoring large numbers
- DSA - no longer recommended.
- ECDSA - weak - elliptic curves. Only three key sizes are supported: 256, 384, and 521 (sic!) bits.
- ed25519 (EdDS) - new

 https://stribika.github.io/2015/01/04/secure-secure-shell.html
** security
- Protocol 2                                  	                #Protocol 1 is fundamentally broken
- StrictModes yes                                                 #Protects from misconfiguration


Diffie-Hellman key exchange
- use 2048-bit or larger primes

RFC4419: The use of multiple moduli inhibits a determined attacker from precalculating moduli exchange values,
and discourages dedication of resources for analysis of any particular modulus.

generate new non elliptic-curve primes do this:
- ssh-keygen -G moduli-2048.candidates -b 2048
- ssh-keygen -T moduli-2048 -f moduli-2048.candidates
- cp moduli-2048 /etc/ssh/moduli

soft
- sshguard
- fail2ban

- Logjam Attack https://weakdh.org/

Stronger sshd_config:
- ClientAliveInterval 60 # seconds
** Port Forwarding/Tunneling
https://www.techrepublic.com/article/how-to-use-local-and-remote-ssh-port-forwarding/

-N - Do not execute a remote command.  This is useful for just forwarding ports.
-f - background
*** Local
local port to conecting ssh mashine

-g      Allows remote hosts to connect to local forwarded ports.

cons:
- TLS certificate validation fails
- When the website you are accessing redirects you to another URL, the connection fails because port
  forwarding is only valid for exactly this web server. This situation might be a problem when using single
  sign-on (SSO), for instance.
**** ex
ssh -L 8080:localhost:80 root@host.com

localhost:8080 forwarded to remote address host.com:80.

Enables you to access another server from your local computer
- port numbers that are less than 1024 or greater than 49151 are reserved for the system

: ssh -L 8080:www.slashdot.org:80 localhost

You will be prompted to enter your user password for the client machine.  You are connecting, via SSH, back to
your client machine, but creating the necessary SSH tunnel to the destination. After that, open up a browser
and point it to http://localhost:8080. Your browser should automatically redirect you to Slashdot.

: ssh -L 9090:example.com:80 admin@server.com

localhost port 9090 will be connected to example.com:80

: ssh -L 9090:localhost:3306 admin@server.com

localhost 3306 will be opened as localhost 9090 for access admin@server.com

: ssh -L 0.0.0.0:80:site.com:80 -p 9983 root@localhost

create mirror of site.com
*** Remote
require: GatewayPorts yes in sshd_config

: ssh -R 9090:example.com:80 admin@server.com

server.com 9090 will be forwardet to example.com 80 which is accessed on local network only of server.com

: ssh -R 5900:localhost:5900 USERNAME@192.168.1.192

192.168.1.192 5900 will be forwarded to localhost 5900 with encryption

: ssh -R 6066:localhost:22 USERNAME@192.168.1.192
192.168.1.192 6066 will be forwarded to localhost 22 with encryption
*** Dynamic
ssh will act as SOCKS4/5 proxy (Port 1080 is the IANA registered port for SOCKS)

: ssh -D 1080 bastion.securecorp.io

localhost 1080 is now SOCKS proxy to bastion.securecorp.io which is work as SOCKS proxy

*** examples
vps double socks
- ssh -D 1080 local_user@localhost # create socks proxy on localhost
- ssh -R 1080:localhost:1080 root@vps.com # allow access local 1080 port
- ssh -L 1080:localhost:1080 -p 49382 root@cps.com # crate local 1080 which will be forwarded to remote 1080
-
