shell.html
<div id="outline-container-orge0849ae" class="outline-3">
<h3 id="orge0849ae"><span class="section-number-3">5.16.</span> inside of ssh</h3>
<div class="outline-text-3" id="text-5-16">
<ul class="org-ul">
<li>The client presents a public key to the server.</li>
<li>The server generates and sends a brief, random message, asking the client to sign it using the private key.</li>
<li>The client asks the SSH agent to sign the message and forwards the result back to the server.</li>
<li>The server checks the signature using the client’s public key.</li>
<li>The server now has proof that the client is in possession of their private key.</li>
<li>Later in the handshake process, a set of new, ephemeral and symmetric keys are generated and used to encrypt
the SSH session traffic. These keys may not even last the entire session; a “rekey” event happens at regular
intervals.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2d000e" class="outline-3">
<h3 id="orgf2d000e"><span class="section-number-3">5.17.</span> old</h3>
<div class="outline-text-3" id="text-5-17">
<p>
В начале - настраиваем сервар на аутентификация по ключу
</p>
<ol class="org-ol">
<li>на клиенте (без пароля): ssh-keygen -o -b 4096 -t rsa -f ~/.ssh/mykey<sub>rsa</sub></li>
<li>на сервере по рутом /etc/ssh/sshd<sub>config</sub>:
<ul class="org-ul">
<li>PermitRootLogin yes</li>
<li>PubkeyAuthentication no</li>
<li>PasswordAuthentication yes</li>
</ul></li>
</ol>
<p>
На клиенте - копируем публичный ключ на сервер в authorized<sub>keys</sub>:
</p>
<ul class="org-ul">
<li>ip = 10.0.0.1 - сервера</li>
<li>scp user@$ip:"~/.ssh/mykey<sub>rsa.pub</sub>" ~/.ssh/authorized<sub>keys</sub></li>
</ul>

<p>
потом на сервере :
</p>
<ul class="org-ul">
<li>PubkeyAuthentication yes</li>
<li>AuthorizedKeysFile      .ssh/authorized<sub>keys</sub></li>
<li>PasswordAuthentication no</li>
<li>UsePAM no - Also verify UsePAM yes is not in the configuration file; it overrides the public key
authentication mechanism. Alternatively PasswordAuthentication or ChallengeResponseAuthentication
directives can be disabled</li>
</ul>

<p>
X: конектится по ssh сразу под тем пользователем под которым хочешь запустить X-приложение
</p>
<ul class="org-ul">
<li>/etc/ssh/sshd<sub>config</sub>
<ul class="org-ul">
<li>X11Forwarding yes</li>
<li>X11DisplayOffset 10</li>
</ul></li>
</ul>

<p>
wine msiexec /i E82.40<sub>CheckPointVPN.msi</sub>
</p>

<p>
<b>SOCKS 5 прокси</b>
ssh -D 8888 user@33.224.56.34
</p>

<p>
<b>restict one command with argument</b>
</p>
<ol class="org-ol">
<li>command="./nuke $SSH<sub>ORIGINAL</sub><sub>COMMAND</sub>",no-port-forwarding,no-x11-forwarding,no-agent-forwarding KEY<sub>TYPE</sub> KEY COMMENT</li>
<li>./nuke:
<ul class="org-ul">
<li>set -euf -o pipefail</li>
<li>echo "$@"</li>
</ul></li>
</ol>

<p>
<b>copy public key to remote machine</b>
</p>
<ul class="org-ul">
<li>ssh-copy-id -i ~/.ssh/id<sub>rsa.pub</sub> 192.168.0.1</li>
</ul>
</div>
</div>

<div id="outline-container-orgc9cec63" class="outline-3">
<h3 id="orgc9cec63"><span class="section-number-3">5.18.</span> githib ~/.ssh/config</h3>
<div class="outline-text-3" id="text-5-18">
<p>
IdentityFile - replace for "ssh -i"
</p>

<pre class="example">
# alias:
Host github.com
    HostName github.com
    Port 22
    User git_username
    IdentityFile ~/.ssh/rsa_id
    PreferredAuthentications publickey
</pre>
</div>
</div>

<div id="outline-container-orgf1b4503" class="outline-3">
<h3 id="orgf1b4503"><span class="section-number-3">5.19.</span> key type</h3>
<div class="outline-text-3" id="text-5-19">
<ul class="org-ul">
<li>RSA - difficulty of factoring large numbers</li>
<li>DSA - no longer recommended.</li>
<li>ECDSA - weak - elliptic curves. Only three key sizes are supported: 256, 384, and 521 (sic!) bits.</li>
<li><p>
ed25519 (EdDS) - new
</p>

<p>
<a href="https://stribika.github.io/2015/01/04/secure-secure-shell.html">https://stribika.github.io/2015/01/04/secure-secure-shell.html</a>
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orga1ad062" class="outline-3">
<h3 id="orga1ad062"><span class="section-number-3">5.20.</span> security</h3>
<div class="outline-text-3" id="text-5-20">
<ul class="org-ul">
<li>Protocol 2                                  	                #Protocol 1 is fundamentally broken</li>
<li>StrictModes yes                                                 #Protects from misconfiguration</li>
</ul>


<p>
Diffie-Hellman key exchange
</p>
<ul class="org-ul">
<li>use 2048-bit or larger primes</li>
</ul>

<p>
RFC4419: The use of multiple moduli inhibits a determined attacker from precalculating moduli exchange values,
and discourages dedication of resources for analysis of any particular modulus.
</p>

<p>
generate new non elliptic-curve primes do this:
</p>
<ul class="org-ul">
<li>ssh-keygen -G moduli-2048.candidates -b 2048</li>
<li>ssh-keygen -T moduli-2048 -f moduli-2048.candidates</li>
<li>cp moduli-2048 /etc/ssh/moduli</li>
</ul>

<p>
soft
</p>
<ul class="org-ul">
<li>sshguard</li>
<li>fail2ban</li>

<li>Logjam Attack <a href="https://weakdh.org/">https://weakdh.org/</a></li>
</ul>

<p>
Stronger sshd<sub>config</sub>:
</p>
<ul class="org-ul">
<li>ClientAliveInterval 60 # seconds</li>
</ul>
</div>
</div>
<div id="outline-container-org274104f" class="outline-3">
<h3 id="org274104f"><span class="section-number-3">5.21.</span> Port Forwarding/Tunneling</h3>
<div class="outline-text-3" id="text-5-21">
<p>
<a href="https://www.techrepublic.com/article/how-to-use-local-and-remote-ssh-port-forwarding/">https://www.techrepublic.com/article/how-to-use-local-and-remote-ssh-port-forwarding/</a>
</p>

<p>
-N - Do not execute a remote command.  This is useful for just forwarding ports.
-f - background
</p>
</div>
<div id="outline-container-org0571d16" class="outline-4">
<h4 id="org0571d16"><span class="section-number-4">5.21.1.</span> Local</h4>
<div class="outline-text-4" id="text-5-21-1">
<p>
local port to conecting ssh mashine
</p>

<p>
-g      Allows remote hosts to connect to local forwarded ports.
</p>

<p>
cons:
</p>
<ul class="org-ul">
<li>TLS certificate validation fails</li>
<li>When the website you are accessing redirects you to another URL, the connection fails because port
forwarding is only valid for exactly this web server. This situation might be a problem when using single
sign-on (SSO), for instance.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgaa2478a"></a>ex<br />
<div class="outline-text-5" id="text-5-21-1-1">
<p>
ssh -L 8080:localhost:80 root@host.com
</p>

<p>
localhost:8080 forwarded to remote address host.com:80.
</p>

<p>
Enables you to access another server from your local computer
</p>
<ul class="org-ul">
<li>port numbers that are less than 1024 or greater than 49151 are reserved for the system</li>
</ul>

<pre class="example">
ssh -L 8080:www.slashdot.org:80 localhost
</pre>


<p>
You will be prompted to enter your user password for the client machine.  You are connecting, via SSH, back to
your client machine, but creating the necessary SSH tunnel to the destination. After that, open up a browser
and point it to <a href="http://localhost:8080">http://localhost:8080</a>. Your browser should automatically redirect you to Slashdot.
</p>

<pre class="example">
ssh -L 9090:example.com:80 admin@server.com
</pre>


<p>
localhost port 9090 will be connected to example.com:80
</p>

<pre class="example">
ssh -L 9090:localhost:3306 admin@server.com
</pre>


<p>
localhost 3306 will be opened as localhost 9090 for access admin@server.com
</p>

<pre class="example">
ssh -L 0.0.0.0:80:site.com:80 -p 9983 root@localhost
</pre>


<p>
create mirror of site.com
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org205db21" class="outline-4">
<h4 id="org205db21"><span class="section-number-4">5.21.2.</span> Remote</h4>
<div class="outline-text-4" id="text-5-21-2">
<p>
require: GatewayPorts yes in sshd<sub>config</sub>
</p>

<pre class="example">
ssh -R 9090:example.com:80 admin@server.com
</pre>


<p>
server.com 9090 will be forwardet to example.com 80 which is accessed on local network only of server.com
</p>

<pre class="example">
ssh -R 5900:localhost:5900 USERNAME@192.168.1.192
</pre>


<p>
192.168.1.192 5900 will be forwarded to localhost 5900 with encryption
</p>

<pre class="example">
ssh -R 6066:localhost:22 USERNAME@192.168.1.192
</pre>

<p>
192.168.1.192 6066 will be forwarded to localhost 22 with encryption
</p>
</div>
</div>
<div id="outline-container-orge08efeb" class="outline-4">
<h4 id="orge08efeb"><span class="section-number-4">5.21.3.</span> Dynamic</h4>
<div class="outline-text-4" id="text-5-21-3">
<p>
ssh will act as SOCKS4/5 proxy (Port 1080 is the IANA registered port for SOCKS)
</p>

<pre class="example">
ssh -D 1080 bastion.securecorp.io
</pre>


<p>
localhost 1080 is now SOCKS proxy to bastion.securecorp.io which is work as SOCKS proxy
</p>
</div>
</div>

<div id="outline-container-orgea14aeb" class="outline-4">
<h4 id="orgea14aeb"><span class="section-number-4">5.21.4.</span> examples</h4>
<div class="outline-text-4" id="text-5-21-4">
<p>
vps double socks
</p>
<ul class="org-ul">
<li>ssh -D 1080 local<sub>user</sub>@localhost # create socks proxy on localhost</li>
<li>ssh -R 1080:localhost:1080 root@vps.com # allow access local 1080 port</li>
<li>ssh -L 1080:localhost:1080 -p 49382 root@cps.com # crate local 1080 which will be forwarded to remote 1080</li>
<li></li>
</ul>
</div>
</div>
</div>
