sources_org/shell.org
** Reverse SSH Tunnel
Require: GatewayPorts yes in sshd_config ???

target:
- ssh -fN -R 7010:localhost:23 username@yourMachine
- yourMachine:7010 will be forwarded to target:22


https://jfrog.com/connect/post/reverse-ssh-tunneling-from-start-to-end/
https://www.marksanborn.net/howto/bypass-firewall-and-nat-with-reverse-ssh-tunnel/
** USE CASES
compare private and public
- diff <( ssh-keygen -y -e -f "id_rsa" ) <( ssh-keygen -y -e -f "id_rsa.pub" )

login to directory
: ssh root@host -t "cd /directory_wanted ; bash --login"

get sha256 of a keys
: ssh-keygen -l -E sha256 -f .ssh/id_rsa

** rsync
allow to resume downloading. Require: have rsync installed on both sides.
*** troubleshooting
No space left on device (28)
: --inplace
** user with limited permissions
1) /etc/ssh/sshd_config
#+begin_src conf
  Match Group sftp_users
  X11Forwarding no
  AllowTcpForwarding no
  ChrootDirectory /ubuntu # user folder
  ForceCommand internal-sftp
#+end_src
1) /etc/passwd:
   - ubuntu:x:1001:1001::/ubuntu:
2) folder
   - mkdir /ubuntu
   - chown root.root /ubuntu/
** links
- Памятка пользователям ssh https://habr.com/en/post/122445/
- https://en.wikibooks.org/wiki/OpenSSH/Cookbook/Public_Key_Authentication
- https://help.ubuntu.com/community/SSH/OpenSSH/Configuring
- config example https://stosb.com/blog/explaining-my-configs-sshd_config/

** ssh over socks5
- required: net-analyzer/openbsd-netcat
- ssh -o ProxyCommand='nc -X 5 -x 127.0.0.1:1081 %h %p' root@host
** problems
Connection closed by UNKNOWN port 65535
- error in ProxyCommand
** ssh as a tor hidden service <<ssh_hidden>>
- apt update
- apt install tor
- server /etc/tor/torrc:
#+begin_src conf
ShutdownWaitLength 1 seconds
# ExcludeNodes {ru}, {cn}, {by}, {kz}, {sy}, {am}, {in} # paranoid
GeoIPExcludeUnknown 1 # paranoid
Sandbox 0 # not compatible with obfs4
Log notice file /var/log/tor/tor_notices.log
SocksPort 0
ExitRelay 0
BridgeRelay 0
HiddenServiceDir /var/lib/tor/ssh
HiddenServicePort 22 127.0.0.1:22
#+end_src

Steps:

1) Client:
#+begin_src sh
openssl genpkey -algorithm x25519 -out key.private.pem
cat key.private.pem | grep -v " PRIVATE KEY" | base64 -d | tail --bytes=32 | base32 | sed 's/=//g' > private.key
openssl pkey -in key.private.pem -pubout | grep -v " PUBLIC KEY" | base64 -d | tail --bytes=32 | base32 | sed 's/=//g' > public.key
echo KEY_PUB=$(cat public.key)
#+end_src

2) Server:
- <HiddenServiceDir>/authorized_clients/<user>.auth
  - descriptor:x25519:<public.key>
- mkdir /var/lib/tor/ssh
- chmod go-a /var/lib/
  tor/ssh

3) Client:
- torrc: ClientOnionAuthDir /var/lib/tor/userauth
- create file: <ClientOnionAuthDir>/<user>.auth_private
  - <56-char-onion-addr-without-.onion-part>:descriptor:x25519:<private.key>
#+begin_src sh
KEY_USER=ta
ONION=xfe4swdndyhauaxj5di5ewnce2egr7qonn475vvopywonpe76jara2id.onion
PRIVATE=
cat <<EOF > userauth.sh
#!/bin/bash
echo "${ONION:0:56}:descriptor:x25519:$PRIVATE" > /var/lib/tor/userauth/$KEY_USER.auth_private
EOF
#+end_src



#+begin_src sh
SSH_TOR_PORT=88
SSH_PORT=49382
KEY_USER=ta
KEY_PUB=P66JHL7W3R32O2DJBSGNVNR66JKJAS4KDG5Q4Q4EQM7CVH3X3IGQ
apt update
apt install tor
cat <<EOF > /etc/tor/torrc
RunAsDaemon 1
ShutdownWaitLength 1 seconds
GeoIPExcludeUnknown 0
Sandbox 0 # not compatible with obfs4
Log notice file /var/log/tor/tor_notices.log
SocksPort 0
ExitRelay 0
BridgeRelay 0
HiddenServiceDir /var/lib/tor/ssh
HiddenServicePort $SSH_TOR_PORT 127.0.0.1:$SSH_PORT
EOF
mkdir -p /var/lib/tor/ssh/authorized_clients
chmod -R 700 /var/lib/tor/ssh
chown -R debian-tor:debian-tor /var/lib/tor/ssh
echo "descriptor:x25519:$KEY_PUB" > /var/lib/tor/ssh/authorized_clients/$KEY_USER.auth
systemctl restart tor
sleep 7
cat /var/lib/tor/ssh/hostname
#+end_src

https://www.maths.tcd.ie/~fionn/misc/ssh_hidden_service/

** ssh systemd service
#+begin_src conf
[Unit]
Description=Setup a secure tunnel to %I
After=network.target

[Service]
Environment="LOCAL_ADDR=localhost"
EnvironmentFile=/etc/default/secure-tunnel@%i
ExecStart=/usr/bin/ssh -NT -o ServerAliveInterval=60 -o ExitOnForwardFailure=yes -L ${LOCAL_ADDR}:${LOCAL_PORT}:localhost:${REMOTE_PORT} ${TARGET}

# Restart every >2 seconds to avoid StartLimitInterval failure
RestartSec=5
Restart=always

[Install]
WantedBy=multi-user.target
#+end_src
** rsync over ssh
Copy from remote to local
- rsync required on remote host:
: rsync -avzhP -e "ssh -p 6767" root@41.80.200.1:/home/rtorrent/downloads/Guns* /home/ssh/downloads/
