shell.html
<div id="outline-container-org72429c7" class="outline-3">
<h3 id="org72429c7"><span class="section-number-3">5.22.</span> Reverse SSH Tunnel</h3>
<div class="outline-text-3" id="text-5-22">
<p>
Require: GatewayPorts yes in sshd<sub>config</sub> ???
</p>

<p>
target:
</p>
<ul class="org-ul">
<li>ssh -fN -R 7010:localhost:23 username@yourMachine</li>
<li>yourMachine:7010 will be forwarded to target:22</li>
</ul>


<p>
<a href="https://jfrog.com/connect/post/reverse-ssh-tunneling-from-start-to-end/">https://jfrog.com/connect/post/reverse-ssh-tunneling-from-start-to-end/</a>
<a href="https://www.marksanborn.net/howto/bypass-firewall-and-nat-with-reverse-ssh-tunnel/">https://www.marksanborn.net/howto/bypass-firewall-and-nat-with-reverse-ssh-tunnel/</a>
</p>
</div>
</div>
<div id="outline-container-org6c9ad97" class="outline-3">
<h3 id="org6c9ad97"><span class="section-number-3">5.23.</span> USE CASES</h3>
<div class="outline-text-3" id="text-5-23">
<p>
compare private and public
</p>
<ul class="org-ul">
<li>diff &lt;( ssh-keygen -y -e -f "id<sub>rsa</sub>" ) &lt;( ssh-keygen -y -e -f "id<sub>rsa.pub</sub>" )</li>
</ul>

<p>
login to directory
</p>
<pre class="example">
ssh root@host -t "cd /directory_wanted ; bash --login"
</pre>


<p>
get sha256 of a keys
</p>
<pre class="example">
ssh-keygen -l -E sha256 -f .ssh/id_rsa
</pre>
</div>
</div>

<div id="outline-container-org76c2e4f" class="outline-3">
<h3 id="org76c2e4f"><span class="section-number-3">5.24.</span> rsync</h3>
<div class="outline-text-3" id="text-5-24">
<p>
allow to resume downloading. Require: have rsync installed on both sides.
</p>
</div>
<div id="outline-container-orgdca80ba" class="outline-4">
<h4 id="orgdca80ba"><span class="section-number-4">5.24.1.</span> troubleshooting</h4>
<div class="outline-text-4" id="text-5-24-1">
<p>
No space left on device (28)
</p>
<pre class="example">
--inplace
</pre>
</div>
</div>
</div>
<div id="outline-container-org364dfdd" class="outline-3">
<h3 id="org364dfdd"><span class="section-number-3">5.25.</span> user with limited permissions</h3>
<div class="outline-text-3" id="text-5-25">
<ol class="org-ol">
<li>/etc/ssh/sshd<sub>config</sub></li>
</ol>
<div class="org-src-container">
<pre class="src src-conf">  Match Group sftp_users
  X11Forwarding no
  AllowTcpForwarding no
  ChrootDirectory /ubuntu <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">user folder</span>
  ForceCommand internal-sftp
</pre>
</div>
<ol class="org-ol">
<li>/etc/passwd:
<ul class="org-ul">
<li>ubuntu:x:1001:1001::/ubuntu:</li>
</ul></li>
<li>folder
<ul class="org-ul">
<li>mkdir /ubuntu</li>
<li>chown root.root <i>ubuntu</i></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org9b6452c" class="outline-3">
<h3 id="org9b6452c"><span class="section-number-3">5.26.</span> links</h3>
<div class="outline-text-3" id="text-5-26">
<ul class="org-ul">
<li>Памятка пользователям ssh <a href="https://habr.com/en/post/122445/">https://habr.com/en/post/122445/</a></li>
<li><a href="https://en.wikibooks.org/wiki/OpenSSH/Cookbook/Public_Key_Authentication">https://en.wikibooks.org/wiki/OpenSSH/Cookbook/Public_Key_Authentication</a></li>
<li><a href="https://help.ubuntu.com/community/SSH/OpenSSH/Configuring">https://help.ubuntu.com/community/SSH/OpenSSH/Configuring</a></li>
<li>config example <a href="https://stosb.com/blog/explaining-my-configs-sshd_config/">https://stosb.com/blog/explaining-my-configs-sshd_config/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org57dd1f7" class="outline-3">
<h3 id="org57dd1f7"><span class="section-number-3">5.27.</span> ssh over socks5</h3>
<div class="outline-text-3" id="text-5-27">
<ul class="org-ul">
<li>required: net-analyzer/openbsd-netcat</li>
<li>ssh -o ProxyCommand='nc -X 5 -x 127.0.0.1:1081 %h %p' root@host</li>
</ul>
</div>
</div>
<div id="outline-container-orge0e5780" class="outline-3">
<h3 id="orge0e5780"><span class="section-number-3">5.28.</span> problems</h3>
<div class="outline-text-3" id="text-5-28">
<p>
Connection closed by UNKNOWN port 65535
</p>
<ul class="org-ul">
<li>error in ProxyCommand</li>
</ul>
</div>
</div>
<div id="outline-container-org1408c25" class="outline-3">
<h3 id="org1408c25"><span class="section-number-3">5.29.</span> ssh as a tor hidden service <a id="orgbc66187"></a></h3>
<div class="outline-text-3" id="text-5-29">
<ul class="org-ul">
<li>apt update</li>
<li>apt install tor</li>
<li>server /etc/tor/torrc:</li>
</ul>
<div class="org-src-container">
<pre class="src src-conf">ShutdownWaitLength 1 seconds
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">ExcludeNodes {ru}, {cn}, {by}, {kz}, {sy}, {am}, {in} # paranoid</span>
GeoIPExcludeUnknown 1 <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">paranoid</span>
Sandbox 0 <span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">not compatible with obfs4</span>
Log notice file /var/log/tor/tor_notices.log
SocksPort 0
ExitRelay 0
BridgeRelay 0
HiddenServiceDir /var/lib/tor/ssh
HiddenServicePort 22 127.0.0.1:22
</pre>
</div>

<p>
Steps:
</p>

<ol class="org-ol">
<li>Client:</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">openssl genpkey -algorithm x25519 -out key.private.pem
cat key.private.pem | grep -v <span style="color: #95e454;">" PRIVATE KEY"</span> | base64 -d | tail --bytes=32 | base32 | sed <span style="color: #95e454;">'s/=//g'</span> &gt; private.key
openssl pkey -in key.private.pem -pubout | grep -v <span style="color: #95e454;">" PUBLIC KEY"</span> | base64 -d | tail --bytes=32 | base32 | sed <span style="color: #95e454;">'s/=//g'</span> &gt; public.key
<span style="color: #e5786d;">echo</span> <span style="color: #cae682;">KEY_PUB</span>=$(<span style="color: #fa8072;">cat public.key</span>)
</pre>
</div>

<ol class="org-ol">
<li>Server:</li>
<li>&lt;HiddenServiceDir&gt;/authorized<sub>clients</sub>/&lt;user&gt;.auth
<ul class="org-ul">
<li>descriptor:x25519:&lt;public.key&gt;</li>
</ul></li>
<li>mkdir /var/lib/tor/ssh</li>
<li>chmod go-a <i>var/lib</i>
tor/ssh</li>

<li>Client:</li>
<li>torrc: ClientOnionAuthDir /var/lib/tor/userauth</li>
<li>create file: &lt;ClientOnionAuthDir&gt;/&lt;user&gt;.auth<sub>private</sub>
<ul class="org-ul">
<li>&lt;56-char-onion-addr-without-.onion-part&gt;:descriptor:x25519:&lt;private.key&gt;</li>
</ul></li>
</ol>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682;">KEY_USER</span>=ta
<span style="color: #cae682;">ONION</span>=xfe4swdndyhauaxj5di5ewnce2egr7qonn475vvopywonpe76jara2id.onion
<span style="color: #cae682;">PRIVATE</span>=
cat &lt;&lt;EOF &gt; userauth.sh
<span style="color: #ffff00; font-weight: bold;">#!/bin/bash</span>
<span style="color: #ffff00; font-weight: bold;">echo "${ONION:0:56}:descriptor:x25519:$PRIVATE" &gt; /var/lib/tor/userauth/$KEY_USER.auth_private</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
</pre>
</div>



<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682;">SSH_TOR_PORT</span>=88
<span style="color: #cae682;">SSH_PORT</span>=49382
<span style="color: #cae682;">KEY_USER</span>=ta
<span style="color: #cae682;">KEY_PUB</span>=P66JHL7W3R32O2DJBSGNVNR66JKJAS4KDG5Q4Q4EQM7CVH3X3IGQ
apt update
apt install tor
cat &lt;&lt;EOF &gt; /etc/tor/torrc
<span style="color: #ffff00; font-weight: bold;">RunAsDaemon 1</span>
<span style="color: #ffff00; font-weight: bold;">ShutdownWaitLength 1 seconds</span>
<span style="color: #ffff00; font-weight: bold;">GeoIPExcludeUnknown 0</span>
<span style="color: #ffff00; font-weight: bold;">Sandbox 0 # not compatible with obfs4</span>
<span style="color: #ffff00; font-weight: bold;">Log notice file /var/log/tor/tor_notices.log</span>
<span style="color: #ffff00; font-weight: bold;">SocksPort 0</span>
<span style="color: #ffff00; font-weight: bold;">ExitRelay 0</span>
<span style="color: #ffff00; font-weight: bold;">BridgeRelay 0</span>
<span style="color: #ffff00; font-weight: bold;">HiddenServiceDir /var/lib/tor/ssh</span>
<span style="color: #ffff00; font-weight: bold;">HiddenServicePort $SSH_TOR_PORT 127.0.0.1:$SSH_PORT</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
mkdir -p /var/lib/tor/ssh/authorized_clients
chmod -R 700 /var/lib/tor/ssh
chown -R debian-tor:debian-tor /var/lib/tor/ssh
<span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"descriptor:x25519:$KEY_PUB"</span> &gt; /var/lib/tor/ssh/authorized_clients/$<span style="color: #cae682;">KEY_USER</span>.auth
systemctl restart tor
sleep 7
cat /var/lib/tor/ssh/hostname
</pre>
</div>

<p>
<a href="https://www.maths.tcd.ie/~fionn/misc/ssh_hidden_service/">https://www.maths.tcd.ie/~fionn/misc/ssh_hidden_service/</a>
</p>
</div>
</div>

<div id="outline-container-orgad1f13a" class="outline-3">
<h3 id="orgad1f13a"><span class="section-number-3">5.30.</span> ssh systemd service</h3>
<div class="outline-text-3" id="text-5-30">
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #92a65e; font-weight: bold;">Unit</span>]
<span style="color: #cae682;">Description</span>=Setup a secure tunnel to %I
<span style="color: #cae682;">After</span>=network.target

[<span style="color: #92a65e; font-weight: bold;">Service</span>]
<span style="color: #cae682;">Environment</span>=<span style="color: #95e454;">"LOCAL_ADDR=localhost"</span>
<span style="color: #cae682;">EnvironmentFile</span>=/etc/default/secure-tunnel@%i
<span style="color: #cae682;">ExecStart</span>=/usr/bin/ssh -NT -o ServerAliveInterval=60 -o ExitOnForwardFailure=yes -L ${LOCAL_ADDR}:${LOCAL_PORT}:localhost:${REMOTE_PORT} ${TARGET}

<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Restart every &gt;2 seconds to avoid StartLimitInterval failure</span>
<span style="color: #cae682;">RestartSec</span>=5
<span style="color: #cae682;">Restart</span>=always

[<span style="color: #92a65e; font-weight: bold;">Install</span>]
<span style="color: #cae682;">WantedBy</span>=multi-user.target
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbfa3163" class="outline-3">
<h3 id="orgbfa3163"><span class="section-number-3">5.31.</span> rsync over ssh</h3>
<div class="outline-text-3" id="text-5-31">
<p>
Copy from remote to local
</p>
<ul class="org-ul">
<li>rsync required on remote host:</li>
</ul>
<pre class="example">
rsync -avzhP -e "ssh -p 6767" root@41.80.200.1:/home/rtorrent/downloads/Guns* /home/ssh/downloads/
</pre>
</div>
</div>
