sources_org/shell.org
** timeouts
Client side:
- ServerAliveInterval 0 : Sets a timeout interval in seconds after which if no data has been received from
  the server, ssh will send a message through the encrypted channel to request a response from the server. For
  example, set a timeout to 15 seconds.
- ServerAliveCountMax 3 : Sets the number of server alive messages which may be sent without ssh command
  receiving any messages back from the server. If this threshold is reached while server alive messages are
  being sent, ssh will disconnect from the server, terminating the session. The server alive messages are sent
  through the encrypted channel and therefore will not be spoofable.

Timeout value = ClientAliveInterval * ClientAliveCountMax

Server side:
- ClientAliveInterval 0: Sets a timeout interval in seconds (30) after which if no data has been received from
  the client, sshd will send a message through the encrypted channel to request a response from the
  client. The default is 0, indicating that these messages will not be sent to the client. This option applies
  to protocol version 2 only. Send by encrypted channel.
- ClientAliveCountMax 3: Sets the number of client alive messages (5) which may be sent without sshd receiving any messages back from the client. If this threshold is reached while client alive messages are being sent, sshd will disconnect the client, terminating the session.
- TCPKeepAlive: “yes/no” send keepalive messages (default yes). Send by unencrypted channel.

: -o 'ServerAliveInterval 5' -o 'ServerAliveCountMax 10' -o 'TCPKeepAlive no'

* Text User Interface (TUI)
dialog
- --clear - clear the screen
-
#+begin_src bash :results output
dialog --clear --checklist "Favorite programming languages:" \
10 30 7 1 \
Python on 2 Java off 3 Bash off 4 Perl off 5 Ruby off
#+end_src

#+RESULTS:
:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 +----------------------------+| Favorite programming       || languages:

* jq - JSON parser
- https://jqlang.github.io/jq/manual/
- https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-shell.html

** output format
By default, jq pretty-prints JSON output.
- --raw-output / -r	raw JSON or string without quotes
- --raw-output0	new lines replace with NUL
-  --compact-output / -c:
- --color-output / -C and --monochrome-output / -M:
- --indent n
- --tab - use tab instead of spaces
** access
- .[]			get element
- ".[] | .name" 	access field
- " | .name"		map for every
- "map(.name)"		map for every
- "| keys"		function: get the keys of an object
- "| length"		function: get length
- map(has("name"))	check key exist and return true or false
- min/max
- unique
- jq '.[] | select(.color=="yellow")' - by condition
- .[] | select(.name|test("^o.")) - by regex match
omit one of the indexes:
: echo '[1,2,3,4,5,6,7,8,9,10]' | jq '.[:6]' | jq '.[-2:]' # [ 5, 6 ]

#+begin_src bash :results output
echo '{"fruit1":{"name":"apple"},"fruit2":{"name":"orange"}}' | jq '.[] | select(.name|test("^o."))'
#+end_src

#+RESULTS:
: {
:   "name": "orange"
: }


#+begin_src bash :results output :exports both
echo '{"fruit":{"name":"apple","color":"green","price":1.20}}' | jq -r 'map(has("name"))'
#+end_src

#+RESULTS:
: [
:   true
: ]


#+name: my-org-element2
#+BEGIN_EXAMPLE
{
  "result": {
    "alternatives": [
      {
        "message": {
          "role": "assistant",
          "text": "Согласно документации"
        },
        "status": "ALTERNATIVE_STATUS_FINAL"
      }
    ],
    "usage": {
      "inputTextTokens": "29",
      "completionTokens": "77",
      "totalTokens": "106"
    },
    "modelVersion": "18.01.2024"
  }
}
#+END_EXAMPLE

#+begin_src bash :results output :stdin my-org-element2
cat | jq "map(.alternatives)"
#+end_src

#+RESULTS:
#+begin_example
[
  [
    {
      "message": {
        "role": "assistant",
        "text": "Согласно документации"
      },
      "status": "ALTERNATIVE_STATUS_FINAL"
    }
  ]
]
#+end_example

** merge
cat Pipfile.lock | jq '.default | (keys | .[]) + (.[].version)'
** building
- ---null-input / -n
-
#+begin_src bash :results output
BUCKET_NAME=testbucket
OBJECT_NAME=testworkflow-2.0.1.jar
TARGET_LOCATION=/opt/test/testworkflow-2.0.1.jar

jq -n \
   --arg bn "$BUCKET_NAME" \
   --arg on "$OBJECT_NAME" \
   --arg tl "$TARGET_LOCATION" \
   '{bucketname: $bn, objectname: $on, targetlocation: $tl}'
#+end_src

#+RESULTS:
: {
:   "bucketname": "testbucket",
:   "objectname": "testworkflow-2.0.1.jar",
:   "targetlocation": "/opt/test/testworkflow-2.0.1.jar"
: }
* fish
- do not use indentation to define code blocks like Python.
- fish_indent -
* print JSON
#+begin_src bash :results output
BUCKET_NAME=testbucket
OBJECT_NAME=testworkflow-2.0.1.jar
TARGET_LOCATION=/opt/test/testworkflow-2.0.1.jar

JSON_FMT='{"bucketname":"%s","objectname":"%s","targetlocation":"%s"}\n'
printf "$JSON_FMT" "$BUCKET_NAME" "$OBJECT_NAME" "$TARGET_LOCATION"
#+end_src

#+RESULTS:
: {"bucketname":"testbucket","objectname":"testworkflow-2.0.1.jar","targetlocation":"/opt/test/testworkflow-2.0.1.jar"}
