shell.html
<div id="outline-container-org5671998" class="outline-3">
<h3 id="org5671998"><span class="section-number-3">5.32.</span> timeouts</h3>
<div class="outline-text-3" id="text-5-32">
<p>
Client side:
</p>
<ul class="org-ul">
<li>ServerAliveInterval 0 : Sets a timeout interval in seconds after which if no data has been received from
the server, ssh will send a message through the encrypted channel to request a response from the server. For
example, set a timeout to 15 seconds.</li>
<li>ServerAliveCountMax 3 : Sets the number of server alive messages which may be sent without ssh command
receiving any messages back from the server. If this threshold is reached while server alive messages are
being sent, ssh will disconnect from the server, terminating the session. The server alive messages are sent
through the encrypted channel and therefore will not be spoofable.</li>
</ul>

<p>
Timeout value = ClientAliveInterval * ClientAliveCountMax
</p>

<p>
Server side:
</p>
<ul class="org-ul">
<li>ClientAliveInterval 0: Sets a timeout interval in seconds (30) after which if no data has been received from
the client, sshd will send a message through the encrypted channel to request a response from the
client. The default is 0, indicating that these messages will not be sent to the client. This option applies
to protocol version 2 only. Send by encrypted channel.</li>
<li>ClientAliveCountMax 3: Sets the number of client alive messages (5) which may be sent without sshd receiving any messages back from the client. If this threshold is reached while client alive messages are being sent, sshd will disconnect the client, terminating the session.</li>
<li>TCPKeepAlive: “yes/no” send keepalive messages (default yes). Send by unencrypted channel.</li>
</ul>

<pre class="example">
-o 'ServerAliveInterval 5' -o 'ServerAliveCountMax 10' -o 'TCPKeepAlive no'
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ae2905" class="outline-2">
<h2 id="org0ae2905"><span class="section-number-2">6.</span> Text User Interface (TUI)</h2>
<div class="outline-text-2" id="text-6">
<p>
dialog
</p>
<ul class="org-ul">
<li>&#x2013;clear - clear the screen</li>
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">dialog --clear --checklist <span style="color: #95e454;">"Favorite programming languages:"</span> <span style="color: #95e454;">\</span>
10 30 7 1 <span style="color: #95e454;">\</span>
Python on 2 Java off 3 Bash off 4 Perl off 5 Ruby off
</pre>
</div>
</div>
</div>

<div id="outline-container-org1889ee8" class="outline-2">
<h2 id="org1889ee8"><span class="section-number-2">7.</span> jq - JSON parser</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://jqlang.github.io/jq/manual/">https://jqlang.github.io/jq/manual/</a></li>
<li><a href="https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-shell.html">https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-shell.html</a></li>
</ul>
</div>

<div id="outline-container-org0405d1d" class="outline-3">
<h3 id="org0405d1d"><span class="section-number-3">7.1.</span> output format</h3>
<div class="outline-text-3" id="text-7-1">
<p>
By default, jq pretty-prints JSON output.
</p>
<ul class="org-ul">
<li>&#x2013;raw-output / -r	raw JSON or string without quotes</li>
<li>&#x2013;raw-output0	new lines replace with NUL</li>
<li>&#x2013;compact-output / -c:</li>
<li>&#x2013;color-output / -C and &#x2013;monochrome-output / -M:</li>
<li>&#x2013;indent n</li>
<li>&#x2013;tab - use tab instead of spaces</li>
</ul>
</div>
</div>
<div id="outline-container-orgae7a53e" class="outline-3">
<h3 id="orgae7a53e"><span class="section-number-3">7.2.</span> access</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>.[]			get element</li>
<li>".[] | .name" 	access field</li>
<li>" | .name"		map for every</li>
<li>"map(.name)"		map for every</li>
<li>"| keys"		function: get the keys of an object</li>
<li>"| length"		function: get length</li>
<li>map(has("name"))	check key exist and return true or false</li>
<li>min/max</li>
<li>unique</li>
<li>jq '.[] | select(.color=="yellow")' - by condition</li>
<li>.[] | select(.name|test("<sup>o</sup>.")) - by regex match</li>
</ul>
<p>
omit one of the indexes:
</p>
<pre class="example">
echo '[1,2,3,4,5,6,7,8,9,10]' | jq '.[:6]' | jq '.[-2:]' # [ 5, 6 ]
</pre>


<div class="org-src-container">
<pre class="src src-bash"><span style="color: #e5786d;">echo</span> <span style="color: #95e454;">'{"fruit1":{"name":"apple"},"fruit2":{"name":"orange"}}'</span> | jq <span style="color: #95e454;">'.[] | select(.name|test("^o."))'</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-bash"><span style="color: #e5786d;">echo</span> <span style="color: #95e454;">'{"fruit":{"name":"apple","color":"green","price":1.20}}'</span> | jq -r <span style="color: #95e454;">'map(has("name"))'</span>
</pre>
</div>

<pre class="example">
[
  true
]
</pre>



<pre class="example" id="org3d8ab25">
{
  "result": {
    "alternatives": [
      {
        "message": {
          "role": "assistant",
          "text": "Согласно документации"
        },
        "status": "ALTERNATIVE_STATUS_FINAL"
      }
    ],
    "usage": {
      "inputTextTokens": "29",
      "completionTokens": "77",
      "totalTokens": "106"
    },
    "modelVersion": "18.01.2024"
  }
}
</pre>

<div class="org-src-container">
<pre class="src src-bash">cat | jq <span style="color: #95e454;">"map(.alternatives)"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb326a4f" class="outline-3">
<h3 id="orgb326a4f"><span class="section-number-3">7.3.</span> merge</h3>
<div class="outline-text-3" id="text-7-3">
<p>
cat Pipfile.lock | jq '.default | (keys | .[]) + (.[].version)'
</p>
</div>
</div>
<div id="outline-container-orga966f41" class="outline-3">
<h3 id="orga966f41"><span class="section-number-3">7.4.</span> building</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>&#x2014;null-input / -n</li>
<li></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682;">BUCKET_NAME</span>=testbucket
<span style="color: #cae682;">OBJECT_NAME</span>=testworkflow-2.0.1.jar
<span style="color: #cae682;">TARGET_LOCATION</span>=/opt/test/testworkflow-2.0.1.jar

jq -n <span style="color: #95e454;">\</span>
   --arg bn <span style="color: #95e454;">"$BUCKET_NAME"</span> <span style="color: #95e454;">\</span>
   --arg on <span style="color: #95e454;">"$OBJECT_NAME"</span> <span style="color: #95e454;">\</span>
   --arg tl <span style="color: #95e454;">"$TARGET_LOCATION"</span> <span style="color: #95e454;">\</span>
   <span style="color: #95e454;">'{bucketname: $bn, objectname: $on, targetlocation: $tl}'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd0f7aae" class="outline-2">
<h2 id="orgd0f7aae"><span class="section-number-2">8.</span> fish</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>do not use indentation to define code blocks like Python.</li>
<li>fish<sub>indent</sub> -</li>
</ul>
</div>
</div>
<div id="outline-container-orgc3cf0d9" class="outline-2">
<h2 id="orgc3cf0d9"><span class="section-number-2">9.</span> print JSON</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682;">BUCKET_NAME</span>=testbucket
<span style="color: #cae682;">OBJECT_NAME</span>=testworkflow-2.0.1.jar
<span style="color: #cae682;">TARGET_LOCATION</span>=/opt/test/testworkflow-2.0.1.jar

<span style="color: #cae682;">JSON_FMT</span>=<span style="color: #95e454;">'{"bucketname":"%s","objectname":"%s","targetlocation":"%s"}\n'</span>
<span style="color: #e5786d;">printf</span> <span style="color: #95e454;">"$JSON_FMT"</span> <span style="color: #95e454;">"$BUCKET_NAME"</span> <span style="color: #95e454;">"$OBJECT_NAME"</span> <span style="color: #95e454;">"$TARGET_LOCATION"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 12:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
